{
    "Email": "Usuario/Correo electrónico",
    "Password": "Contraseña",
    "Please wait while loading Adapter-Status ...": "Por favor, espere mientras se carga el adaptador de estado ...",
    "ProxyInfo": "Haga clic aquí para <a href=\"%s\" target=\"_blank\">iniciar sesión en su cuenta de Amazon una vez</a> para activar la conexión del adaptador a sus dispositivos Alexa.",
    "Settings": "Configuraciones",
    "StatusInfo": "Las cookies de Alexa están actualizadas y actualizadas por última vez en %s ",
    "acceptLanguage": "Encabezado personalizado de idioma de aceptación",
    "alexaLogin": "Datos de acceso de Alexa",
    "alexaServiceHost": "URL base de Alexa",
    "auth": "Detalles de inicio de sesión para Amazon Cuenta donde están registrados los dispositivos Echo",
    "auth_info": "Las credenciales se almacenarán encriptadas en su instancia local de ioBroker. También puede dejarlos vacíos, pero luego debe buscar la cookie de Amazon por su cuenta o usar el proxy del adaptador para iniciar sesión y obtener la cookie.",
    "bespoken": "Dispositivo virtual Bespoken",
    "bespokenToken": "Bespoken Validation Token",
    "bespoken_info": "Los dispositivos virtuales Bespoken se pueden utilizar para enviar comandos de texto a su cuenta de Amazon y le dan un control limitado sobre sus dispositivos, cuando sea posible utilizando palabras habladas. <br/> <br/> Usted necesita crear una cuenta de Bespoken y luego un dispositivo virtual para obtener un token Bespoken como se describe en https://read.Bespoken.io/end-to-end/setup/. A continuación, ingrese el token a continuación y verá nuevos objetos para el adaptador. <br/> <br/> Tenga en cuenta: Bespoken crea un archivo de audio de su texto y lo envía a las API de Alexa. Entonces, la calidad de comprensión de Alexa es tan buena como esta generación de habla, por lo que puede ser problemático con palabras especiales.",
    "cookie": "Cookie",
    "cookieAlt": "Entrada manual de la cookie",
    "cookieAlt_info": "La cookie también se puede ingresar directamente. El correo electrónico y la contraseña no son necesarios",
    "cookieAlt_info2": "Ver p. <a href=\"https://www.gehrig.info/alexa/Alexa.html\" target=\"_blank\"> aquí </a> cómo obtener una cookie manualmente o probar el modo proxy del adaptador. Consulte el mensaje de error en el registro para la URL del proxy",
    "cookieLoginUrl": "Cookie personalizada-Amazon-URL",
    "history": "Configuración del historial",
    "historyIgnoreEmptySummary": "Ignorar entradas de historial donde no se reconoció ningún comando",
    "history_info": "Configuración de los datos del historial que están disponibles en los estados \"History\"",
    "interval": "Intervalos de actualización de datos",
    "interval_info": "Varios datos se pueden actualizar automáticamente. Usted define aquí en segundos con qué frecuencia esto debería suceder. Con el disparador de historial de estado. #, Siempre puede actualizar los datos manualmente. Si configura 0 como intervalo, la actualización automática está deshabilitada.",
    "overwrite": "Anula el parámetro especial para la determinación y comunicación de cookies",
    "overwrite_info": "Por defecto, los parámetros están configurados para conectarse con una cuenta amazon alemana. Si está utilizando otros países amazónicos, debe establecer los datos correctos aquí. Verifique en el adaptador README para algunos detalles. También en algunos casos, la determinación automática de cookies está fallando, puede ayudar a jugar aquí especialmente con Accept-Language y User-Agent.",
    "password": "contraseña",
    "proxy": "Configuración de proxy",
    "proxyListenBind": "Enlazado Proxy a cierta IP",
    "proxyOverrideIp": "Contenedor externo-IP (Docker)",
    "proxyOwnIp": "IP propia o nombre de host para usar en el enlace proxy",
    "proxyPort": "Puerto proxy",
    "proxyPort_info": "(0 = puerto aleatorio)",
    "proxy_info": "Si la determinación automática de una cookie no puede, el adaptador abre un proxy para permitir un inicio de sesión manual en Amazon. El archivo de registro le dirá la URL que debe usar. Abra esto en su navegador, inicie sesión manualmente en Amazon, resuelva todas las posibles Captchas o Autenticaciones de dos factores y la cookie queda atrapada en segundo plano automáticamente si tiene éxito.",
    "push_connection": "Push-Connection",
    "push_connection_info": "Con la conexión de inserción directa, los cambios de los dispositivos Echo se notifican al adaptador y se utilizan para actualizar solo los datos necesarios casi en tiempo real. Si está habilitado, los intervalos de actualización de datos a continuación no se utilizan.",
    "resetCookie": "Restablecer las cookies de Amazon",
    "s (0 = disabled)": "s (0 = deshabilitado)",
    "updateHistoryInterval": "Intervalo de actualización de historial",
    "updateStateInterval": "Intervalo de actualización de datos (Player-Info ...)",
    "usePushConnection": "Use la conexión push",
    "userAgent": "User-Agent personalizado"
}
