{
  "common": {
    "name": "alexa2",
    "version": "3.19.6",
    "blockedVersions": [
      "~3.14.0",
      "~3.15.0",
      "~3.16.0",
      "3.17.0",
      "3.17.1",
      "3.17.2",
      "3.17.3"
    ],
    "title": "Alexa2 (Amazon Echo)",
    "titleLang": {
      "en": "Alexa2 (Amazon Echo)",
      "de": "Alexa2 (Amazon Echo)",
      "ru": "Alexa2 (Amazon Echo)",
      "pt": "Alexa2 (Amazon Echo)",
      "nl": "Alexa2 (Amazon Echo)",
      "fr": "Alexa2 (Amazon Echo)",
      "it": "Alexa2 (Amazon Echo)",
      "es": "Alexa2 (eco de Amazon)",
      "pl": "Alexa2 (Amazon Echo)",
      "zh-cn": "Alexa2（Amazon回声）"
    },
    "desc": {
      "en": "Remote control for Alexa (Amazon Echo)",
      "de": "Steuerung von Alexa (Amazon Echo)",
      "ru": "Управление Alexa (Amazon Echo)",
      "pt": "Controle remoto para Alexa (Amazon Echo)",
      "nl": "Afstandsbediening voor Alexa (Amazon Echo)",
      "fr": "Télécommande pour Alexa (Amazon Echo)",
      "it": "Telecomando per Alexa (Amazon Echo)",
      "es": "Control remoto para Alexa (Amazon Echo)",
      "pl": "Pilot do Alexa (Amazon Echo)",
      "zh-cn": "Alexa（Amazon Echo）的遥控器"
    },
    "platform": "Javascript/Node.js",
    "news": {
      "3.19.6": {
        "en": "Fix doNotDisturb when using a time string",
        "de": "Fehler NichtDisturb bei Verwendung eines Zeitstrings",
        "ru": "Fix сделать NotDisturb при использовании строки времени",
        "pt": "Fixo do NotDisturb ao usar uma string de tempo",
        "nl": "_ Niet elke dag als je een tijdstip gebruikt",
        "fr": "Fixe do NotDisturb lors de l'utilisation d'une chaîne temporelle",
        "it": "Riparare NotDisturb quando si utilizza una stringa di tempo",
        "es": "Corrección do No molestar al usar una cadena de tiempo",
        "pl": "Fixa do Fixa NotDisturb kiedy używa czasu smyczki",
        "zh-cn": "Fix do 在使用时间包时,不设歧见"
      },
      "3.19.5": {
        "en": "Fix doNotDisturb for groups",
        "de": "Fehler doNotDisturb für Gruppen",
        "ru": "Fix сделать doNotDisturb для групп",
        "pt": "Fixo doNotDisturb para grupos",
        "nl": "_ doNotDisturb voor groepen",
        "fr": "Fixe doNotDisturb pour les groupes",
        "it": "Riparare Consigli per gruppi",
        "es": "Corrección do doNotDisturb",
        "pl": "Fixa do Fixa doNotDisturb for groups (ang.)",
        "zh-cn": "Fix do D. 对团体不予赔偿"
      },
      "3.19.4": {
        "en": "Prevent unwanted device Name updates",
        "de": "Unerwünschtes Gerät verhindern Name Updates",
        "ru": "Предотвращение нежелательного устройства Обновление имени",
        "pt": "Impedir dispositivo indesejado Atualizações de nome",
        "nl": "Vertaling: Naam updates",
        "fr": "Prévenir un dispositif indésirable Mises à jour des noms",
        "it": "Prevenire dispositivo indesiderato Aggiornamenti del nome",
        "es": "Evitar el dispositivo no deseado Actualizaciones de nombres",
        "pl": "Przygotowanie niepożądane aktualizacja",
        "zh-cn": "预防意外装置 姓名最新情况"
      },
      "3.19.3": {
        "en": "Fix crash check with multiple adapter instances",
        "de": "Crash-Check mit mehreren Adapterinstanzen beheben",
        "ru": "Исправление проверки аварий с несколькими примерами адаптера",
        "pt": "Corrigir verificação de falhas com várias instâncias do adaptador",
        "nl": "Vertaling:",
        "fr": "Contrôle de crash fixe avec plusieurs instances adaptatives",
        "it": "Fissare il controllo crash con più istanze dell'adattatore",
        "es": "Control de fallo fijo con múltiples instancias de adaptador",
        "pl": "Fix sprawdza się z wieloma aplikacjami",
        "zh-cn": "Fix 事故检查"
      },
      "3.19.2": {
        "en": "Fix Alarm creation when just providing time and it is for next day",
        "de": "Alarm-Erstellung, wenn nur Zeit zur Verfügung gestellt und es ist für den nächsten Tag",
        "ru": "Исправьте создание тревоги когда как раз обеспечивая время и оно на следующий день",
        "pt": "Corrigir a criação de alarme ao fornecer tempo e é para o dia seguinte",
        "nl": "Vertaling:",
        "fr": "Réparer la création d'alarme quand il suffit de fournir du temps et c'est pour le lendemain",
        "it": "Fissare la creazione di allarme quando solo fornire il tempo ed è per il giorno successivo",
        "es": "Fijar la creación de Alarma cuando sólo proporciona tiempo y es para el día siguiente",
        "pl": "Fix Alarm - tworzenie, kiedy tylko daje czas i jest przez następne dni",
        "zh-cn": "在提供时间时,创设ix Alarm"
      },
      "3.19.1": {
        "en": "Fix retry handling",
        "de": "Retry Handling",
        "ru": "Fix ретриминг",
        "pt": "Manuseamento de retrete",
        "nl": "Vertaling:",
        "fr": "Manipulation par réarmement",
        "it": "Risolvere la gestione del processo",
        "es": "Manejo de repostaje fijo",
        "pl": "Fix retry",
        "zh-cn": "九. 固定的重新处理"
      },
      "3.19.0": {
        "en": "Preserve Names as soon as it is an App type in general\nEnhance checks and safeguards for polling intervals\nCheck for restart intervals that do not make sense and stop adapter if detected\nAdd additional crash-loop detection",
        "de": "Reservieren Sie Namen, sobald es ein App-Typ im Allgemeinen ist\nVerbessern Sie die Überprüfungen und Sicherheitsvorkehrungen für Abfragen\nPrüfen Sie für Neustart-Intervalle, die keinen Sinn und Stopp-Adapter ergeben, wenn erkannt\nZusätzliche Crash-Loop-Erkennung hinzufügen",
        "ru": "Сохранить имена, как только это тип приложения в целом\nУлучшение проверок и гарантий для интервалов опроса\nПроверьте перезагрузочные интервалы, которые не имеют смысла и остановки адаптера, если обнаружено\nДобавьте дополнительное обнаружение сбоев",
        "pt": "Preserve nomes assim que é um tipo de App em geral\nMelhorar verificações e salvaguardas para intervalos de votação\nVerifique para intervalos de reinício que não fazem sentido e pare o adaptador se detectado\nAdicionar detecção adicional de falhas",
        "nl": "Bewaar Names zodra het een App-type is in het algemeen\nEnhance checks en bewakers voor het vervullen van interval\nControleer op herstelmiddelen die niet logisch zijn en stoppen met adapter als ze ontdekt worden\nVoeg extra crash-loop detectie toe",
        "fr": "Préserver Noms dès qu'il s'agit d'un type App en général\nAméliorer les contrôles et les garanties pour les intervalles de vote\nVérifiez les intervalles de redémarrage qui n'ont pas de sens et de stop adaptateur si détecté\nAjout d'une détection de fuite supplémentaire",
        "it": "Preservare i nomi non appena si tratta di un tipo di App in generale\nMigliorare i controlli e le garanzie per gli intervalli di inquinamento\nControllare gli intervalli di riavvio che non hanno senso e interrompere l'adattatore se rilevato\nAggiungi ulteriore rilevamento crash-loop",
        "es": "Preserve Nombres tan pronto como sea un tipo de aplicación en general\nMejorar los controles y las salvaguardias para los intervalos de votación\nCompruebe los intervalos de reinicio que no tienen sentido y detenga el adaptador si se detecta\nAñadir detección adicional de fallos",
        "pl": "Nazwy preserve są tak szybko, jak to jest typ App\nEnhance sprawdza i schronienie dla odstępów zanieczyszczeń\nCheck dla przesunięcia odstępów, które nie mają sensu i stopa adapter, jeśli wykrywa się wykrywcy\nDodać dodatkową detekcję pętli",
        "zh-cn": "一. 保留国一俟是普遍适用的名称。\n加强对投票的检查和保障\n如果发现有过失感和停止适应的间隔时间,检查时间不长。\n增加事故侦测"
      }
    },
    "keywords": [
      "alexa",
      "amazon",
      "amazon echo",
      "echo dot",
      "echo show"
    ],
    "authors": [
      "Apollon77 <iobroker@fischer-ka.de>"
    ],
    "mode": "daemon",
    "icon": "alexa.png",
    "materialize": true,
    "extIcon": "https://raw.githubusercontent.com/Apollon77/ioBroker.alexa2/master/admin/alexa.png",
    "readme": "https://github.com/Apollon77/ioBroker.alexa2/blob/master/README.md",
    "loglevel": "info",
    "type": "iot-systems",
    "enabled": true,
    "messagebox": true,
    "license": "MIT",
    "localLink": "https://alexa.amazon.com",
    "connectionType": "cloud",
    "dataSource": "push",
    "tier": 2,
    "compact": true,
    "dependencies": [
      {
        "js-controller": ">=2.0.0"
      }
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://e9ac55f23fe149e78b1eab9ed4bf26ad@sentry.iobroker.net/8",
        "pathWhitelist": [
          "@apollon",
          "alexa-cookie2",
          "alexa-remote2"
        ],
        "errorBlacklist": [
          "SyntaxError"
        ]
      }
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.13.0",
            "newVersion>=3.13.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!"
        },
        "text": {
          "en": "The new version 1.2.x will potentially change the Names of List Objects when special characters (including \".\") are used! Please delete the old objects manually if needed.",
          "de": "Die neue Version 1.2.x wird die Namen der Listenobjekte möglicherweise ändern, wenn Sonderzeichen (einschließlich \".\") verwendet werden! Bitte löschen Sie die alten Objekte bei Bedarf manuell.",
          "ru": "Новая версия 1.2.x потенциально изменит имена объектов списка, когда используются специальные символы (включая \".\")! Пожалуйста, удалите старые объекты вручную, если это необходимо.",
          "pt": "A nova versão 1.2.x irá potencialmente alterar os nomes dos objetos de lista quando caracteres especiais (incluindo \".\") são usados! Por favor, exclua os objetos antigos manualmente, se necessário.",
          "nl": "De nieuwe versie 1.2.x zal mogelijk de Namen van List Objects veranderen als speciale personages (includeren) worden gebruikt. Verwijder de oude objecten handmatig als het nodig is.",
          "fr": "La nouvelle version 1.2.x modifiera potentiellement les Noms des objets de la liste lorsque des caractères spéciaux (y compris \"). Veuillez supprimer les anciens objets manuellement si nécessaire.",
          "it": "La nuova versione 1.2.x cambierà potenzialmente i nomi degli oggetti di elenco quando vengono utilizzati caratteri speciali (inclusi \".\")! Si prega di eliminare i vecchi oggetti manualmente se necessario.",
          "es": "La nueva versión 1.2.x potencialmente cambiará los Nombres de Objetos de Lista cuando se utilizan caracteres especiales (incluyendo \"). Por favor, borre los viejos objetos manualmente si es necesario.",
          "pl": "Nowa wersja 1.2.x będzie potencjalnie zmieniać nazwę nazw obiektów listowych, kiedy używa się specjalnych postaci (w tym „.”). Okazuje się, że stare obiekty ręcznie będą potrzebne.",
          "zh-cn": "新版本1.2.x将有可能改变名单所列物品的名称(包括“......”)。 请在必要时删除旧物体。."
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      },
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.15.0",
            "newVersion>=3.15.0"
          ]
        },
        "title": {
          "en": "Format to create Reminder/Alarms changed!",
          "de": "Format zum Erstellen von Reminder/Alarms geändert!",
          "ru": "Формат для создания Reminder/Alarms изменился!",
          "pt": "Formato para criar lembrete / alarmes alterado!",
          "nl": "Format om Reminder/Alarms te creëren!",
          "fr": "Format pour créer Reminder/Alarms changé!",
          "it": "Formato per creare Reminder/Allarma cambiate!",
          "es": "Formato para crear Reminder/Alarms cambiado!",
          "pl": "W celu stworzenia zmian Reminder/Alarms!",
          "zh-cn": "创建Reminder/Alarms的格局改变了!"
        },
        "text": {
          "en": "The format used in the \"New\" states for Alarms or Reminders has changed and allows now to provide more Details. Please see the Readme for the details!",
          "de": "Das Format, das in den neuen Zuständen für Alarme oder Reminders verwendet wird, hat sich geändert und ermöglicht nun mehr Details. Die Readme enthält alle Details!",
          "ru": "Изменен формат, используемый в новых состояниях для тревоги или напоминаний и позволяет теперь предоставить более подробную информацию. Пожалуйста, посмотрите Readme для деталей!",
          "pt": "O formato usado nos Novos estados para Alarmes ou Lembretes mudou e agora permite fornecer mais detalhes. Por favor, veja o Readme para os detalhes!",
          "nl": "De formaat gebruikt in de Nieuwe staten voor Alarms of Reminders is veranderd en staat nu toe om meer Details te leveren. Zie de Readme voor de details!",
          "fr": "Le format utilisé dans les nouveaux états pour les armes ou les rappels a changé et permet maintenant de fournir plus de détails. Veuillez voir le Readme pour les détails!",
          "it": "Il formato utilizzato nei nuovi stati per gli allarmi o i ripetitori è cambiato e consente ora di fornire ulteriori dettagli. Si prega di vedere il Readme per i dettagli!",
          "es": "El formato utilizado en los Nuevos estados para Alarmas o Recordatorios ha cambiado y permite ahora proporcionar más detalles. Por favor, vea el Readme para los detalles!",
          "pl": "Format używany w nowych stanach dla Alarmsa lub Remindersa został zmieniony i pozwala obecnie na dostarczenie większej liczby dekatów. Wyglądaj na szczegóły!",
          "zh-cn": "新州用于申报或递解剂的格式已经改变,现在可以提供更多的细节。 请见详细!"
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ],
        "link": "https://github.com/Apollon77/ioBroker.alexa2#alexa20echo-devicesserialnumberalarm",
        "linkText": {
          "en": "Readme",
          "de": "Reader",
          "ru": "Читать",
          "pt": "Readme",
          "nl": "Lees",
          "fr": "Readme",
          "it": "Readme",
          "es": "Readme",
          "pl": "Ready",
          "zh-cn": "阅读摘要"
        }
      },
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.18.0",
            "newVersion>=3.18.0"
          ]
        },
        "title": {
          "en": "Changes in Smart Home device syncing",
          "de": "Änderungen der Smart Home Gerätesynchronisation",
          "ru": "Изменения в синхронизации устройства Smart Home",
          "pt": "Alterações na sincronização de dispositivos Smart Home",
          "nl": "Veranderingen in Smart Home apparaat",
          "fr": "Changements dans la synchronisation de l'appareil Smart Home",
          "it": "Modifiche nella sincronizzazione dei dispositivi Smart Home",
          "es": "Cambios en la sincronización de dispositivos Smart Home",
          "pl": "Zmiany w Smart Home urządzenie synchronizujące",
          "zh-cn": "Smart家装置的合并变化"
        },
        "text": {
          "en": "Starting with version 3.18.0 smart home device values are no longer synced by default. You need to enable the new state #includeInIntervalQuery existing for each syncable device in the objects in order for the device to be synchronized. Please enable only those that you really need to reduce the requests to Amazon and the Skills and prevent blocking or issues.",
          "de": "Ab Version 3.18.0 werden Smart Home-Gerät-Werte nicht mehr standardmäßig synchronisiert. Der neuen Zustand #includeInInterQuery, der für jedes synchronisierbare Gerät in den Objekten vorhanden ist, muss aktiviert werden um das Gerät zu synchronisieren. Bitte nur diejenigen Geräte aktivieren, die wirklich benötigt werden, um die Anfragen an Amazon und die Skills zu reduzieren und Blockierung oder Probleme zu verhindern.",
          "ru": "Начиная с версии 3.18.0 интеллектуальные ценности домашнего устройства больше не синхронизированы по умолчанию. Вам необходимо включить новое состояние #includeInIntervalQuery существующее для каждого синхронного устройства в объектах, чтобы устройство было синхронизировано. Пожалуйста, включите только те, что вам действительно нужно уменьшить запросы на Amazon и навыки и предотвратить блокировку или проблемы.",
          "pt": "Começando com a versão 3.18.0 os valores de dispositivo doméstico inteligente não são mais sincronizados por padrão. Você precisa ativar o novo estado #includeInIntervalQuery existente para cada dispositivo sincronizável nos objetos para que o dispositivo seja sincronizado. Por favor, ative apenas aqueles que você realmente precisa para reduzir os pedidos para Amazon e as habilidades e evitar bloqueio ou problemas.",
          "nl": "Beginnend met versie 3.18.0 slimme thuis apparatuur is niet meer gesynchroniseerd door defect. Je moet de nieuwe staat in staat stellen includeïntervalQuery die bestaat voor elk syncable apparaat in de objecten om het apparaat te synchroniseren. Betrek alleen degenen die je echt nodig hebt om de verzoeken naar Amazone en de Skills te verminderen en blokkeren of problemen te voorkomen.",
          "fr": "À partir de la version 3.18.0, les valeurs de périphérique à domicile intelligent ne sont plus synchronisées par défaut. Vous devez activer le nouvel état #includeInIntervalQuery existant pour chaque périphérique synchronisé dans les objets afin que le dispositif soit synchronisé. S'il vous plaît activer seulement ceux que vous avez vraiment besoin de réduire les demandes à Amazon et les Compétences et prévenir le blocage ou les problèmes.",
          "it": "A partire dalla versione 3.18.0 i valori dei dispositivi smart home non sono più sincronizzati per impostazione predefinita. È necessario abilitare il nuovo stato #includeInIntervalQuery esistente per ogni dispositivo sincronizzabile negli oggetti in modo che il dispositivo sia sincronizzato. Si prega di attivare solo quelli che è davvero necessario ridurre le richieste a Amazon e le competenze e prevenire il blocco o problemi.",
          "es": "Empezando con la versión 3.18.0, los valores de dispositivo hogar inteligente ya no se sincronizan por defecto. Necesita habilitar el nuevo estado #includeInIntervalQuery existente para cada dispositivo sincronizable en los objetos con el fin de sincronizar el dispositivo. Por favor, active sólo aquellos que realmente necesita para reducir las solicitudes a Amazon y las Habilidades y evitar el bloqueo o problemas.",
          "pl": "Począwszy od wersji 3.18.0, inteligentne urządzenia domowe nie są już zsynchronizowane. Musisz umożliwić nowy stan #include InIntervalQuery istniejące dla każdego urządzenia synchronizującego się w obiektach. Pozwólcie to tylko tym, że musisz zredukować żądania do Amazona i Umiejętności i zapobiegać blokowaniu lub problemom.",
          "zh-cn": "从第3.18.0版的家里装置价值开始,不再因违约而形成。 你们需要使新的国家能够为各物体的每个可核对装置建立新的国家行动目标。 仅请你真正需要减少对亚马逊和技能的要求,并防止阻断或问题。."
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ],
        "link": "https://github.com/Apollon77/ioBroker.alexa2#alexa20echo-devicesserialnumberalarm",
        "linkText": {
          "en": "Readme",
          "de": "Reader",
          "ru": "Читать",
          "pt": "Readme",
          "nl": "Lees",
          "fr": "Readme",
          "it": "Readme",
          "es": "Readme",
          "pl": "Ready",
          "zh-cn": "阅读摘要"
        }
      }
    ]
  },
  "native": {
    "cookie": "",
    "csrf": "",
    "cookieData": null,
    "alexaServiceHost": "",
    "email": "",
    "password": "",
    "userAgent": "",
    "acceptLanguage": "",
    "cookieLoginUrl": "",
    "proxyOwnIp": "",
    "proxyPort": 0,
    "proxyListenBind": "",
    "updateConfigurationInterval": 3600,
    "updateStateInterval": 300,
    "updateHistoryInterval": 300,
    "updateSmartHomeDevicesInterval": 0,
    "usePushConnection": true,
    "proxyOverrideIp": "",
    "resetCookies": false,
    "historyIgnoreEmptySummary": false,
    "macDms": null,
    "includeAppDevices": false,
    "synchronizeLists": true,
    "synchronizeSmartHomeDevices": true
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "If communication with alexa works",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    },
    {
      "_id": "info.cookie",
      "type": "state",
      "common": {
        "role": "text",
        "name": "Alexa Cookie",
        "type": "string",
        "read": true,
        "write": false,
        "def": ""
      },
      "native": {}
    },
    {
      "_id": "info.csrf",
      "type": "state",
      "common": {
        "role": "text",
        "name": "Alexa CSRF",
        "type": "string",
        "read": true,
        "write": false,
        "def": ""
      },
      "native": {}
    }
  ]
}
