{
  "common": {
    "name": "alexa2",
    "version": "3.25.2",
    "blockedVersions": [
      "~3.14.0",
      "~3.15.0",
      "~3.16.0",
      "3.17.0",
      "3.17.1",
      "3.17.2",
      "3.17.3"
    ],
    "title": "Alexa2 (Amazon Echo)",
    "titleLang": {
      "en": "Alexa2 (Amazon Echo)",
      "de": "Alexa2 (Amazon Echo)",
      "ru": "Alexa2 (Amazon Echo)",
      "pt": "Alexa2 (Amazon Echo)",
      "nl": "Alexa2 (Amazon Echo)",
      "fr": "Alexa2 (Amazon Echo)",
      "it": "Alexa2 (Amazon Echo)",
      "es": "Alexa2 (eco de Amazon)",
      "pl": "Alexa2 (Amazon Echo)",
      "zh-cn": "Alexa2（Amazon回声）"
    },
    "desc": {
      "en": "Remote control for Alexa (Amazon Echo)",
      "de": "Steuerung von Alexa (Amazon Echo)",
      "ru": "Управление Alexa (Amazon Echo)",
      "pt": "Controle remoto para Alexa (Amazon Echo)",
      "nl": "Afstandsbediening voor Alexa (Amazon Echo)",
      "fr": "Télécommande pour Alexa (Amazon Echo)",
      "it": "Telecomando per Alexa (Amazon Echo)",
      "es": "Control remoto para Alexa (Amazon Echo)",
      "pl": "Pilot do Alexa (Amazon Echo)",
      "zh-cn": "Alexa（Amazon Echo）的遥控器"
    },
    "platform": "Javascript/Node.js",
    "news": {
      "3.25.2": {
        "en": "Optimize reconnection handling for push connections",
        "de": "Optimieren Sie die Umschaltung von Push-Verbindungen",
        "ru": "Оптимизируйте переподключение обработки для push соединений",
        "pt": "Otimizar o manuseio de reconexão para conexões push",
        "nl": "Optimiliseer verbinding met de pers",
        "fr": "Optimiser la manipulation de reconnection pour les connexions push",
        "it": "Ottimizzare la gestione della riconnessione per le connessioni push",
        "es": "Optimize reconnection handling for push connections",
        "pl": "Optimize reconnection",
        "uk": "Оптимальна обробка відключення для підключення штовхачів",
        "zh-cn": "利用重新连接的渠道推动联系"
      },
      "3.25.1": {
        "en": "IMPORTANT: Minimum required Node-js version is 16 now!\nUpdated the Push connection after Amazon technology changes\nAdded some more device types",
        "de": "WICHTIG: Mindestanforderungen Node-js-Version ist jetzt 16!\nAktualisiert die Push-Verbindung nach Amazon-Technologie Änderungen\nEinige weitere Gerätetypen hinzugefügt",
        "ru": "ВАЖНО: Минимальная необходимая версия Node-js теперь 16!\nОбновлено соединение Push после изменения технологии Amazon\nДобавлены еще некоторые типы устройств",
        "pt": "IMPORTANTE: A versão mínima necessária do Node-js é 16 agora!\nAtualizou a conexão Push depois que a tecnologia Amazon muda\nAdicionado alguns mais tipos de dispositivo",
        "nl": "Minimum vereist dat Node-Js versie 16 is!\nVerhoogde de Push connectie nadat Amazon technologie veranderde\nVoeg nog wat apparaten toe",
        "fr": "IMPORTANT: La version minimum requise Node-js est 16 maintenant!\nMise à jour de la connexion Push après les changements de technologie Amazon\nAjout d'autres types de périphériques",
        "it": "IMPORTANTE: La versione minima Node-js richiesta è 16 ora!\nAggiornato il collegamento Push dopo le modifiche della tecnologia Amazon\nAggiunto alcuni più tipi di dispositivo",
        "es": "IMPORTANTE: La versión mínima requerida Node-js es 16 ahora!\nActualización de la conexión Push después de los cambios de la tecnología Amazon\nAñadido algunos tipos de dispositivo más",
        "pl": "IMPORTANT: Minimum wymagało od wersji Node-js 16 now!\nUlepszenie połączenia Push po zmianie technologii Amazon zmienia się\nUdostępnić więcej typów urządzeń",
        "uk": "ВАЖЛИВО: Мінімальна необхідна версія Node-js 16 тепер!\nОновлено підключення Push після зміни технології Amazon\nДодайте більше типів пристроїв",
        "zh-cn": "IMPORTANT:最低要求的提名现在是16!\nA. 亚马逊技术变化之后的管道更新\n增加一些更类型的装置"
      },
      "3.24.1": {
        "en": "Work around Amazon changes that affected all functions over the Push connection\nSome smaller fixes and adjustments",
        "de": "Arbeiten um Amazon Änderungen, die alle Funktionen über die Push-Verbindung beeinflusst\nEinige kleinere Fixierungen und Anpassungen",
        "ru": "Работа вокруг Amazon меняется, что повлияло на все функции по подключению Push\nНекоторые мелкие исправления и настройки",
        "pt": "Trabalhe em torno de mudanças da Amazon que afetaram todas as funções sobre a conexão Push\nAlgumas correções e ajustes menores",
        "nl": "Werk rond Amazon verandert alle functies over de Push connectie\nWat kleinere fixes en aanpassingen",
        "fr": "Travail autour de Amazon changements qui ont affecté toutes les fonctions sur la connexion Push\nQuelques corrections et ajustements plus petits",
        "it": "Lavorare intorno Amazon modifiche che hanno interessato tutte le funzioni sopra il collegamento Push\nAlcuni piccoli correzioni e regolazioni",
        "es": "Trabajar alrededor de Amazon cambios que afectaron todas las funciones sobre la conexión Push\nAlgunas correcciones y ajustes más pequeños",
        "pl": "Prace nad zmianami Amazona, które wpływały na wszystkie funkcje w związku Push\nNiektóre mniejsze rozwiązania i przystosowania",
        "uk": "Робота по змінах Amazon, які впливають на всі функції над підключенням Push\nДеякі менші виправлення та налаштування",
        "zh-cn": "三. 亚马逊的改变影响到普沙伊特的所有职能\n有些较小的配量和调整"
      },
      "3.23.2": {
        "en": "Prioritize real devices higher than app devices when serialnumbers overlap",
        "de": "Priorisieren Sie reale Geräte höher als App-Geräte, wenn sich Seriennummern überlappen",
        "ru": "Приоритетные реальные устройства выше, чем устройства приложений, когда перекрываются серийные номера",
        "pt": "Priorize dispositivos reais superiores aos dispositivos de aplicativos quando os números de série se sobrepõem",
        "nl": "Vertaling:",
        "fr": "Prioriser les dispositifs réels plus élevés que les appareils d'application lorsque les nombres de série se chevauchent",
        "it": "Priorizzare dispositivi reali superiori ai dispositivi app quando i numeri di serie si sovrappongono",
        "es": "Priorizar dispositivos reales superiores a los dispositivos de aplicación cuando superpone números de serie",
        "pl": "Priorytetyzacja rzeczywistych urządzeń wyższa niż urządzenia aplikacji, gdy liczba odcinków się pokrywa",
        "uk": "Передбачити реальні пристрої вище пристроїв додатків при перекриттях серійних чисел",
        "zh-cn": "当序号重叠时,实际装置的优先顺序高于装置"
      },
      "3.23.1": {
        "en": "Enhance checks when changing smart device values\nTry to prevent Amazon rate limiting (again)",
        "de": "Verbessern Sie die Kontrollen beim Ändern von Smart Device-Werten\nVersuchen Sie, Amazon-Rate zu verhindern (wieder)",
        "ru": "Повысить проверки при изменении интеллектуальных значений устройства\nПопробуйте предотвратить ограничение курса Amazon (в зависимости от)",
        "pt": "Aprimore verificações ao alterar valores de dispositivo inteligente\nTente evitar a limitação da taxa do Amazonas (novamente)",
        "nl": "Enhance controleert wanneer het veranderen van slimme apparatuur waarden\nProbeer te voorkomen dat Amazone beperkt blijft",
        "fr": "Améliorez les contrôles lorsque vous modifiez les valeurs de périphérique intelligent\nEssayez d'empêcher la limitation des taux d'Amazonie (encore)",
        "it": "Migliorare i controlli quando si cambiano i valori dei dispositivi intelligenti\nCerca di evitare il limite di tasso Amazon (di nuovo)",
        "es": "Mejorar los controles al cambiar los valores de dispositivo inteligente\nTrate de evitar que la tasa de Amazon limite (de nuevo)",
        "pl": "Enhance sprawdza się, gdy zmienia się wartości urządzenie\nZapobiega ona limitacji wskaźników (against)",
        "uk": "Підвищення перевірок при зміні значень інтелектуального пристрою\nСпробуйте запобігти обмеження швидкості Amazon",
        "zh-cn": "在改变智能器价值时加强检查\n防止亚马逊限制(again)"
      },
      "3.21.0": {
        "en": "IMPORTANT: Because of rate limits by Amazon I decided to remove the update of smart home device values in intervals because it seems to produce too much load in Skills and Amazon systems.\nOptimizes loading of smart home device states\nFixed issue with enabling/disabling of Alarms in combination with non-default music for the alarm\nPrevented that Timers or Alarms that are long in the future to trigger their trigger state too early\nFixed deleting own user Messages state\nAlready request Notification updates when history registered a Notification action and do not wait for Push info to come in",
        "de": "WICHTIG: Aufgrund der Geschwindigkeitslimits von Amazon entschied ich mich, das Update von Smart Home-Gerät-Werten in Intervallen zu entfernen, weil es zu viel Belastung in Skills und Amazon-Systemen scheint.\nOptimiert das Laden von Smart Home-Gerätezuständen\nProblem behoben mit dem Aktivieren/Deaktivieren von Alarmen in Kombination mit nicht-Standard-Musik für den Alarm\nVerhindert, dass Timer oder Alarme, die in der Zukunft lange sind, um ihren Auslösezustand zu früh auszulösen\nBehoben Löschen eigener Benutzer Nachrichten Zustand\nBereits Anfrage Benachrichtigungsaktualisierungen, wenn die Geschichte eine Benachrichtigungsaktion registriert und nicht warten, bis Push-Info kommen",
        "ru": "ВАЖНО: Из-за пределов тарифа Amazon я решил удалить обновление интеллектуальных домашних устройств в интервалах, потому что кажется, производить слишком много нагрузки в Skills и Amazon систем.\nОптимизирует загрузку состояния умного дома\nИсправлена проблема с предоставлением/отключением тревоги в сочетании с неповрежденной музыкой для тревоги\nПредотвращается, что Таймеры или тревоги, которые долго в будущем, чтобы триггер их состояние слишком рано\nИсправлено удаление собственного пользователя Messages state\nУже запрос Уведомление об обновлениях, когда история зарегистрировала действие Уведомления и не дождаться Push info, чтобы прийти в",
        "pt": "IMPORTANTE: Por causa dos limites de taxa da Amazon eu decidi remover a atualização de valores de dispositivo doméstico inteligente em intervalos porque parece produzir muita carga em Habilidades e sistemas da Amazon.\nOtimiza o carregamento de estados inteligentes de dispositivos domésticos\nProblema fixo com habilitação/desativação de alarmes em combinação com música não padrão para o alarme\nPrevinei que Timers ou Alarmes que são longos no futuro para desencadear seu estado de gatilho muito cedo\nCorrigido a exclusão do próprio estado de Mensagens de usuário\nJá solicite atualizações de notificação quando o histórico registrou uma ação de notificação e não espere que o Push info entre",
        "nl": "Vanwege de snelheidsgrenzen van Amazon besloot ik de update te verwijderen van de smart home apparatuurwaarden in intervals omdat het te veel lading lijkt te veroorzaken in Skills en Amazone systemen.\nOptimizes lading van slim thuis apparaat staat\nGereserveerd met het verslechteren van Alarms in combinatie met niet-fault muziek voor het alarm\nBedenk dat Timers of Alarms lang in de toekomst zijn om hun ontstekingstoestand te vroeg te activeren\nVerwijdering van eigen gebruikers\nIk heb al een verzoek ingediend toen de geschiedenis een aanmeldingsactie registreerde en niet wachten tot de info van de pers binnenkomt",
        "fr": "IMPORTANT: En raison des limites tarifaires d'Amazon, j'ai décidé de supprimer la mise à jour des valeurs de périphérique à domicile intelligent dans les intervalles parce qu'il semble produire trop de charge dans les systèmes Skills et Amazon.\nOptimise le chargement des états d'appareil à domicile intelligent\nProblème fixe avec habilitation/désactivation des alarmes en combinaison avec la musique non par défaut pour l'alarme\nEmpêché que Timers ou Alarms qui sont longs à l'avenir pour déclencher leur état de déclenchement trop tôt\nFixed deleting own user Messages state\nDemandez déjà des mises à jour de notification lorsque l'histoire a enregistré une action de notification et n'attendez pas les informations Push à venir dans",
        "it": "IMPORTANTE: A causa dei limiti di tasso da Amazon ho deciso di rimuovere l'aggiornamento dei valori dei dispositivi smart home in intervalli perché sembra produrre troppo carico in competenze e sistemi Amazon.\nOttimizza il caricamento degli stati smart home device\nRisolto problema con l'abilitazione / disabilitazione di Allarmi in combinazione con musica non predefinita per l'allarme\nPrevenire che Timer o Allarmi che sono a lungo in futuro per innescare il loro stato di trigger troppo presto\nEliminato cancellazione del proprio utente\nGià richiesta Aggiornamenti di notifica quando la storia ha registrato un'azione di notifica e non aspettare per Push info per entrare",
        "es": "IMPORTANTE: Debido a los límites de tarifas por Amazon decidí eliminar la actualización de los valores de dispositivo hogareño inteligente en intervalos porque parece producir demasiada carga en los sistemas Skills y Amazon.\nOptimiza la carga de estados inteligentes de dispositivos caseros\nEdición fija con habilitación/disacción de Alarmas en combinación con música no predeterminada para la alarma\nPrevented that Timers or Alarms that are long in the future to trigger their trigger state too early\nEliminar el propio usuario Mensajes estado\nSolicita ya actualizaciones de notificaciones cuando la historia registró una acción de notificación y no espera que Push info entre",
        "pl": "IMPORTANT: Ze względu na ograniczenia prędkości przez Amazon I zdecydował się usunąć uaktualnione wartości urządzenie w odstępach, ponieważ wydaje się być zbyt dużo obciążenia w systemach Skills i Amazon.\nOptymizowanie obciążenia inteligentnymi jednostkami domowymi\nZawarty problem z możliwością uniknięcia Alarmsa w połączeniu z muzyką nieobronioną dla alarmu\nPrzypuszcza się, że Timerowie lub Alarmowie, którzy są długo w przyszłości w stanie wywołać swoje stany zbyt wcześnie\nFixed deletuje własny system Messages\nAlready wniosek Notification aktualizuje się, gdy historia zarejestrowała akcję Notyfikacji i nie czeka na wiadomość Push",
        "uk": "ВАЖЛИВО: Через обмеження швидкості на Amazon я вирішив видалити оновлення значень інтелектуального домашнього пристрою в інтервалах, оскільки це, здається, виготовляти занадто багато навантаження на навички та системи Amazon.\nОптимізуйте завантаження смарт-мереж\nВиправлено проблему, що дозволяє / відключення сигнальних сигналів у поєднанні з нерозголошенням музики для сигналізації\nЗапобігла, що Тимерси або сигнали, які довге в майбутньому, щоб запустити стангера занадто рано\nВиправлено видалення власного стану повідомлень\nУже запит про оновлення повідомлень, коли історія зареєструвала дію повідомлення та не чекайте на отримання інформації про Push",
        "zh-cn": "IMPORTANT:由于亚马逊集团的汇率限制,我决定每隔一次取消对聪明的家用具价值的更新,因为它似乎在技能和亚马逊系统中产生过多的载荷。.\n利用智能家用具的国家\nAlarms的固定问题与非燃烧音乐相结合,使人感到震惊。\n防止今后很长的推展时间或标志太早地触发国家\n九. 固定删除自己的用户信\n早就要求更新通知,因为历史登记了通知行动,不等到Pushfo上去。"
      },
      "3.20.1": {
        "en": "make sure caching works correctly with multiple instances of the adapter",
        "de": "Sicherstellen dass cache mit mehreren instanzen des adapters korrekt funktioniert",
        "ru": "убедитесь, что кэширование работает правильно с несколькими экземплярами адаптера",
        "pt": "certifique-se de que o cache funciona corretamente com várias instâncias do adaptador",
        "nl": "zorg ervoor dat kassa correct werkt met meerdere instanties van de adapter",
        "fr": "assurez-vous que le cache fonctionne correctement avec plusieurs instances de l'adaptateur",
        "it": "assicurarsi che il caching funzioni correttamente con più istanze dell'adattatore",
        "es": "asegúrese de que el caché funciona correctamente con múltiples instancias del adaptador",
        "pl": "umożliwia to prawidłowo prace przy użyciu wielu przykładów adaptera",
        "uk": "переконайтеся, що кешування працює правильно з декількома екземплярами адаптера",
        "zh-cn": "确保在适应者多重情况下进行正确工作"
      }
    },
    "keywords": [
      "alexa",
      "amazon",
      "amazon echo",
      "echo dot",
      "echo show"
    ],
    "authors": [
      "Apollon77 <iobroker@fischer-ka.de>"
    ],
    "mode": "daemon",
    "icon": "alexa.png",
    "materialize": true,
    "extIcon": "https://raw.githubusercontent.com/Apollon77/ioBroker.alexa2/master/admin/alexa.png",
    "readme": "https://github.com/Apollon77/ioBroker.alexa2/blob/master/README.md",
    "loglevel": "info",
    "type": "iot-systems",
    "enabled": true,
    "messagebox": true,
    "license": "MIT",
    "localLink": "https://alexa.amazon.com",
    "connectionType": "cloud",
    "dataSource": "push",
    "tier": 2,
    "compact": true,
    "dependencies": [
      {
        "js-controller": ">=2.0.0"
      }
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://e9ac55f23fe149e78b1eab9ed4bf26ad@sentry.iobroker.net/8",
        "pathWhitelist": [
          "@apollon",
          "alexa-cookie2",
          "alexa-remote2"
        ],
        "errorBlacklist": [
          "SyntaxError"
        ]
      }
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.13.0",
            "newVersion>=3.13.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!"
        },
        "text": {
          "en": "The new version 1.2.x will potentially change the Names of List Objects when special characters (including \".\") are used! Please delete the old objects manually if needed.",
          "de": "Die neue Version 1.2.x wird die Namen der Listenobjekte möglicherweise ändern, wenn Sonderzeichen (einschließlich \".\") verwendet werden! Bitte löschen Sie die alten Objekte bei Bedarf manuell.",
          "ru": "Новая версия 1.2.x потенциально изменит имена объектов списка, когда используются специальные символы (включая \".\")! Пожалуйста, удалите старые объекты вручную, если это необходимо.",
          "pt": "A nova versão 1.2.x irá potencialmente alterar os nomes dos objetos de lista quando caracteres especiais (incluindo \".\") são usados! Por favor, exclua os objetos antigos manualmente, se necessário.",
          "nl": "De nieuwe versie 1.2.x zal mogelijk de Namen van List Objects veranderen als speciale personages (includeren) worden gebruikt. Verwijder de oude objecten handmatig als het nodig is.",
          "fr": "La nouvelle version 1.2.x modifiera potentiellement les Noms des objets de la liste lorsque des caractères spéciaux (y compris \"). Veuillez supprimer les anciens objets manuellement si nécessaire.",
          "it": "La nuova versione 1.2.x cambierà potenzialmente i nomi degli oggetti di elenco quando vengono utilizzati caratteri speciali (inclusi \".\")! Si prega di eliminare i vecchi oggetti manualmente se necessario.",
          "es": "La nueva versión 1.2.x potencialmente cambiará los Nombres de Objetos de Lista cuando se utilizan caracteres especiales (incluyendo \"). Por favor, borre los viejos objetos manualmente si es necesario.",
          "pl": "Nowa wersja 1.2.x będzie potencjalnie zmieniać nazwę nazw obiektów listowych, kiedy używa się specjalnych postaci (w tym „.”). Okazuje się, że stare obiekty ręcznie będą potrzebne.",
          "zh-cn": "新版本1.2.x将有可能改变名单所列物品的名称(包括“......”)。 请在必要时删除旧物体。."
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      },
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.15.0",
            "newVersion>=3.15.0"
          ]
        },
        "title": {
          "en": "Format to create Reminder/Alarms changed!",
          "de": "Format zum Erstellen von Reminder/Alarms geändert!",
          "ru": "Формат для создания Reminder/Alarms изменился!",
          "pt": "Formato para criar lembrete / alarmes alterado!",
          "nl": "Format om Reminder/Alarms te creëren!",
          "fr": "Format pour créer Reminder/Alarms changé!",
          "it": "Formato per creare Reminder/Allarma cambiate!",
          "es": "Formato para crear Reminder/Alarms cambiado!",
          "pl": "W celu stworzenia zmian Reminder/Alarms!",
          "zh-cn": "创建Reminder/Alarms的格局改变了!"
        },
        "text": {
          "en": "The format used in the \"New\" states for Alarms or Reminders has changed and allows now to provide more Details. Please see the Readme for the details!",
          "de": "Das Format, das in den neuen Zuständen für Alarme oder Reminders verwendet wird, hat sich geändert und ermöglicht nun mehr Details. Die Readme enthält alle Details!",
          "ru": "Изменен формат, используемый в новых состояниях для тревоги или напоминаний и позволяет теперь предоставить более подробную информацию. Пожалуйста, посмотрите Readme для деталей!",
          "pt": "O formato usado nos Novos estados para Alarmes ou Lembretes mudou e agora permite fornecer mais detalhes. Por favor, veja o Readme para os detalhes!",
          "nl": "De formaat gebruikt in de Nieuwe staten voor Alarms of Reminders is veranderd en staat nu toe om meer Details te leveren. Zie de Readme voor de details!",
          "fr": "Le format utilisé dans les nouveaux états pour les armes ou les rappels a changé et permet maintenant de fournir plus de détails. Veuillez voir le Readme pour les détails!",
          "it": "Il formato utilizzato nei nuovi stati per gli allarmi o i ripetitori è cambiato e consente ora di fornire ulteriori dettagli. Si prega di vedere il Readme per i dettagli!",
          "es": "El formato utilizado en los Nuevos estados para Alarmas o Recordatorios ha cambiado y permite ahora proporcionar más detalles. Por favor, vea el Readme para los detalles!",
          "pl": "Format używany w nowych stanach dla Alarmsa lub Remindersa został zmieniony i pozwala obecnie na dostarczenie większej liczby dekatów. Wyglądaj na szczegóły!",
          "zh-cn": "新州用于申报或递解剂的格式已经改变,现在可以提供更多的细节。 请见详细!"
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ],
        "link": "https://github.com/Apollon77/ioBroker.alexa2#alexa20echo-devicesserialnumberalarm",
        "linkText": {
          "en": "Readme",
          "de": "Reader",
          "ru": "Читать",
          "pt": "Readme",
          "nl": "Lees",
          "fr": "Readme",
          "it": "Readme",
          "es": "Readme",
          "pl": "Ready",
          "zh-cn": "阅读摘要"
        }
      },
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.18.0",
            "newVersion>=3.18.0"
          ]
        },
        "title": {
          "en": "Changes in Smart Home device syncing",
          "de": "Änderungen der Smart Home Gerätesynchronisation",
          "ru": "Изменения в синхронизации устройства Smart Home",
          "pt": "Alterações na sincronização de dispositivos Smart Home",
          "nl": "Veranderingen in Smart Home apparaat",
          "fr": "Changements dans la synchronisation de l'appareil Smart Home",
          "it": "Modifiche nella sincronizzazione dei dispositivi Smart Home",
          "es": "Cambios en la sincronización de dispositivos Smart Home",
          "pl": "Zmiany w Smart Home urządzenie synchronizujące",
          "zh-cn": "Smart家装置的合并变化"
        },
        "text": {
          "en": "Starting with version 3.18.0 smart home device values are no longer synced by default. You need to enable the new state #includeInIntervalQuery existing for each syncable device in the objects in order for the device to be synchronized. Please enable only those that you really need to reduce the requests to Amazon and the Skills and prevent blocking or issues.",
          "de": "Ab Version 3.18.0 werden Smart Home-Gerät-Werte nicht mehr standardmäßig synchronisiert. Der neuen Zustand #includeInInterQuery, der für jedes synchronisierbare Gerät in den Objekten vorhanden ist, muss aktiviert werden um das Gerät zu synchronisieren. Bitte nur diejenigen Geräte aktivieren, die wirklich benötigt werden, um die Anfragen an Amazon und die Skills zu reduzieren und Blockierung oder Probleme zu verhindern.",
          "ru": "Начиная с версии 3.18.0 интеллектуальные ценности домашнего устройства больше не синхронизированы по умолчанию. Вам необходимо включить новое состояние #includeInIntervalQuery существующее для каждого синхронного устройства в объектах, чтобы устройство было синхронизировано. Пожалуйста, включите только те, что вам действительно нужно уменьшить запросы на Amazon и навыки и предотвратить блокировку или проблемы.",
          "pt": "Começando com a versão 3.18.0 os valores de dispositivo doméstico inteligente não são mais sincronizados por padrão. Você precisa ativar o novo estado #includeInIntervalQuery existente para cada dispositivo sincronizável nos objetos para que o dispositivo seja sincronizado. Por favor, ative apenas aqueles que você realmente precisa para reduzir os pedidos para Amazon e as habilidades e evitar bloqueio ou problemas.",
          "nl": "Beginnend met versie 3.18.0 slimme thuis apparatuur is niet meer gesynchroniseerd door defect. Je moet de nieuwe staat in staat stellen includeïntervalQuery die bestaat voor elk syncable apparaat in de objecten om het apparaat te synchroniseren. Betrek alleen degenen die je echt nodig hebt om de verzoeken naar Amazone en de Skills te verminderen en blokkeren of problemen te voorkomen.",
          "fr": "À partir de la version 3.18.0, les valeurs de périphérique à domicile intelligent ne sont plus synchronisées par défaut. Vous devez activer le nouvel état #includeInIntervalQuery existant pour chaque périphérique synchronisé dans les objets afin que le dispositif soit synchronisé. S'il vous plaît activer seulement ceux que vous avez vraiment besoin de réduire les demandes à Amazon et les Compétences et prévenir le blocage ou les problèmes.",
          "it": "A partire dalla versione 3.18.0 i valori dei dispositivi smart home non sono più sincronizzati per impostazione predefinita. È necessario abilitare il nuovo stato #includeInIntervalQuery esistente per ogni dispositivo sincronizzabile negli oggetti in modo che il dispositivo sia sincronizzato. Si prega di attivare solo quelli che è davvero necessario ridurre le richieste a Amazon e le competenze e prevenire il blocco o problemi.",
          "es": "Empezando con la versión 3.18.0, los valores de dispositivo hogar inteligente ya no se sincronizan por defecto. Necesita habilitar el nuevo estado #includeInIntervalQuery existente para cada dispositivo sincronizable en los objetos con el fin de sincronizar el dispositivo. Por favor, active sólo aquellos que realmente necesita para reducir las solicitudes a Amazon y las Habilidades y evitar el bloqueo o problemas.",
          "pl": "Począwszy od wersji 3.18.0, inteligentne urządzenia domowe nie są już zsynchronizowane. Musisz umożliwić nowy stan #include InIntervalQuery istniejące dla każdego urządzenia synchronizującego się w obiektach. Pozwólcie to tylko tym, że musisz zredukować żądania do Amazona i Umiejętności i zapobiegać blokowaniu lub problemom.",
          "zh-cn": "从第3.18.0版的家里装置价值开始,不再因违约而形成。 你们需要使新的国家能够为各物体的每个可核对装置建立新的国家行动目标。 仅请你真正需要减少对亚马逊和技能的要求,并防止阻断或问题。."
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ],
        "link": "https://github.com/Apollon77/ioBroker.alexa2#alexa20echo-devicesserialnumberalarm",
        "linkText": {
          "en": "Readme",
          "de": "Reader",
          "ru": "Читать",
          "pt": "Readme",
          "nl": "Lees",
          "fr": "Readme",
          "it": "Readme",
          "es": "Readme",
          "pl": "Ready",
          "zh-cn": "阅读摘要"
        }
      }
    ]
  },
  "native": {
    "cookie": "",
    "csrf": "",
    "cookieData": null,
    "alexaServiceHost": "",
    "email": "",
    "password": "",
    "userAgent": "",
    "acceptLanguage": "",
    "cookieLoginUrl": "",
    "proxyOwnIp": "",
    "proxyPort": 0,
    "proxyListenBind": "",
    "updateConfigurationInterval": 3600,
    "updateStateInterval": 300,
    "updateHistoryInterval": 300,
    "usePushConnection": true,
    "proxyOverrideIp": "",
    "resetCookies": false,
    "historyIgnoreEmptySummary": false,
    "macDms": null,
    "includeAppDevices": false,
    "synchronizeLists": true,
    "synchronizeSmartHomeDevices": false
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "If communication with alexa works",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    },
    {
      "_id": "info.cookie",
      "type": "state",
      "common": {
        "role": "text",
        "name": "Alexa Cookie",
        "type": "string",
        "read": true,
        "write": false,
        "def": ""
      },
      "native": {}
    },
    {
      "_id": "info.csrf",
      "type": "state",
      "common": {
        "role": "text",
        "name": "Alexa CSRF",
        "type": "string",
        "read": true,
        "write": false,
        "def": ""
      },
      "native": {}
    }
  ]
}
