{
  "common": {
    "name": "alexa2",
    "version": "3.17.1",
    "title": "Alexa2 (Amazon Echo)",
    "titleLang": {
      "en": "Alexa2 (Amazon Echo)",
      "de": "Alexa2 (Amazon Echo)",
      "ru": "Alexa2 (Amazon Echo)",
      "pt": "Alexa2 (Amazon Echo)",
      "nl": "Alexa2 (Amazon Echo)",
      "fr": "Alexa2 (Amazon Echo)",
      "it": "Alexa2 (Amazon Echo)",
      "es": "Alexa2 (eco de Amazon)",
      "pl": "Alexa2 (Amazon Echo)",
      "zh-cn": "Alexa2（Amazon回声）"
    },
    "desc": {
      "en": "Remote control for Alexa (Amazon Echo)",
      "de": "Steuerung von Alexa (Amazon Echo)",
      "ru": "Управление Alexa (Amazon Echo)",
      "pt": "Controle remoto para Alexa (Amazon Echo)",
      "nl": "Afstandsbediening voor Alexa (Amazon Echo)",
      "fr": "Télécommande pour Alexa (Amazon Echo)",
      "it": "Telecomando per Alexa (Amazon Echo)",
      "es": "Control remoto para Alexa (Amazon Echo)",
      "pl": "Pilot do Alexa (Amazon Echo)",
      "zh-cn": "Alexa（Amazon Echo）的遥控器"
    },
    "platform": "Javascript/Node.js",
    "news": {
      "3.17.1": {
        "en": "Work around timing issues with speak-volume when using announcement\nCorrectly initialize volume/mute on startup also when player data are not available\nDo not overwrite speak-volume (and some other fields) with null on adapter start\nFix crash cases reported by Sentry",
        "de": "Arbeiten Sie rund um Timing-Probleme mit Talk-Volume bei der Nutzung der Ankündigung\nKorrigieren Sie Volume/Mute beim Start auch dann, wenn die Playerdaten nicht verfügbar sind\nNicht überschreiben Sprechvolumen (und einige andere Felder) mit Null auf Adapterstart\nReparieren Crashfälle gemeldet von Sentry",
        "ru": "Работайте по вопросам сроков с разговором при использовании объявления\nПравильно инициализировать объем/мут на стартапе также, когда данные игрока не доступны\nНе переписать разговорный (и некоторые другие поля) с null на запуске адаптера\nИсправление случаев аварии, описанных Sentry",
        "pt": "Trabalhe em torno de problemas de cronometragem com falar-volume ao usar o anúncio\nIniciar corretamente o volume/mute na inicialização também quando os dados do jogador não estão disponíveis\nNão sobrescrever falar-volume (e alguns outros campos) com nulo no início do adaptador\nCorrigir casos de acidente relatados por Sentry",
        "nl": "Werk rond de timing kwesties met spreek-volum wanneer je aankondiging gebruikt\nCorrect gestart volume/mut op start-up ook wanneer spelers data niet beschikbaar zijn\nSchrijf niet te veel praat-volume (en andere velden) met nul op adapter start\nVertaling:",
        "fr": "Travailler autour des problèmes de timing avec le mot-volume lors de l'annonce\nInitialiser correctement le volume/mute sur le démarrage aussi lorsque les données du lecteur ne sont pas disponibles\nNe pas écraser parler-volume (et quelques autres champs) avec null sur le début de l'adaptateur\nTroubles de crash signalés par Sentry",
        "it": "Lavorare intorno problemi di temporizzazione con talk-volume quando si utilizza l'annuncio\nEsattamente inizializzare volume/muto all'avvio anche quando i dati del giocatore non sono disponibili\nNon sovrascrivere la voce-volume (e alcuni altri campi) con null all'inizio dell'adattatore\nCorrezione dei casi di crash segnalati da Sentry",
        "es": "Trabajar en torno a cuestiones de tiempo con voz-volumen al usar el anuncio\nIniciar correctamente el volumen/mute en la startup también cuando los datos del reproductor no están disponibles\nNo sobreescribir voz-volumen (y algunos otros campos) con null on adapter start\nCasos de accidente fijo reportados por Sentry",
        "pl": "Praca nad problemami związanymi z mowa-volume przy użyciu ogłoszenia\nOczywiście wstępnie inicjuje tom/mute, kiedy dane gracza nie są dostępne\nNie piszę słów-volume (i niektóre inne pola) z pustym starterem\nSprawy katastrofy Fix podane przez Sentry’a",
        "zh-cn": "利用公告处理时间问题\n在未提供投入数据时,投入数量/升值的细分\n不用说话(和其他一些领域)就不过分,不让读者开始。\nSentry所报告的六例事故"
      },
      "3.17.0": {
        "en": "Add support to play Audible books in Music-Providers\nOptimize deletion of alarms and reminders\nOptimize requesting smart home device data",
        "de": "Unterstützung bei Audible-Büchern in Music-Providers hinzufügen\nOptimieren Sie das Löschen von Alarmen und Erinnerungen\nOptimieren Sie anfragende Smart-Home-Gerät-Daten",
        "ru": "Добавить поддержку, чтобы играть в книги Audible в Music-Providers\nОптимизация удаления тревог и напоминаний\nОптимизация запроса данных умного дома",
        "pt": "Adicionar suporte para jogar Audible books in Music-Providers\nOtimizar a exclusão de alarmes e lembretes\nOtimizar solicitando dados inteligentes do dispositivo doméstico",
        "nl": "Voeg steun aan het spelen van Audible boeken in Music-Providers\nOptimiliseer deletie van alarm en herinneringen\nOptimistisch verzoek om slimme thuis apparatuur",
        "fr": "Ajouter le support pour jouer Livres d'Audible dans Music-Providers\nOptimiser la suppression des alarmes et des rappels\nOptimiser la demande de données sur les appareils à domicile intelligents",
        "it": "Aggiungi supporto per giocare Libri Audible in Music-Providers\nOttimizzare la cancellazione di allarmi e promemoria\nOttimizzare la richiesta di dati smart home device",
        "es": "Añadir soporte para reproducir libros Audible en Music-Providers\nOptimize deletion of alarms and reminders\nOptimize requesting smart home device data",
        "pl": "Addd supportuje Audible Books w Music-Providers\nOptymizacja alarmów i przypomnień\nOptymizowanie żądania inteligentnego urządzenia domowego",
        "zh-cn": "增加在Music-Providers开设的书店支助\n消除震惊和提醒\nB. 要求有智的家用装置数据"
      },
      "3.16.1": {
        "en": "Fix deletion and cancellation of Alarms and Reminders",
        "de": "Löschen und Löschen von Alarmen und Erinnerungen",
        "ru": "Исправление удаления и отмены тревог и напоминаний",
        "pt": "Corrigir exclusão e cancelamento de alarmes e lembretes",
        "nl": "Verwijdering en annulering van Alarm en Reminderingen",
        "fr": "Suppression et annulation des alarmes et rappels",
        "it": "Fissare la cancellazione e la cancellazione di Allarmi e Remine",
        "es": "Eliminación y cancelación de alarmas y recordatorios",
        "pl": "Delecja i odwołanie Alarms and Reminders",
        "zh-cn": "Fix 删除和取消Alarms和 Reminders"
      },
      "3.16.0": {
        "en": "Add (official) support for Music-Alarms - they are now listed under \"Alarms\" together with the other Alarms! The \"sound\" list will contain teh device specific music targets - so you can basically zse the ones that you created at least once via voice commands.\nFor a Music Alarm the \"customVolume\" on the aram is used to set the normal device volume 2s before the alarm but do not (!) reset it afterwards\nPrevent crashes on one time Alarms that just triggered",
        "de": "Fügen Sie (offizielle) Unterstützung für Music-Alarms hinzu - sie sind jetzt unter Alarms zusammen mit den anderen Alarmen aufgeführt! Die Soundliste enthält teh-Gerät bestimmte Musikziele - so können Sie im Grunde zse die, die Sie mindestens einmal über Sprachbefehle erstellt haben.\nFür einen Musikalarm wird das benutzerdefinierteVolume auf dem Aram verwendet, um das normale Gerätevolumen 2s vor dem Alarm einzustellen, aber nicht (!) danach zurücksetzen\nVerhindern Sie Abstürzen auf einmal Alarme, die gerade ausgelöst",
        "ru": "Добавьте (официальную) поддержку Music-Alarms - они теперь перечислены в Alarms вместе с другими тревогами! Звуковой список будет содержать тех устройства конкретные музыкальные цели - так что вы можете в основном зацировать те, которые вы создали хотя бы один раз через голосовые команды.\nДля музыкальной сигнализации customVolume на араме используется для установки нормального устройства объем 2s до тревоги, но не (!) сброс его после\nПредотвратите сбои в один раз тревоги, которые просто спрошены",
        "pt": "Adicionar (oficial) suporte para Music-Alarms - eles estão agora listados em Alarmes junto com os outros Alarmes! A lista de som conterá alvos de música específicos do dispositivo teh - assim você pode basicamente zse aqueles que você criou pelo menos uma vez através de comandos de voz.\nPara um alarme de música o personalizadoVolume no aram é usado para definir o volume de dispositivo normal 2s antes do alarme, mas não (!) redefini-lo depois\nImpedir falhas em uma vez Alarmes que apenas desencadearam",
        "nl": "Steun voor muziek-Alarms, ze staan nu geregistreerd onder Alarms samen met de andere Alarms. De geluidslijst bevat specifieke muzikale doelen, zodat je in feite degenen kunt zzen die je op zijn minst één keer gemaakt hebt via stembevelen.\nVoor een Muziek Alarm is het gebruikelijke apparaat op de aram gebruikt om het normale apparaat volume 2 te zetten voor het alarm, maar doe het niet na afloop\nVertaling:",
        "fr": "Ajoutez un support (officiel) pour Music-Alarms - ils sont maintenant répertoriés sous Alarms avec les autres Alarms! La liste sonore contiendra des cibles de musique spécifiques à l'appareil teh - vous pouvez donc en gros zse celles que vous avez créées au moins une fois par des commandes vocales.\nPour une Alarme de musique, le volume personnalisé sur l'aram est utilisé pour régler le volume normal de l'appareil 2s avant l'alarme mais ne (!) pas le réinitialiser après\nPrévenir les accidents sur une seule fois Alarmes qui vient de déclencher",
        "it": "Aggiungi (ufficiale) supporto per Music-Alarms - ora sono elencati sotto Allarmi insieme agli altri Allarmi! La lista del suono conterrà obiettivi musicali specifici del dispositivo teh - in modo da poter fondamentalmente zse quelli che hai creato almeno una volta tramite comandi vocali.\nPer un allarme musicale il volume personalizzatoVolume sull'aram viene utilizzato per impostare il normale volume del dispositivo 2s prima dell'allarme ma non (!) resettarlo dopo\nPrevenire crash in una volta Allarmi che appena innescato",
        "es": "Añadir (oficial) soporte para Music-Alarms - ahora se enumeran bajo Alarmas junto con los otros Alarmas! La lista de sonido contendrá objetivos de música específicos del dispositivo de teh, para que puedas básicamente zse los que creaste al menos una vez a través de comandos de voz.\nPara un Alarma de Música se utiliza el Volume personalizado en el aram para configurar el volumen de dispositivo normal 2s antes de la alarma, pero no (!) reiniciarlo después\nPreviene fallos en una vez Alarmas que acaban de desencadenar",
        "pl": "Add (oficjalna) wsparcie dla Music-Alarms - są one obecnie wymieniane pod Alarms i Alarms! Lista dźwiękowa będzie zawierać teh urządzenie specyficzne dla muzyki - tak więc możesz prowadzić zse the ones that you created at least once by voice commands.\nDla Music Alarm, zwyczajowo Volume on the aram jest używany do ustawienia normalnego objętości urządzeniem 2 przed alarmem, ale nie (!)\nPrevent rozbił się po raz pierwszy w Alarms, co spowodowało wybuch",
        "zh-cn": "添加(官方)支持Music-Alarms,现在列在Alarms和其他Alarms! 稳妥的清单将包含茶叶装置的具体音乐目标,因此,你基本上可以把你至少通过声音指挥创造的东西交给你。.\n对于一个Music Alarm来说,在警觉之前,使用了一整套的设备,但没有(!) 重新塑造后。\nA. 防止事故"
      },
      "3.15.2": {
        "en": "Fix case where initialization of the adapter was never finished and so nothing was controllable",
        "de": "Fix-Fall, wo die Initialisierung des Adapters noch nie beendet wurde und so nichts steuerbar war",
        "ru": "Исправление дела, где инициализация адаптера никогда не была закончена и поэтому ничего не было управляемым",
        "pt": "Corrigir caso onde a inicialização do adaptador nunca foi concluída e assim nada foi controlável",
        "nl": "De eerste zaak waar de aanmelding van de adapter nooit klaar was, dus niets was beheersbaar",
        "fr": "Cas fixe où l'initialisation de l'adaptateur n'a jamais été terminée et donc rien n'a été contrôlable",
        "it": "Fissa caso in cui l'inizializzazione dell'adattatore non è mai stata terminata e quindi nulla è stato controllabile",
        "es": "Caso fijo donde la inicialización del adaptador nunca fue terminada y nada fue controlable",
        "pl": "Sprawa Fix, w której inicjacja adaptatora nigdy nie została ukończona i tak nic nie było sterowane",
        "zh-cn": "变通者的初始化从未完成,因此无法控制的混合案件。"
      },
      "3.15.1": {
        "en": "Convert Smarthome device values if wrong datatype is delivered by device\nAdd handling for two more battery health states for smart home devices\nFix crash case when initializing notifications",
        "de": "Smarthome-Gerätewerte umrechnen, wenn der falsche Datentyp von Gerät geliefert wird\nHinzufügen von Handling für zwei weitere Batterie-Gesundheitszustände für Smart Home-Geräte\nFehlerbehebung bei der Initialisierung von Benachrichtigungen",
        "ru": "Преобразуйте значения устройства Smarthome, если неправильный тип данных поставлен устройством\nДобавить обработку для двух других состояния здоровья батареи для умных домашних устройств\nИсправление случай сбоя при инициализации уведомлений",
        "pt": "Converta valores de dispositivo Smarthome se o tipo de dados errado for entregue pelo dispositivo\nAdicionar manipulação para mais dois estados de saúde da bateria para dispositivos domésticos inteligentes\nCorrigir caso de acidente ao inicializar notificações",
        "nl": "Convert Smarthome apparaat waarden als verkeerde datatype wordt geleverd door apparaat\nAanpassen voor twee batterijen gezondheidsstaat voor slimme thuis apparaten\nVertaling:",
        "fr": "Convertir les valeurs de périphérique Smarthome si le type de données incorrect est livré par périphérique\nAjouter la manipulation pour deux autres états de santé de la batterie pour les appareils à domicile intelligents\nCorrection d ' un cas de choc lors de l ' initialisation des notifications",
        "it": "Convertire i valori del dispositivo Smarthome se il tipo di dati sbagliato viene fornito dal dispositivo\nAggiungere la gestione per altri due stati di salute della batteria per i dispositivi smart home\nFissare caso crash quando inizializzare le notifiche",
        "es": "Convertir valores de dispositivo Smarthome si el tipo de datos incorrecto es entregado por dispositivo\nAgregar el manejo para dos estados de salud de baterías más para dispositivos inteligentes para el hogar\nCorregir caso de accidente al inicializar notificaciones",
        "pl": "Przetworzone wartości urządzenia Smarthome, jeśli niewłaściwe dane są dostarczane przez urządzenia\nDostarczanie pomocy dla dwóch dodatkowych stanów na zdrowiu baterii\nSprawa rozbicia Fix, gdy inicjuje powiadomienie",
        "zh-cn": "如果使用装置提供错误数据,则可对Smarthome装置的数值\n增加两个更电池的保健州的照旧房屋设施\n首次发出通知时发生的事故"
      },
      "3.15.0": {
        "en": "IMPORTANT: Format to specify multiple Details on \"New\" for Alarms and Reminders changed, see documentation!\nHuge enhancements for Alarms, Reminders and Fixes\nAdd new Commands skill and skillYours to start Skills\nAdd several more Device Preferences\nFix doNotDisturb command broken in 3.14.0\nSlow down the initialization of all data a bit, so startup could take longer",
        "de": "WICHTIG: Format, um mehrere Details zu Neu für Alarme und Erinnerungen geändert, siehe Dokumentation!\nRiesige Verbesserungen für Alarme, Reminders und Fixes\nFügen Sie neue Befehle Geschicklichkeit und Geschicklichkeit zu starten Fähigkeiten\nMehrere weitere Geräteeinstellungen hinzufügen\nFix doNotDisturb Befehl in 3.14.0 gebrochen\nVerlangsamen Sie die Initialisierung aller Daten ein bisschen, so dass Startup länger dauern könnte",
        "ru": "ВАЖНО: Формат, чтобы указать несколько деталей о New for Alarms and Reminders изменен, см. документацию!\nОгромные улучшения для тревог, напоминаний и исправлений\nДобавить новые команды мастерство и навыкМолодежники, чтобы начать навыки\nДобавить еще несколько предпочтений устройства\nFix doNotDisturb команда сломана в 3.14.0\nЗамедлить инициализацию всех данных немного, поэтому стартап может занять больше времени",
        "pt": "IMPORTANTE: Formato para especificar vários detalhes em Novo para alarmes e lembretes alterados, veja documentação!\nGrandes melhorias para alarmes, lembretes e correções\nAdicionar novos comandos habilidade e habilidadeSeus para começar Habilidades\nAdicione várias outras preferências de dispositivo\nCorrigir comando doNotDisturb quebrado em 3.14.0\nAbranda a inicialização de todos os dados um pouco, para que a inicialização possa demorar mais",
        "nl": "Format om meerdere Details op Nieuw te specificeren voor Alarms en Reminders veranderden, documentatie zien!\nGrote verbetering voor Alarms, herinneringen en Fixes\nVoeg nieuwe vaardigheden en vaardigheden toe om Skills te starten\nVertaling:\nVertaling:\nVertraag de initialisatie van alle gegevens, dus starten kan langer duren",
        "fr": "IMPORTANT: Format pour spécifier plusieurs détails sur les nouvelles armes et les rappels changés, voir la documentation!\nAméliorations énormes pour les armes, les rappels et les fixations\nAjoutez de nouvelles compétences et compétences de commandementsVos à commencer les compétences\nAjouter plusieurs autres Préférences de périphériques\nCorrection de la commande doNotDisturb cassée en 3.14.0\nSlow down the initialization of all data a bit, so startup could take longer",
        "it": "IMPORTANTE: Formato per specificare più dettagli su Nuovo per Allarmi e Rimoni cambiati, vedi documentazione!\nGrandi miglioramenti per Allarmi, Remine e Fissi\nAggiungi nuove abilità di comandi e abilitàLa tua per iniziare abilità\nAggiungi più Preferenze di dispositivo\nFix doNotDisturb comando rotto in 3.14.0\nRallentare l'inizializzazione di tutti i dati un po ', in modo che l'avvio potrebbe richiedere più tempo",
        "es": "IMPORTANTE: Formato para especificar múltiples detalles sobre Nuevo para Alarmas y Recordatorios cambiado, vea documentación!\nGrandes mejoras para Alarmas, Recordatorios y Fijas\nAñadir nuevos Comandos habilidad y habilidadTuyo para empezar Habilidades\nAñadir varias preferencias de dispositivo más\nFijar el comando doNoDisturb roto en 3.14.0\nReduzca un poco la inicialización de todos los datos, por lo que la startup podría tardar más",
        "pl": "IMPORTANT: Format określający wiele dekatów na New for Alarms and Reminders!\nHuge udoskonalał Alarms, Reminders i Fixs\nAddd new Commandments and skillYours (ang.)\nAddd multiple times larger than Preferences\nFix do NotDisturb Command rozbiło się w 3.14 roku\nZmniejszenie inicjacji wszystkich danych jest bita, więc startup może trwać dłużej",
        "zh-cn": "IMPORTANT: 详细写明关于新语和雷米德语的多种细节的变化,见文件!\nA. 提高Alarms、Reminders和Fixes的力度\n增加新指挥部的技能和技能,以培养技能\n增加几处 Device Pec\nFix do notDises指挥 in3.14.0\n由于所有数据的初始化,因此,开始时间会长。"
      }
    },
    "keywords": [
      "alexa",
      "amazon",
      "amazon echo",
      "echo dot",
      "echo show"
    ],
    "authors": [
      "Apollon77 <iobroker@fischer-ka.de>"
    ],
    "mode": "daemon",
    "icon": "alexa.png",
    "materialize": true,
    "extIcon": "https://raw.githubusercontent.com/Apollon77/ioBroker.alexa2/master/admin/alexa.png",
    "readme": "https://github.com/Apollon77/ioBroker.alexa2/blob/master/README.md",
    "loglevel": "info",
    "type": "iot-systems",
    "enabled": true,
    "messagebox": true,
    "license": "MIT",
    "localLink": "https://alexa.amazon.com",
    "connectionType": "cloud",
    "dataSource": "push",
    "tier": 2,
    "compact": true,
    "dependencies": [
      {
        "js-controller": ">=2.0.0"
      }
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://e9ac55f23fe149e78b1eab9ed4bf26ad@sentry.iobroker.net/8",
        "pathWhitelist": [
          "@apollon",
          "alexa-cookie2",
          "alexa-remote2"
        ],
        "errorBlacklist": [
          "SyntaxError"
        ]
      }
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.13.0",
            "newVersion>=3.13.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!"
        },
        "text": {
          "en": "The new version 1.2.x will potentially change the Names of List Objects when special characters (including \".\") are used! Please delete the old objects manually if needed.",
          "de": "Die neue Version 1.2.x wird die Namen der Listenobjekte möglicherweise ändern, wenn Sonderzeichen (einschließlich \".\") verwendet werden! Bitte löschen Sie die alten Objekte bei Bedarf manuell.",
          "ru": "Новая версия 1.2.x потенциально изменит имена объектов списка, когда используются специальные символы (включая \".\")! Пожалуйста, удалите старые объекты вручную, если это необходимо.",
          "pt": "A nova versão 1.2.x irá potencialmente alterar os nomes dos objetos de lista quando caracteres especiais (incluindo \".\") são usados! Por favor, exclua os objetos antigos manualmente, se necessário.",
          "nl": "De nieuwe versie 1.2.x zal mogelijk de Namen van List Objects veranderen als speciale personages (includeren) worden gebruikt. Verwijder de oude objecten handmatig als het nodig is.",
          "fr": "La nouvelle version 1.2.x modifiera potentiellement les Noms des objets de la liste lorsque des caractères spéciaux (y compris \"). Veuillez supprimer les anciens objets manuellement si nécessaire.",
          "it": "La nuova versione 1.2.x cambierà potenzialmente i nomi degli oggetti di elenco quando vengono utilizzati caratteri speciali (inclusi \".\")! Si prega di eliminare i vecchi oggetti manualmente se necessario.",
          "es": "La nueva versión 1.2.x potencialmente cambiará los Nombres de Objetos de Lista cuando se utilizan caracteres especiales (incluyendo \"). Por favor, borre los viejos objetos manualmente si es necesario.",
          "pl": "Nowa wersja 1.2.x będzie potencjalnie zmieniać nazwę nazw obiektów listowych, kiedy używa się specjalnych postaci (w tym „.”). Okazuje się, że stare obiekty ręcznie będą potrzebne.",
          "zh-cn": "新版本1.2.x将有可能改变名单所列物品的名称(包括“......”)。 请在必要时删除旧物体。."
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      },
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.15.0",
            "newVersion>=3.15.0"
          ]
        },
        "title": {
          "en": "Format to create Reminder/Alarms changed!",
          "de": "Format zum Erstellen von Reminder/Alarms geändert!",
          "ru": "Формат для создания Reminder/Alarms изменился!",
          "pt": "Formato para criar lembrete / alarmes alterado!",
          "nl": "Format om Reminder/Alarms te creëren!",
          "fr": "Format pour créer Reminder/Alarms changé!",
          "it": "Formato per creare Reminder/Allarma cambiate!",
          "es": "Formato para crear Reminder/Alarms cambiado!",
          "pl": "W celu stworzenia zmian Reminder/Alarms!",
          "zh-cn": "创建Reminder/Alarms的格局改变了!"
        },
        "text": {
          "en": "The format used in the \"New\" states for Alarms or Reminders has changed and allows now to provide more Details. Please see the Readme for the details!",
          "de": "Das Format, das in den neuen Zuständen für Alarme oder Reminders verwendet wird, hat sich geändert und ermöglicht nun mehr Details. Die Readme enthält alle Details!",
          "ru": "Изменен формат, используемый в новых состояниях для тревоги или напоминаний и позволяет теперь предоставить более подробную информацию. Пожалуйста, посмотрите Readme для деталей!",
          "pt": "O formato usado nos Novos estados para Alarmes ou Lembretes mudou e agora permite fornecer mais detalhes. Por favor, veja o Readme para os detalhes!",
          "nl": "De formaat gebruikt in de Nieuwe staten voor Alarms of Reminders is veranderd en staat nu toe om meer Details te leveren. Zie de Readme voor de details!",
          "fr": "Le format utilisé dans les nouveaux états pour les armes ou les rappels a changé et permet maintenant de fournir plus de détails. Veuillez voir le Readme pour les détails!",
          "it": "Il formato utilizzato nei nuovi stati per gli allarmi o i ripetitori è cambiato e consente ora di fornire ulteriori dettagli. Si prega di vedere il Readme per i dettagli!",
          "es": "El formato utilizado en los Nuevos estados para Alarmas o Recordatorios ha cambiado y permite ahora proporcionar más detalles. Por favor, vea el Readme para los detalles!",
          "pl": "Format używany w nowych stanach dla Alarmsa lub Remindersa został zmieniony i pozwala obecnie na dostarczenie większej liczby dekatów. Wyglądaj na szczegóły!",
          "zh-cn": "新州用于申报或递解剂的格式已经改变,现在可以提供更多的细节。 请见详细!"
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ],
        "link": "https://github.com/Apollon77/ioBroker.alexa2#alexa20echo-devicesserialnumberalarm",
        "linkText": {
          "en": "Readme",
          "de": "Reader",
          "ru": "Читать",
          "pt": "Readme",
          "nl": "Lees",
          "fr": "Readme",
          "it": "Readme",
          "es": "Readme",
          "pl": "Ready",
          "zh-cn": "阅读摘要"
        }
      }
    ]
  },
  "native": {
    "cookie": "",
    "csrf": "",
    "cookieData": null,
    "alexaServiceHost": "",
    "email": "",
    "password": "",
    "userAgent": "",
    "acceptLanguage": "",
    "cookieLoginUrl": "",
    "proxyOwnIp": "",
    "proxyPort": 0,
    "proxyListenBind": "",
    "updateConfigurationInterval": 3600,
    "updateStateInterval": 300,
    "updateHistoryInterval": 300,
    "updateSmartHomeDevicesInterval": 0,
    "usePushConnection": true,
    "proxyOverrideIp": "",
    "resetCookies": false,
    "historyIgnoreEmptySummary": false,
    "macDms": null,
    "includeAppDevices": false,
    "synchronizeLists": true,
    "synchronizeSmartHomeDevices": true
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "If communication with alexa works",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    },
    {
      "_id": "info.cookie",
      "type": "state",
      "common": {
        "role": "text",
        "name": "Alexa Cookie",
        "type": "string",
        "read": true,
        "write": false,
        "def": ""
      },
      "native": {}
    },
    {
      "_id": "info.csrf",
      "type": "state",
      "common": {
        "role": "text",
        "name": "Alexa CSRF",
        "type": "string",
        "read": true,
        "write": false,
        "def": ""
      },
      "native": {}
    }
  ]
}
