{
  "common": {
    "name": "alexa2",
    "version": "3.26.4",
    "blockedVersions": [
      "~3.14.0",
      "~3.15.0",
      "~3.16.0",
      "3.17.0",
      "3.17.1",
      "3.17.2",
      "3.17.3"
    ],
    "title": "Alexa2 (Amazon Echo)",
    "titleLang": {
      "en": "Alexa2 (Amazon Echo)",
      "de": "Alexa2 (Amazon Echo)",
      "ru": "Alexa2 (Amazon Echo)",
      "pt": "Alexa2 (Amazon Echo)",
      "nl": "Alexa2 (Amazon Echo)",
      "fr": "Alexa2 (Amazon Echo)",
      "it": "Alexa2 (Amazon Echo)",
      "es": "Alexa2 (eco de Amazon)",
      "pl": "Alexa2 (Amazon Echo)",
      "zh-cn": "Alexa2（Amazon回声）",
      "uk": "Alexa2 (Amazon Echo)"
    },
    "desc": {
      "en": "Remote control for Alexa (Amazon Echo)",
      "de": "Steuerung von Alexa (Amazon Echo)",
      "ru": "Управление Alexa (Amazon Echo)",
      "pt": "Controle remoto para Alexa (Amazon Echo)",
      "nl": "Afstandsbediening voor Alexa (Amazon Echo)",
      "fr": "Télécommande pour Alexa (Amazon Echo)",
      "it": "Telecomando per Alexa (Amazon Echo)",
      "es": "Control remoto para Alexa (Amazon Echo)",
      "pl": "Pilot do Alexa (Amazon Echo)",
      "zh-cn": "Alexa（Amazon Echo）的遥控器",
      "uk": "Пульт дистанційного керування для Alexa (Amazon Echo)"
    },
    "platform": "Javascript/Node.js",
    "news": {
      "3.26.4": {
        "en": "Removed Weblink\nAdjust History query to recent Amazon changes",
        "de": "Entfernen von Weblink\nBegleichen Sie die Geschichte Anfrage an aktuelle Amazon-Änderungen",
        "ru": "Удаленная веб-ссылка\nНастройте исторический запрос на недавние изменения в Amazon",
        "pt": "Weblink removido\nAjustar a consulta de história às mudanças recentes da Amazônia",
        "nl": "Weblink verwijderd\nHistorische zoekopdracht aanpassen aan recente Amazon-wijzigingen",
        "fr": "Supprimé le lien Web\nRégler la requête d'historique aux changements récents d'Amazon",
        "it": "Rimozione di Weblink\nRegolare la query di storia alle recenti modifiche Amazon",
        "es": "Redlink eliminado\nAdjust Historia consulta a cambios recientes de Amazon",
        "pl": "Usunięto mrugnięcie\nDostosuj zapytanie Historia do ostatnich zmian Amazon",
        "uk": "Видалити Weblink\nНалаштування історичного запиту на останні зміни Amazon",
        "zh-cn": "删除了网络链接\n调整历史查询以适应最近的亚马逊更改"
      },
      "3.26.3": {
        "en": "Fixed the proxy login process",
        "de": "Behoben des Proxy-Anmeldevorgangs",
        "ru": "Исправлен процесс авторизации прокси",
        "pt": "Corrigido o processo de login proxy",
        "nl": "Het proxy loginproces",
        "fr": "Correction du processus de connexion proxy",
        "it": "Risolto il processo di login proxy",
        "es": "Arreglado el proceso de inicio de sesión proxy",
        "pl": "Fixed proxy login process",
        "uk": "Виправлено процес проксі",
        "zh-cn": "A. 确定代伐木过程"
      },
      "3.26.2": {
        "en": "Removed infos how to get cookies manually because no longer available\nOptimized Admin configuration order of settings for history\nFixed some crash cases reported by Sentry\nAdded some more device types",
        "de": "Entfernte Informationen, wie man Cookies manuell erhält, weil nicht mehr verfügbar\nOptimierte Admin-Konfigurationsreihenfolge von Einstellungen für die Geschichte\nBehoben einige Unfallfälle von Sentry gemeldet\nEinige weitere Gerätetypen hinzugefügt",
        "ru": "Удалили информацию о том, как получить файлы cookie вручную, потому что больше не доступно\nОптимизированный порядок настройки Admin для истории\nИсправлены некоторые случаи сбоя, описанные в Sentry\nДобавлены еще некоторые типы устройств",
        "pt": "Remover informações como obter cookies manualmente porque não mais disponível\nOrdem de configuração de administrador otimizada para histórico\nCorrigido alguns casos de acidente relatados por Sentry\nAdicionado alguns mais tipos de dispositivo",
        "nl": "Verwijderde informatie hoe je koekjes handmatig kan krijgen, want niet langer beschikbaar\nOptimaal administratiebevel voor geschiedenis\nVertaling:\nVoeg nog wat apparaten toe",
        "fr": "Informations supprimées comment obtenir des cookies manuellement parce qu'il n'est plus disponible\nCommande de configuration Admin optimisée pour l'histoire\nCorrection de certains cas de crash signalés par Sentry\nAjout d'autres types de périphériques",
        "it": "Informazioni eliminate come ottenere i cookie manualmente perché non piÃ1 disponibili\nOrdine di configurazione di Admin ottimizzato per la storia\nRisolto alcuni casi di crash segnalati da Sentry\nAggiunto alcuni più tipi di dispositivo",
        "es": "Datos eliminados cómo obtener las cookies manualmente porque ya no está disponible\nOrden de configuración de Admin optimizada para la historia\nArreglado algunos casos de accidentes reportados por Sentry\nAñadido algunos tipos de dispositivo más",
        "pl": "Przesuwane informacje o tym, jak sporządzać ręcznie, ponieważ nie są już dostępne\nOptymizowana wersja Admin dla historii\nSzczegółowe przypadki katastrofy odnotowane przez Sentry'a\nUdostępnić więcej typów urządzeń",
        "uk": "Видаліть інформацію про те, як отримати файли cookie вручну, оскільки більше не доступний\nОптимізований порядок налаштування адміністратора для історії\nВиправлено деякі випадки аварії, які повідомили Sentry\nДодайте більше типів пристроїв",
        "zh-cn": "投机:如何用手做饭,因为不再能再接手。\nB. 为历史创造有利条件\nSentry所报告的一些事故\n增加一些更类型的装置"
      },
      "3.26.1": {
        "en": "Fix missing text in Admin Config",
        "de": "Löschen Sie fehlenden Text in Admin Config",
        "ru": "Исправление отсутствует текст в Admin Config",
        "pt": "Corrigir texto em falta no Admin Config",
        "nl": "Vertaling:",
        "fr": "Correction du texte manquant dans Admin Config",
        "it": "Fissare il testo mancante in Admin Config",
        "es": "Corregir texto perdido en Admin Config",
        "pl": "Zaginął tekst Admin Config",
        "uk": "Виправлення відсутніх тексту в Конфігурації адміністратора",
        "zh-cn": "Fix 在阿德明·阿菲格斯失踪案文"
      },
      "3.26.0": {
        "en": "Automatically query of activity/history needs to be enabled manually (if you need it!)",
        "de": "Automatische Abfrage von Aktivität/Geschichte muss manuell aktiviert werden (wenn Sie es benötigen)",
        "ru": "Автоматически запрос активности/истории должен быть включен вручную (если вам это нужно)",
        "pt": "Consulta automática da atividade / história precisa ser ativada manualmente (se você precisar)",
        "nl": "Automatisch onderzoek naar activiteit/historie moet handmatig ingeschakeld worden als je het nodig hebt",
        "fr": "Une requête automatique d'activité/histoire doit être activée manuellement (si vous en avez besoin) ",
        "it": "La query automatica di attività/storia deve essere abilitata manualmente (se ne hai bisogno)",
        "es": "La consulta automática de la actividad/historia necesita ser activada manualmente (si lo necesita)",
        "pl": "Automatycznie zapytanie o aktywność/historię musi być umożliwione ręcznie (jeśli potrzebujemy)",
        "uk": "Автоматично квартету діяльності/історінки необхідно ввімкнути вручну",
        "zh-cn": "活动/活动需要自动查询(如果你需要!)"
      },
      "3.25.5": {
        "en": "Optimize activity detection to process all relevant entries in all cases",
        "de": "Optimieren Sie die Aktivitätserkennung, um alle relevanten Einträge in allen Fällen zu bearbeiten",
        "ru": "Оптимизация обнаружения активности для обработки всех соответствующих записей во всех случаях",
        "pt": "Otimizar a detecção de atividades para processar todas as entradas relevantes em todos os casos",
        "nl": "Optimaal activiteitsdetector om alle relevante instanties te verwerken in alle gevallen",
        "fr": "Optimiser la détection d'activité pour traiter toutes les entrées pertinentes dans tous les cas",
        "it": "Ottimizzare il rilevamento delle attività per elaborare tutte le voci pertinenti in tutti i casi",
        "es": "Optimize activity detection to process all relevant entries in all cases",
        "pl": "Wykrywanie aktywności w optymalizacji polega na przetwarzaniu wszystkich istotnych wpisów we wszystkich przypadkach",
        "uk": "Оптимальне виявлення активності для обробки всіх відповідних записів у всіх випадках",
        "zh-cn": "制止在所有情况下处理所有有关物品的活动"
      },
      "3.25.4": {
        "en": "Optimize activity detection to process all relevant entries and not just the last one",
        "de": "Optimieren Sie die Aktivitätserkennung, um alle relevanten Einträge zu bearbeiten und nicht nur die letzte",
        "ru": "Оптимизация обнаружения активности для обработки всех соответствующих записей и не только последнего",
        "pt": "Otimizar a detecção de atividades para processar todas as entradas relevantes e não apenas a última",
        "nl": "Optimale activiteit detectie om alle relevante ingangen te verwerken en niet alleen de laatste",
        "fr": "Optimiser la détection d'activité pour traiter toutes les entrées pertinentes et pas seulement la dernière",
        "it": "Ottimizzare il rilevamento delle attività per elaborare tutte le voci pertinenti e non solo l'ultimo",
        "es": "Optimize activity detection to process all relevant entries and not just the last one",
        "pl": "Wykrywanie czynności optymalnych do przetwarzania wszystkich istotnych wpisów i nie tylko ostatni",
        "uk": "Оптимізуйте виявлення активності для обробки всіх відповідних записів і не просто останнього",
        "zh-cn": "停止活动,处理所有有关物品,而不是最后一个物品"
      }
    },
    "keywords": [
      "alexa",
      "amazon",
      "amazon echo",
      "echo dot",
      "echo show"
    ],
    "authors": [
      "Apollon77 <iobroker@fischer-ka.de>"
    ],
    "mode": "daemon",
    "icon": "alexa.png",
    "materialize": true,
    "extIcon": "https://raw.githubusercontent.com/Apollon77/ioBroker.alexa2/master/admin/alexa.png",
    "readme": "https://github.com/Apollon77/ioBroker.alexa2/blob/master/README.md",
    "loglevel": "info",
    "type": "iot-systems",
    "enabled": true,
    "messagebox": true,
    "license": "MIT",
    "connectionType": "cloud",
    "dataSource": "push",
    "tier": 2,
    "compact": true,
    "dependencies": [
      {
        "js-controller": ">=2.0.0"
      }
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://e9ac55f23fe149e78b1eab9ed4bf26ad@sentry.iobroker.net/8",
        "pathWhitelist": [
          "@apollon",
          "alexa-cookie2",
          "alexa-remote2"
        ],
        "errorBlacklist": [
          "SyntaxError"
        ]
      }
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.13.0",
            "newVersion>=3.13.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!",
          "uk": "Важливе повідомлення!"
        },
        "text": {
          "en": "The new version 1.2.x will potentially change the Names of List Objects when special characters (including \".\") are used! Please delete the old objects manually if needed.",
          "de": "Die neue Version 1.2.x wird die Namen der Listenobjekte möglicherweise ändern, wenn Sonderzeichen (einschließlich \".\") verwendet werden! Bitte löschen Sie die alten Objekte bei Bedarf manuell.",
          "ru": "Новая версия 1.2.x потенциально изменит имена объектов списка, когда используются специальные символы (включая \".\")! Пожалуйста, удалите старые объекты вручную, если это необходимо.",
          "pt": "A nova versão 1.2.x irá potencialmente alterar os nomes dos objetos de lista quando caracteres especiais (incluindo \".\") são usados! Por favor, exclua os objetos antigos manualmente, se necessário.",
          "nl": "De nieuwe versie 1.2.x zal mogelijk de Namen van List Objects veranderen als speciale personages (includeren) worden gebruikt. Verwijder de oude objecten handmatig als het nodig is.",
          "fr": "La nouvelle version 1.2.x modifiera potentiellement les Noms des objets de la liste lorsque des caractères spéciaux (y compris \"). Veuillez supprimer les anciens objets manuellement si nécessaire.",
          "it": "La nuova versione 1.2.x cambierà potenzialmente i nomi degli oggetti di elenco quando vengono utilizzati caratteri speciali (inclusi \".\")! Si prega di eliminare i vecchi oggetti manualmente se necessario.",
          "es": "La nueva versión 1.2.x potencialmente cambiará los Nombres de Objetos de Lista cuando se utilizan caracteres especiales (incluyendo \"). Por favor, borre los viejos objetos manualmente si es necesario.",
          "pl": "Nowa wersja 1.2.x będzie potencjalnie zmieniać nazwę nazw obiektów listowych, kiedy używa się specjalnych postaci (w tym „.”). Okazuje się, że stare obiekty ręcznie będą potrzebne.",
          "zh-cn": "新版本1.2.x将有可能改变名单所列物品的名称(包括“......”)。 请在必要时删除旧物体。.",
          "uk": "Нова версія 1.2.x потенційно змінить імена об’єктів списку, коли використовуються спеціальні символи (включаючи «.»)! За потреби видаліть старі об’єкти вручну."
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      },
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.15.0",
            "newVersion>=3.15.0"
          ]
        },
        "title": {
          "en": "Format to create Reminder/Alarms changed!",
          "de": "Format zum Erstellen von Reminder/Alarms geändert!",
          "ru": "Формат для создания Reminder/Alarms изменился!",
          "pt": "Formato para criar lembrete / alarmes alterado!",
          "nl": "Format om Reminder/Alarms te creëren!",
          "fr": "Format pour créer Reminder/Alarms changé!",
          "it": "Formato per creare Reminder/Allarma cambiate!",
          "es": "Formato para crear Reminder/Alarms cambiado!",
          "pl": "W celu stworzenia zmian Reminder/Alarms!",
          "zh-cn": "创建Reminder/Alarms的格局改变了!",
          "uk": "Змінено формат створення нагадувань/будильників!"
        },
        "text": {
          "en": "The format used in the \"New\" states for Alarms or Reminders has changed and allows now to provide more Details. Please see the Readme for the details!",
          "de": "Das Format, das in den neuen Zuständen für Alarme oder Reminders verwendet wird, hat sich geändert und ermöglicht nun mehr Details. Die Readme enthält alle Details!",
          "ru": "Изменен формат, используемый в новых состояниях для тревоги или напоминаний и позволяет теперь предоставить более подробную информацию. Пожалуйста, посмотрите Readme для деталей!",
          "pt": "O formato usado nos Novos estados para Alarmes ou Lembretes mudou e agora permite fornecer mais detalhes. Por favor, veja o Readme para os detalhes!",
          "nl": "De formaat gebruikt in de Nieuwe staten voor Alarms of Reminders is veranderd en staat nu toe om meer Details te leveren. Zie de Readme voor de details!",
          "fr": "Le format utilisé dans les nouveaux états pour les armes ou les rappels a changé et permet maintenant de fournir plus de détails. Veuillez voir le Readme pour les détails!",
          "it": "Il formato utilizzato nei nuovi stati per gli allarmi o i ripetitori è cambiato e consente ora di fornire ulteriori dettagli. Si prega di vedere il Readme per i dettagli!",
          "es": "El formato utilizado en los Nuevos estados para Alarmas o Recordatorios ha cambiado y permite ahora proporcionar más detalles. Por favor, vea el Readme para los detalles!",
          "pl": "Format używany w nowych stanach dla Alarmsa lub Remindersa został zmieniony i pozwala obecnie na dostarczenie większej liczby dekatów. Wyglądaj na szczegóły!",
          "zh-cn": "新州用于申报或递解剂的格式已经改变,现在可以提供更多的细节。 请见详细!",
          "uk": "Формат, який використовується в станах «Новий» для будильників або нагадувань, змінився і тепер дозволяє надавати більше деталей. Будь ласка, перегляньте файл Readme, щоб дізнатися більше!"
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ],
        "link": "https://github.com/Apollon77/ioBroker.alexa2#alexa20echo-devicesserialnumberalarm",
        "linkText": {
          "en": "Readme",
          "de": "Reader",
          "ru": "Читать",
          "pt": "Readme",
          "nl": "Lees",
          "fr": "Readme",
          "it": "Readme",
          "es": "Readme",
          "pl": "Ready",
          "zh-cn": "阅读摘要",
          "uk": "Readme"
        }
      },
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.18.0",
            "newVersion>=3.18.0"
          ]
        },
        "title": {
          "en": "Changes in Smart Home device syncing",
          "de": "Änderungen der Smart Home Gerätesynchronisation",
          "ru": "Изменения в синхронизации устройства Smart Home",
          "pt": "Alterações na sincronização de dispositivos Smart Home",
          "nl": "Veranderingen in Smart Home apparaat",
          "fr": "Changements dans la synchronisation de l'appareil Smart Home",
          "it": "Modifiche nella sincronizzazione dei dispositivi Smart Home",
          "es": "Cambios en la sincronización de dispositivos Smart Home",
          "pl": "Zmiany w Smart Home urządzenie synchronizujące",
          "zh-cn": "Smart家装置的合并变化",
          "uk": "Зміни в синхронізації пристрою Smart Home"
        },
        "text": {
          "en": "Starting with version 3.18.0 smart home device values are no longer synced by default. You need to enable the new state #includeInIntervalQuery existing for each syncable device in the objects in order for the device to be synchronized. Please enable only those that you really need to reduce the requests to Amazon and the Skills and prevent blocking or issues.",
          "de": "Ab Version 3.18.0 werden Smart Home-Gerät-Werte nicht mehr standardmäßig synchronisiert. Der neuen Zustand #includeInInterQuery, der für jedes synchronisierbare Gerät in den Objekten vorhanden ist, muss aktiviert werden um das Gerät zu synchronisieren. Bitte nur diejenigen Geräte aktivieren, die wirklich benötigt werden, um die Anfragen an Amazon und die Skills zu reduzieren und Blockierung oder Probleme zu verhindern.",
          "ru": "Начиная с версии 3.18.0 интеллектуальные ценности домашнего устройства больше не синхронизированы по умолчанию. Вам необходимо включить новое состояние #includeInIntervalQuery существующее для каждого синхронного устройства в объектах, чтобы устройство было синхронизировано. Пожалуйста, включите только те, что вам действительно нужно уменьшить запросы на Amazon и навыки и предотвратить блокировку или проблемы.",
          "pt": "Começando com a versão 3.18.0 os valores de dispositivo doméstico inteligente não são mais sincronizados por padrão. Você precisa ativar o novo estado #includeInIntervalQuery existente para cada dispositivo sincronizável nos objetos para que o dispositivo seja sincronizado. Por favor, ative apenas aqueles que você realmente precisa para reduzir os pedidos para Amazon e as habilidades e evitar bloqueio ou problemas.",
          "nl": "Beginnend met versie 3.18.0 slimme thuis apparatuur is niet meer gesynchroniseerd door defect. Je moet de nieuwe staat in staat stellen includeïntervalQuery die bestaat voor elk syncable apparaat in de objecten om het apparaat te synchroniseren. Betrek alleen degenen die je echt nodig hebt om de verzoeken naar Amazone en de Skills te verminderen en blokkeren of problemen te voorkomen.",
          "fr": "À partir de la version 3.18.0, les valeurs de périphérique à domicile intelligent ne sont plus synchronisées par défaut. Vous devez activer le nouvel état #includeInIntervalQuery existant pour chaque périphérique synchronisé dans les objets afin que le dispositif soit synchronisé. S'il vous plaît activer seulement ceux que vous avez vraiment besoin de réduire les demandes à Amazon et les Compétences et prévenir le blocage ou les problèmes.",
          "it": "A partire dalla versione 3.18.0 i valori dei dispositivi smart home non sono più sincronizzati per impostazione predefinita. È necessario abilitare il nuovo stato #includeInIntervalQuery esistente per ogni dispositivo sincronizzabile negli oggetti in modo che il dispositivo sia sincronizzato. Si prega di attivare solo quelli che è davvero necessario ridurre le richieste a Amazon e le competenze e prevenire il blocco o problemi.",
          "es": "Empezando con la versión 3.18.0, los valores de dispositivo hogar inteligente ya no se sincronizan por defecto. Necesita habilitar el nuevo estado #includeInIntervalQuery existente para cada dispositivo sincronizable en los objetos con el fin de sincronizar el dispositivo. Por favor, active sólo aquellos que realmente necesita para reducir las solicitudes a Amazon y las Habilidades y evitar el bloqueo o problemas.",
          "pl": "Począwszy od wersji 3.18.0, inteligentne urządzenia domowe nie są już zsynchronizowane. Musisz umożliwić nowy stan #include InIntervalQuery istniejące dla każdego urządzenia synchronizującego się w obiektach. Pozwólcie to tylko tym, że musisz zredukować żądania do Amazona i Umiejętności i zapobiegać blokowaniu lub problemom.",
          "zh-cn": "从第3.18.0版的家里装置价值开始,不再因违约而形成。 你们需要使新的国家能够为各物体的每个可核对装置建立新的国家行动目标。 仅请你真正需要减少对亚马逊和技能的要求,并防止阻断或问题。.",
          "uk": "Починаючи з версії 3.18.0, значення пристрою розумного дому більше не синхронізуються за умовчанням. Вам потрібно ввімкнути новий стан #includeInIntervalQuery, який існує для кожного синхронізованого пристрою в об’єктах, щоб пристрій міг синхронізуватися. Увімкніть лише ті, які вам дійсно потрібні, щоб зменшити кількість запитів до Amazon і Skills і запобігти блокуванню чи проблемам."
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ],
        "link": "https://github.com/Apollon77/ioBroker.alexa2#alexa20echo-devicesserialnumberalarm",
        "linkText": {
          "en": "Readme",
          "de": "Reader",
          "ru": "Читать",
          "pt": "Readme",
          "nl": "Lees",
          "fr": "Readme",
          "it": "Readme",
          "es": "Readme",
          "pl": "Ready",
          "zh-cn": "阅读摘要",
          "uk": "Readme"
        }
      },
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.26.0",
            "newVersion>=3.26.0"
          ]
        },
        "title": {
          "en": "Changes in activity synchronisation",
          "de": "Änderungen der Aktivitätssynchronisation",
          "ru": "Изменения в синхронизации активности",
          "pt": "Alterações na sincronização de atividades",
          "nl": "Verandering in actuele synchronisatie",
          "fr": "Changements de synchronisation d'activité",
          "it": "Modifiche della sincronizzazione delle attività",
          "es": "Cambios en la sincronización de actividad",
          "pl": "Zmiany w synchronizacji aktywności",
          "uk": "Зміна синхронізації активності",
          "zh-cn": "B. 活动统一时间的变化"
        },
        "text": {
          "en": "Starting with Version 3.26.0 The activity/history is no longer queried automatically. If you need this automatic query please enable it in the settings - but only if you really need it! It generates load on the amazon systems and we should try to reduce this as much as possible please!",
          "de": "Beginnend mit Version 3.26.0 Die Aktivität/History wird nicht mehr automatisch abgefragt. Wenn Sie diese automatische Abfrage benötigen, aktivieren Sie es bitte in den Einstellungen - aber nur, wenn Sie es wirklich brauchen! Es erzeugt Belastung der Amazonsysteme und wir sollten versuchen, dies so viel wie möglich zu reduzieren, bitte!",
          "ru": "Начиная с версии 3.26.0 Деятельность/история больше не запрашивается автоматически. Если вам нужен этот автоматический запрос, пожалуйста, включите его в настройках - но только если вам это действительно нужно! Он генерирует нагрузку на амазоночные системы, и мы должны попытаться уменьшить это как можно больше, пожалуйста!",
          "pt": "Começando com a versão 3.26.0 A atividade/história não é mais consultada automaticamente. Se você precisar desta consulta automática, por favor ative-a nas configurações - mas só se você realmente precisar dele! Ele gera carga nos sistemas de amazon e devemos tentar reduzir isso tanto quanto possível, por favor!",
          "nl": "Begin met Version 3.26.0 De activiteit/hestory is niet meer automatisch. Als je deze automatische zoektocht nodig hebt, zet het dan in de settings, maar alleen als je het echt nodig hebt! Het genereert lading op de Amazone-systemen en we moeten proberen dit zoveel mogelijk te verminderen!",
          "fr": "À partir de la version 3.26.0 L'activité/l'histoire n'est plus demandée automatiquement. Si vous avez besoin de cette requête automatique, veuillez l'activer dans les paramètres - mais seulement si vous en avez vraiment besoin! Il génère de la charge sur les systèmes amazon et nous devrions essayer de réduire cela autant que possible s'il vous plaît!",
          "it": "A partire dalla versione 3.26.0 L'attività/storia non è più richiesta automaticamente. Se hai bisogno di questa query automatica, abilitalo nelle impostazioni - ma solo se ne hai davvero bisogno! Esso genera carico sui sistemi amazon e dovremmo cercare di ridurre questo il più possibile per favore!",
          "es": "Empezando con la versión 3.26.0 La actividad/historia ya no se pregunta automáticamente. Si necesita esta consulta automática, por favor, activela en la configuración - pero sólo si realmente lo necesita! Genera carga en los sistemas amazon y debemos tratar de reducir todo lo posible por favor!",
          "pl": "Od wersji 3.26.0 Aktywność/historia nie jest już automatycznie kwestionowana. Jeśli potrzebujesz automatycznego zapytania, co pozwalasz w ustawieniach - ale tylko wtedy, jeśli tak naprawdę potrzebujesz! Wykorzystuje on ładunek na systemach amazonek i powinniśmy starać się zredukować to, co jest możliwe!",
          "uk": "Починаючи з версії 3.26.0 Діяльність/історія не передається автоматично. Якщо вам потрібен цей автоматичний запит, будь ласка, ввімкніть його в налаштуваннях - але тільки якщо вам дійсно потрібно! Ми можемо самі зателефонувати одержувачу!",
          "zh-cn": "A. 导 言 活动/法令不再自动提出。 如果你需要这种自动问询,请在环境中这样做,但只有你真正需要! 它给马纳区系统带来了沉重的负担,我们应尽量减少这一点!"
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {
    "cookie": "",
    "csrf": "",
    "cookieData": null,
    "alexaServiceHost": "",
    "email": "",
    "password": "",
    "userAgent": "",
    "acceptLanguage": "",
    "cookieLoginUrl": "",
    "proxyOwnIp": "",
    "proxyPort": 0,
    "proxyListenBind": "",
    "updateConfigurationInterval": 3600,
    "updateStateInterval": 300,
    "updateHistoryInterval": 300,
    "usePushConnection": true,
    "proxyOverrideIp": "",
    "resetCookies": false,
    "historyIgnoreEmptySummary": false,
    "macDms": null,
    "includeAppDevices": false,
    "synchronizeLists": true,
    "synchronizeSmartHomeDevices": false,
    "autoQueryActivityOnTrigger": false
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "If communication with alexa works",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    },
    {
      "_id": "info.cookie",
      "type": "state",
      "common": {
        "role": "text",
        "name": "Alexa Cookie",
        "type": "string",
        "read": true,
        "write": false,
        "def": ""
      },
      "native": {}
    },
    {
      "_id": "info.csrf",
      "type": "state",
      "common": {
        "role": "text",
        "name": "Alexa CSRF",
        "type": "string",
        "read": true,
        "write": false,
        "def": ""
      },
      "native": {}
    }
  ]
}
