{
  "common": {
    "name": "alexa2",
    "version": "3.18.4",
    "blockedVersions": [
      "~3.14.0",
      "~3.15.0",
      "~3.16.0",
      "3.17.0",
      "3.17.1",
      "3.17.2",
      "3.17.3"
    ],
    "title": "Alexa2 (Amazon Echo)",
    "titleLang": {
      "en": "Alexa2 (Amazon Echo)",
      "de": "Alexa2 (Amazon Echo)",
      "ru": "Alexa2 (Amazon Echo)",
      "pt": "Alexa2 (Amazon Echo)",
      "nl": "Alexa2 (Amazon Echo)",
      "fr": "Alexa2 (Amazon Echo)",
      "it": "Alexa2 (Amazon Echo)",
      "es": "Alexa2 (eco de Amazon)",
      "pl": "Alexa2 (Amazon Echo)",
      "zh-cn": "Alexa2（Amazon回声）"
    },
    "desc": {
      "en": "Remote control for Alexa (Amazon Echo)",
      "de": "Steuerung von Alexa (Amazon Echo)",
      "ru": "Управление Alexa (Amazon Echo)",
      "pt": "Controle remoto para Alexa (Amazon Echo)",
      "nl": "Afstandsbediening voor Alexa (Amazon Echo)",
      "fr": "Télécommande pour Alexa (Amazon Echo)",
      "it": "Telecomando per Alexa (Amazon Echo)",
      "es": "Control remoto para Alexa (Amazon Echo)",
      "pl": "Pilot do Alexa (Amazon Echo)",
      "zh-cn": "Alexa（Amazon Echo）的遥控器"
    },
    "platform": "Javascript/Node.js",
    "news": {
      "3.18.4": {
        "en": "Fix crash case reported by Sentry\nAdd image for Fire Cube",
        "de": "Reparieren Crashfall berichtet von Sentry\nBild hinzugefügt für Fire Cube",
        "ru": "Исправление случай аварии сообщается в Sentry\nДобавить изображение для Fire Cube",
        "pt": "Corrigir caso de acidente relatado por Sentry\nAdicionar imagem para Fire Cube",
        "nl": "Vertaling:\nVertaling:",
        "fr": "Correction de l'accident rapporté par Sentry\nAjouter une image pour Fire Cube",
        "it": "Correzione caso di crash segnalato da Sentry\nAggiungi immagine per Fire Cube",
        "es": "Caso de accidente fijo reportado por Sentry\nAñadir imagen para Fire Cube",
        "pl": "Sprawa rozbicia Fixa doniesiona przez firmę Sentry\nZdjęcie Fire Cube",
        "zh-cn": "Sentry所报告的六例事故\nFire Cube的添加形象"
      },
      "3.18.3": {
        "en": "Fix doNotDisturb and doNotDisturb for All devices\nUpdate do not disturb status after set for all devices\npreserve a changed name for a \"This device\" device object",
        "de": "Fix doNotDisturb und doNotDisturb für alle Geräte\nUpdate stört nicht den Status nach dem Set für alle Geräte\neinen geänderten Namen für ein Gerät-Objekt \"This device\" erhalten",
        "ru": "Fix doNotDisturb и doNotDisturb для всех устройств\nОбновление не нарушает статус после установки для всех устройств\nсохранить измененное имя для объекта устройства \"Это устройство\"",
        "pt": "Fix doNotDisturb e doNotDisturb para Todos os dispositivos\nAtualização não perturba o status após o conjunto para todos os dispositivos\npreservar um nome alterado para um objeto de dispositivo \"Este dispositivo\"",
        "nl": "Vertaling:\nQuality over Quantity (QoQ) Releases Vertaling:\nbewaar een andere naam voor een \"Dit apparaat\" voorwerp",
        "fr": "Fix doNotDisturb et doNotDisturb pour tous les appareils\nLa mise à jour ne perturbe pas l'état après défini pour tous les appareils\nconserver un nom modifié pour un objet \"Ce dispositif\"",
        "it": "Fix doNotDisturb e doNotDisturb per tutti i dispositivi\nAggiornamento non disturbare lo stato dopo impostato per tutti i dispositivi\nconservare un nome modificato per un oggetto dispositivo \"Questo dispositivo\"",
        "es": "Fix doNoDisturb y doNoDisturb para Todos los dispositivos\nActualización no altera el estado después de establecerse para todos los dispositivos\npreservar un nombre cambiado para un objeto de dispositivo \"Este dispositivo\"",
        "pl": "Fix do NotDisturb i do NotDisturb dla wszystkich urządzeń\nNie zaniepokojenie statusu po założeniu wszystkich urządzeń\nzachowanie zmienionej nazwy na „Ten urządzenie” obiekt",
        "zh-cn": "Fix do Notdiss涡轮和NotDis涡轮机对所有装置的干扰\n所有装置的更新不干扰地位\n保留“这种装置”装置的名称的更改"
      },
      "3.18.2": {
        "en": "Enable commands again for Apps with type A2TF17PFR55MTB - will only work sometimes as it seems",
        "de": "Befehle wieder aktivieren für Apps mit Typ A2TF17PFR55MTB - wird nur manchmal funktionieren, wie es scheint",
        "ru": "Включите команды снова для приложений с типом A2TF17PFR55MTB - будет работать только иногда, как кажется",
        "pt": "Habilite comandos novamente para Apps com tipo A2TF17PFR55MTB - só funcionará às vezes como parece",
        "nl": "Weer bevoegd voor apps met type A2TF17PFR55MTB zal soms alleen werken als het lijkt alsof",
        "fr": "Activer les commandes de nouveau pour les applications avec le type A2TF17PFR55MTB - ne fonctionnera que parfois comme il semble",
        "it": "Attivare nuovamente comandi per Apps con tipo A2TF17PFR55MTB - funzionerà solo a volte come sembra",
        "es": "Activar comandos de nuevo para aplicaciones con tipo A2TF17PFR55MTB - sólo funcionará a veces como parece",
        "pl": "Wznowione polecenia z A2TF17PFR55MTB mogą działać niekiedy tylko w przypadku, gdy wydaje się to być",
        "zh-cn": "对A2 TF17PFR55B等类型的申请,连带的指挥将只是在似乎看来工作。"
      },
      "3.18.1": {
        "en": "Optimize Handling when push connection could not be established",
        "de": "Optimieren Sie die Handhabung, wenn keine Push-Verbindung hergestellt werden konnte",
        "ru": "Оптимизация обработки при нажатии соединения не может быть установлена",
        "pt": "Otimizar o manuseio quando a conexão push não pôde ser estabelecida",
        "nl": "Optimiliseer Handling wanneer de verbinding niet kan worden vastgesteld",
        "fr": "Optimiser la manipulation lorsque la connexion push ne peut être établie",
        "it": "Ottimizzare la gestione quando la connessione di spinta non potrebbe essere stabilita",
        "es": "Optimize Handling cuando la conexión de empuje no se puede establecer",
        "pl": "Optimizację Handlingu, gdy nie można było utworzyć połączenia push",
        "zh-cn": "如果不建立推动联系,就能减少浪费"
      },
      "3.18.0": {
        "en": "IMPORTANT: Smart home device values are from now on only synchronized when enabled via #includeInIntervalQuery state. Enable only what's really needed!\nAdd FireTV commands for FireTV devices\nAdd CommandsAll.* commands to be sent to all devices\nAdd several more Preferences (Equalizer, Display, AUX, Speaker)\nMore optimizations and fixes",
        "de": "WICHTIG: Smart Home-Gerätewerte werden ab sofort nur synchronisiert, wenn sie über #includeInIntervalQuery-Zustand aktiviert sind. Aktiviere nur das, was wirklich nötig ist!\nFireTV-Befehle für FireTV-Geräte hinzufügen\nBefehle hinzufügen, die an alle Geräte gesendet werden sollen\nWeitere Einstellungen hinzufügen (Equalizer, Display, AUX, Lautsprecher)\nWeitere Optimierungen und Fixierungen",
        "ru": "ВАЖНО: Значения умного домашнего устройства теперь на только синхронизированы, когда включено через #includeInIntervalQuery состояние. Включите только то, что действительно нужно!\nДобавить FireTV команды для FireTV устройств\nДобавить CommandsAll.* команды, которые будут отправлены на все устройства\nДобавьте еще несколько предпочтений (Equalizer, Display, AUX, Speaker)\nБольше оптимизации и исправлений",
        "pt": "IMPORTANTE: Os valores dos dispositivos domésticos inteligentes são agora sincronizados apenas quando ativados através do #includeInIntervalQuery estado. Habilite apenas o que realmente é necessário!\nAdicionar comandos FireTV para dispositivos FireTV\nAdicionar comandos CommandsAll.* para ser enviado para todos os dispositivos\nAdicione várias outras Preferências (Equalizer, Display, AUX, Speaker)\nMais otimizações e correções",
        "nl": "Slimme thuis apparatuurwaarden zijn van nu af aan alleen gesynchroniseerd als je in staat bent via includeïntervalQuery staat. Alleen wat nodig is!\nVertaling:\nVertaling:\nVertaling:\nMeer optimaties en fixaties",
        "fr": "IMPORTANT : Les valeurs de périphériques à domicile intelligents sont désormais synchronisées uniquement lorsqu'elles sont activées via #includeInIntervalQuery state. Activez seulement ce qui est vraiment nécessaire !\nAjouter les commandes FireTV pour les appareils FireTV\nAjouter les commandesAll.* à envoyer à tous les appareils\nAjouter plusieurs autres Préférences (Equalizer, Display, AUX, Speaker)\nPlus d'optimisations et de corrections",
        "it": "IMPORTANTE: I valori Smart home device sono sincronizzati solo quando abilitati tramite #includeInIntervalQuery State. Abilitare solo ciò che è veramente necessario!\nAggiungi comandi FireTV per dispositivi FireTV\nAggiungi comandiAll.* da inviare a tutti i dispositivi\nAggiungi più Preferenze (Equalizzatore, Display, AUX, Speaker)\nAltre ottimizzazioni e correzioni",
        "es": "IMPORTANTE: Los valores inteligentes del dispositivo casero se sincronizan solo a partir de ahora mediante #includeInIntervalQuery state. ¡Hable sólo lo que realmente se necesita!\nAñadir comandos FireTV para dispositivos FireTV\nAgregar comandosAll.* comandos a ser enviados a todos los dispositivos\nAñadir varias preferencias más (Equalizer, Display, AUX, Speaker)\nMás optimizaciones y soluciones",
        "pl": "IMPORTANT: Smart home urządzenie jest już zsynchronizowane tylko w momencie, gdy można je za pomocą #includes IntervalQuery state. Doszło do tego, co naprawdę potrzebuje!\nAdd FireTV Command (ang.)\nAdd CommandsAll (ang.)\nDodał jeszcze kilka referencji (Equalizer, Display, AUX, Speaker)\nWięcej optymalizacji i napraw",
        "zh-cn": "IMPORTANT:Smart家装置的数值现在只与通过Pinclude Include In IntervalQuery州的设施同步。 只有真需要的!\n消防电视设备的增派指挥\n增加指挥部:* 向所有装置发送的指挥\n增加几处P引述(联邦十名议长)\nB. 改进和定量"
      },
      "3.17.5": {
        "en": "Minimum smart home device query interval is now 5 minutes and not 1 minute anymore to remove some requests for now",
        "de": "Mindest-Smart-Home-Gerät-Abfrage-Intervall ist jetzt 5 Minuten und nicht 1 Minute mehr, um einige Anfragen für jetzt zu entfernen",
        "ru": "Минимальный домашний интервал запросов теперь 5 минут и больше не 1 минуты, чтобы удалить некоторые запросы сейчас",
        "pt": "Intervalo de consulta de dispositivo doméstico inteligente mínimo é agora 5 minutos e não 1 minuto mais para remover alguns pedidos para agora",
        "nl": "Minimum smart home apparaat query interval is nu vijf minuten en geen minuut meer om verzoeken te verwijderen voor nu",
        "fr": "L'intervalle minimal de requête de l'appareil à domicile intelligent est maintenant 5 minutes et pas 1 minute plus pour supprimer certaines demandes pour l'instant",
        "it": "Intervallo di query del dispositivo domestico minimo intelligente è ora 5 minuti e non 1 minuto più per rimuovere alcune richieste per ora",
        "es": "El intervalo mínimo de consulta de dispositivo inteligente es ahora 5 minutos y no 1 minuto más para eliminar algunas solicitudes por ahora",
        "pl": "Minimum inteligentne przedziały na urządzenie domowe to obecnie 5 minut i nie 1 minuta, aby usunąć niektóre żądania",
        "zh-cn": "最低智能家用具的间隔时间现在为5分钟,而不是1分钟多,以取消目前的一些要求。"
      },
      "3.17.4": {
        "en": "Make sure disabling query intervals really work (disabling smart home device and state and configuration was not possible)",
        "de": "Stellen Sie sicher, dass die Abfrageintervalle wirklich funktionieren (das Abschalten von Smart Home-Gerät und Zustand und Konfiguration war nicht möglich)",
        "ru": "Убедитесь, что отключение интервалов запросов действительно работает (отключение умного дома устройства и государства и конфигурации не было возможным)",
        "pt": "Certifique-se de desativar intervalos de consulta realmente funcionar (desativar dispositivo home inteligente e estado e configuração não foi possível)",
        "nl": "Zorg ervoor dat nieuwsgierige intervals echt werken",
        "fr": "Assurez-vous de désactiver les intervalles de requête vraiment fonctionner (disabling smart home device and state and configuration was not possible)",
        "it": "Assicurarsi di disabilitare gli intervalli di query realmente funziona (disabling smart home device e stato e configurazione non è stato possibile)",
        "es": "Asegúrate de desactivar los intervalos de consulta realmente funcionan (disabling smart home device and state and settings was not possible)",
        "pl": "Umożliwia to, że odstępy zapytania naprawdę działają (rozpoznanie inteligentnego urządzenia domowego i stanu i konfiguracji nie były możliwe)",
        "zh-cn": "保证不带任何时间真正工作(不可能有智的家用装置和州组合)。"
      }
    },
    "keywords": [
      "alexa",
      "amazon",
      "amazon echo",
      "echo dot",
      "echo show"
    ],
    "authors": [
      "Apollon77 <iobroker@fischer-ka.de>"
    ],
    "mode": "daemon",
    "icon": "alexa.png",
    "materialize": true,
    "extIcon": "https://raw.githubusercontent.com/Apollon77/ioBroker.alexa2/master/admin/alexa.png",
    "readme": "https://github.com/Apollon77/ioBroker.alexa2/blob/master/README.md",
    "loglevel": "info",
    "type": "iot-systems",
    "enabled": true,
    "messagebox": true,
    "license": "MIT",
    "localLink": "https://alexa.amazon.com",
    "connectionType": "cloud",
    "dataSource": "push",
    "tier": 2,
    "compact": true,
    "dependencies": [
      {
        "js-controller": ">=2.0.0"
      }
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://e9ac55f23fe149e78b1eab9ed4bf26ad@sentry.iobroker.net/8",
        "pathWhitelist": [
          "@apollon",
          "alexa-cookie2",
          "alexa-remote2"
        ],
        "errorBlacklist": [
          "SyntaxError"
        ]
      }
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.13.0",
            "newVersion>=3.13.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!"
        },
        "text": {
          "en": "The new version 1.2.x will potentially change the Names of List Objects when special characters (including \".\") are used! Please delete the old objects manually if needed.",
          "de": "Die neue Version 1.2.x wird die Namen der Listenobjekte möglicherweise ändern, wenn Sonderzeichen (einschließlich \".\") verwendet werden! Bitte löschen Sie die alten Objekte bei Bedarf manuell.",
          "ru": "Новая версия 1.2.x потенциально изменит имена объектов списка, когда используются специальные символы (включая \".\")! Пожалуйста, удалите старые объекты вручную, если это необходимо.",
          "pt": "A nova versão 1.2.x irá potencialmente alterar os nomes dos objetos de lista quando caracteres especiais (incluindo \".\") são usados! Por favor, exclua os objetos antigos manualmente, se necessário.",
          "nl": "De nieuwe versie 1.2.x zal mogelijk de Namen van List Objects veranderen als speciale personages (includeren) worden gebruikt. Verwijder de oude objecten handmatig als het nodig is.",
          "fr": "La nouvelle version 1.2.x modifiera potentiellement les Noms des objets de la liste lorsque des caractères spéciaux (y compris \"). Veuillez supprimer les anciens objets manuellement si nécessaire.",
          "it": "La nuova versione 1.2.x cambierà potenzialmente i nomi degli oggetti di elenco quando vengono utilizzati caratteri speciali (inclusi \".\")! Si prega di eliminare i vecchi oggetti manualmente se necessario.",
          "es": "La nueva versión 1.2.x potencialmente cambiará los Nombres de Objetos de Lista cuando se utilizan caracteres especiales (incluyendo \"). Por favor, borre los viejos objetos manualmente si es necesario.",
          "pl": "Nowa wersja 1.2.x będzie potencjalnie zmieniać nazwę nazw obiektów listowych, kiedy używa się specjalnych postaci (w tym „.”). Okazuje się, że stare obiekty ręcznie będą potrzebne.",
          "zh-cn": "新版本1.2.x将有可能改变名单所列物品的名称(包括“......”)。 请在必要时删除旧物体。."
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      },
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.15.0",
            "newVersion>=3.15.0"
          ]
        },
        "title": {
          "en": "Format to create Reminder/Alarms changed!",
          "de": "Format zum Erstellen von Reminder/Alarms geändert!",
          "ru": "Формат для создания Reminder/Alarms изменился!",
          "pt": "Formato para criar lembrete / alarmes alterado!",
          "nl": "Format om Reminder/Alarms te creëren!",
          "fr": "Format pour créer Reminder/Alarms changé!",
          "it": "Formato per creare Reminder/Allarma cambiate!",
          "es": "Formato para crear Reminder/Alarms cambiado!",
          "pl": "W celu stworzenia zmian Reminder/Alarms!",
          "zh-cn": "创建Reminder/Alarms的格局改变了!"
        },
        "text": {
          "en": "The format used in the \"New\" states for Alarms or Reminders has changed and allows now to provide more Details. Please see the Readme for the details!",
          "de": "Das Format, das in den neuen Zuständen für Alarme oder Reminders verwendet wird, hat sich geändert und ermöglicht nun mehr Details. Die Readme enthält alle Details!",
          "ru": "Изменен формат, используемый в новых состояниях для тревоги или напоминаний и позволяет теперь предоставить более подробную информацию. Пожалуйста, посмотрите Readme для деталей!",
          "pt": "O formato usado nos Novos estados para Alarmes ou Lembretes mudou e agora permite fornecer mais detalhes. Por favor, veja o Readme para os detalhes!",
          "nl": "De formaat gebruikt in de Nieuwe staten voor Alarms of Reminders is veranderd en staat nu toe om meer Details te leveren. Zie de Readme voor de details!",
          "fr": "Le format utilisé dans les nouveaux états pour les armes ou les rappels a changé et permet maintenant de fournir plus de détails. Veuillez voir le Readme pour les détails!",
          "it": "Il formato utilizzato nei nuovi stati per gli allarmi o i ripetitori è cambiato e consente ora di fornire ulteriori dettagli. Si prega di vedere il Readme per i dettagli!",
          "es": "El formato utilizado en los Nuevos estados para Alarmas o Recordatorios ha cambiado y permite ahora proporcionar más detalles. Por favor, vea el Readme para los detalles!",
          "pl": "Format używany w nowych stanach dla Alarmsa lub Remindersa został zmieniony i pozwala obecnie na dostarczenie większej liczby dekatów. Wyglądaj na szczegóły!",
          "zh-cn": "新州用于申报或递解剂的格式已经改变,现在可以提供更多的细节。 请见详细!"
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ],
        "link": "https://github.com/Apollon77/ioBroker.alexa2#alexa20echo-devicesserialnumberalarm",
        "linkText": {
          "en": "Readme",
          "de": "Reader",
          "ru": "Читать",
          "pt": "Readme",
          "nl": "Lees",
          "fr": "Readme",
          "it": "Readme",
          "es": "Readme",
          "pl": "Ready",
          "zh-cn": "阅读摘要"
        }
      },
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.18.0",
            "newVersion>=3.18.0"
          ]
        },
        "title": {
          "en": "Changes in Smart Home device syncing",
          "de": "Änderungen der Smart Home Gerätesynchronisation",
          "ru": "Изменения в синхронизации устройства Smart Home",
          "pt": "Alterações na sincronização de dispositivos Smart Home",
          "nl": "Veranderingen in Smart Home apparaat",
          "fr": "Changements dans la synchronisation de l'appareil Smart Home",
          "it": "Modifiche nella sincronizzazione dei dispositivi Smart Home",
          "es": "Cambios en la sincronización de dispositivos Smart Home",
          "pl": "Zmiany w Smart Home urządzenie synchronizujące",
          "zh-cn": "Smart家装置的合并变化"
        },
        "text": {
          "en": "Starting with version 3.18.0 smart home device values are no longer synced by default. You need to enable the new state #includeInIntervalQuery existing for each syncable device in the objects in order for the device to be synchronized. Please enable only those that you really need to reduce the requests to Amazon and the Skills and prevent blocking or issues.",
          "de": "Ab Version 3.18.0 werden Smart Home-Gerät-Werte nicht mehr standardmäßig synchronisiert. Der neuen Zustand #includeInInterQuery, der für jedes synchronisierbare Gerät in den Objekten vorhanden ist, muss aktiviert werden um das Gerät zu synchronisieren. Bitte nur diejenigen Geräte aktivieren, die wirklich benötigt werden, um die Anfragen an Amazon und die Skills zu reduzieren und Blockierung oder Probleme zu verhindern.",
          "ru": "Начиная с версии 3.18.0 интеллектуальные ценности домашнего устройства больше не синхронизированы по умолчанию. Вам необходимо включить новое состояние #includeInIntervalQuery существующее для каждого синхронного устройства в объектах, чтобы устройство было синхронизировано. Пожалуйста, включите только те, что вам действительно нужно уменьшить запросы на Amazon и навыки и предотвратить блокировку или проблемы.",
          "pt": "Começando com a versão 3.18.0 os valores de dispositivo doméstico inteligente não são mais sincronizados por padrão. Você precisa ativar o novo estado #includeInIntervalQuery existente para cada dispositivo sincronizável nos objetos para que o dispositivo seja sincronizado. Por favor, ative apenas aqueles que você realmente precisa para reduzir os pedidos para Amazon e as habilidades e evitar bloqueio ou problemas.",
          "nl": "Beginnend met versie 3.18.0 slimme thuis apparatuur is niet meer gesynchroniseerd door defect. Je moet de nieuwe staat in staat stellen includeïntervalQuery die bestaat voor elk syncable apparaat in de objecten om het apparaat te synchroniseren. Betrek alleen degenen die je echt nodig hebt om de verzoeken naar Amazone en de Skills te verminderen en blokkeren of problemen te voorkomen.",
          "fr": "À partir de la version 3.18.0, les valeurs de périphérique à domicile intelligent ne sont plus synchronisées par défaut. Vous devez activer le nouvel état #includeInIntervalQuery existant pour chaque périphérique synchronisé dans les objets afin que le dispositif soit synchronisé. S'il vous plaît activer seulement ceux que vous avez vraiment besoin de réduire les demandes à Amazon et les Compétences et prévenir le blocage ou les problèmes.",
          "it": "A partire dalla versione 3.18.0 i valori dei dispositivi smart home non sono più sincronizzati per impostazione predefinita. È necessario abilitare il nuovo stato #includeInIntervalQuery esistente per ogni dispositivo sincronizzabile negli oggetti in modo che il dispositivo sia sincronizzato. Si prega di attivare solo quelli che è davvero necessario ridurre le richieste a Amazon e le competenze e prevenire il blocco o problemi.",
          "es": "Empezando con la versión 3.18.0, los valores de dispositivo hogar inteligente ya no se sincronizan por defecto. Necesita habilitar el nuevo estado #includeInIntervalQuery existente para cada dispositivo sincronizable en los objetos con el fin de sincronizar el dispositivo. Por favor, active sólo aquellos que realmente necesita para reducir las solicitudes a Amazon y las Habilidades y evitar el bloqueo o problemas.",
          "pl": "Począwszy od wersji 3.18.0, inteligentne urządzenia domowe nie są już zsynchronizowane. Musisz umożliwić nowy stan #include InIntervalQuery istniejące dla każdego urządzenia synchronizującego się w obiektach. Pozwólcie to tylko tym, że musisz zredukować żądania do Amazona i Umiejętności i zapobiegać blokowaniu lub problemom.",
          "zh-cn": "从第3.18.0版的家里装置价值开始,不再因违约而形成。 你们需要使新的国家能够为各物体的每个可核对装置建立新的国家行动目标。 仅请你真正需要减少对亚马逊和技能的要求,并防止阻断或问题。."
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ],
        "link": "https://github.com/Apollon77/ioBroker.alexa2#alexa20echo-devicesserialnumberalarm",
        "linkText": {
          "en": "Readme",
          "de": "Reader",
          "ru": "Читать",
          "pt": "Readme",
          "nl": "Lees",
          "fr": "Readme",
          "it": "Readme",
          "es": "Readme",
          "pl": "Ready",
          "zh-cn": "阅读摘要"
        }
      }
    ]
  },
  "native": {
    "cookie": "",
    "csrf": "",
    "cookieData": null,
    "alexaServiceHost": "",
    "email": "",
    "password": "",
    "userAgent": "",
    "acceptLanguage": "",
    "cookieLoginUrl": "",
    "proxyOwnIp": "",
    "proxyPort": 0,
    "proxyListenBind": "",
    "updateConfigurationInterval": 3600,
    "updateStateInterval": 300,
    "updateHistoryInterval": 300,
    "updateSmartHomeDevicesInterval": 0,
    "usePushConnection": true,
    "proxyOverrideIp": "",
    "resetCookies": false,
    "historyIgnoreEmptySummary": false,
    "macDms": null,
    "includeAppDevices": false,
    "synchronizeLists": true,
    "synchronizeSmartHomeDevices": true
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "If communication with alexa works",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    },
    {
      "_id": "info.cookie",
      "type": "state",
      "common": {
        "role": "text",
        "name": "Alexa Cookie",
        "type": "string",
        "read": true,
        "write": false,
        "def": ""
      },
      "native": {}
    },
    {
      "_id": "info.csrf",
      "type": "state",
      "common": {
        "role": "text",
        "name": "Alexa CSRF",
        "type": "string",
        "read": true,
        "write": false,
        "def": ""
      },
      "native": {}
    }
  ]
}
