{
    "Email": "User/E-mail",
    "Password": "Wachtwoord",
    "Please wait while loading Adapter-Status ...": "Een ogenblik geduld tijdens het laden van de adapter-status ...",
    "ProxyInfo": "Klik <a href=\"%s\" target=\"_blank\">hier om u eenmaal aan te melden bij uw Amazon-account</a> om de verbinding met uw Alexa-apparaten voor deze instantie te activeren.",
    "Settings": "instellingen",
    "StatusInfo": "Alexa-cookies zijn up-to-date en voor het laatst bijgewerkt op %s ",
    "acceptLanguage": "Aangepaste acceptatie-taalkop",
    "alexaLogin": "Alexa-inloggegevens",
    "alexaServiceHost": "Alexa-basis-URL",
    "auth": "Aanmeldgegevens voor Amazon-account waarop Echo-apparaten zijn geregistreerd",
    "auth_info": "De inloggegevens worden gecodeerd opgeslagen in uw lokale instantie ioBroker. Je kunt ze ook leeg laten, maar dan moet je de Amazon-cookie zelf ophalen of de proxy van de adapter gebruiken om in te loggen en de cookie te krijgen.",
    "autoQueryActivityOnTrigger": "Automatisch opvragen van activiteit bij apparaatinteractie",
    "autoQueryActivityOnTrigger_info": "Schakel dit alleen in als u activiteitsinformatie echt automatisch nodig heeft!",
    "bespoken": "Bespoken virtueel apparaat",
    "bespokenToken": "Bespoken Validation Token",
    "bespoken_info": "De virtuele BESACT-apparaten kunnen worden gebruikt om tekstopdrachten naar uw Amazon-account te verzenden en geeft beperkte controle over uw apparaten - indien mogelijk met behulp van gesproken woorden. <br/> <br/> U moet eerst een Bespoken-account en vervolgens een virtueel apparaat maken een Bespoken-token krijgen zoals beschreven op https://read.Bespoken.io/end-toend/setup/. Vervolgens voert u de token hieronder in en ziet u nieuwe objecten voor de adapter. <br/> <br/> Let op: Bespoken maakt een audiobestand van uw tekst en stuurt dit naar de Alexa-API's. Dus de kenniskwaliteit van Alexa is net zo goed als deze spraakgeneratie, dus het kan problematisch zijn met speciale woorden.",
    "cookie": "Cookie",
    "cookieAlt": "Handmatige invoer van de cookie",
    "cookieAlt_info": "De cookie kan ook rechtstreeks worden ingevoerd. E-mail en wachtwoord zijn dan niet vereist",
    "cookieAlt_info2": "Zie b.v. <a href=\"https://www.gehrig.info/alexa/Alexa.html\" target=\"_blank\">hier</a> hoe u een cookie handmatig kunt krijgen of probeer de proxy-modus van de adapter! Zie Foutbericht in logboek voor proxy-URL",
    "cookieLoginUrl": "Aangepaste Cookie-Amazon-URL",
    "device_settings": "Apparaat instellingen",
    "device_settings_info": "Instellingen voor de apparaten die van Amazon worden opgehaald",
    "history": "Geschiedenis instellingen",
    "historyIgnoreEmptySummary": "Negeer geschiedenis-items waar geen commando werd herkend",
    "history_info": "Instellingen voor geschiedenisgegevens die beschikbaar zijn in de status \"History\"",
    "includeAppDevices": "Vraag en voeg ook app-apparaten toe",
    "interval": "Gegevens update-intervallen",
    "interval_info": "Verschillende gegevens kunnen automatisch worden bijgewerkt. Je definieert hier in seconden hoe vaak dit moet gebeuren. Door de # trigger te gebruiken, kunt u de gegevens altijd handmatig bijwerken. Als u 0 instelt als interval, is de automatische update uitgeschakeld.",
    "overwrite": "Speciale parameter voor cookie-bepaling en communicatie overschrijven",
    "overwrite_info": "Standaard zijn de parameters ingesteld om verbinding te maken met een Duits Amazon-account. Als u andere Amazon-landen gebruikt, moet u hier de juiste gegevens instellen. Raadpleeg de README van de adapter voor meer informatie. Ook in bepaalde gevallen waar de automatische cookie-bepaling faalt, kan het helpen om hier te spelen, vooral met Accept-Language en user-agent.",
    "password": "wachtwoord",
    "proxy": "Proxy instellingen",
    "proxyListenBind": "Proxy-binding aan bepaalde IP",
    "proxyOverrideIp": "External Container-IP (Docker)",
    "proxyOwnIp": "Eigen IP of hostnaam om te gebruiken in proxy-koppeling",
    "proxyPort": "Proxy-Port",
    "proxyPort_info": "(0 = willekeurige poort)",
    "proxy_info": "Als de automatische vaststelling van een cookie niet mogelijk is, opent de adapter een proxy om handmatig inloggen bij Amazon mogelijk te maken. Het logbestand geeft u de URL die u vervolgens moet gebruiken. Open dit in uw browser, log handmatig in bij Amazon, los alle mogelijke Captchas of Two-Factor-Authenticaties op en de cookie wordt automatisch in de achtergrond gevangen als het succesvol is.",
    "push_connection": "Push-aansluiting",
    "push_connection_info": "Met de directe verbinding die de veranderingen van de Alexa apparatuur zijn geïnformeerd aan de adapter en worden gebruikt om gegevens te updaten in de echte tijd. Als een aantal data updates beneden niet gebruikt worden. Het is Urgently aanbevolen de persverbinding te gebruiken om de gegevens te beperken van de Amazonewolk!",
    "resetCookie": "Reset Amazon-cookies",
    "s (0 = disabled)": "s (0 = uitgeschakeld)",
    "sync_settings": "Synchronisatie-instellingen",
    "sync_settings_info": "Vermeld welke gegevens moeten worden gesynchroniseerd van de Amazone Cloud naar het ioBroker instance. Bevestig de gegevens die je echt nodig hebt!",
    "synchronizeLists": "Lijsten synchroniseren (bijv. Todo)",
    "synchronizeSmartHomeDevices": "Synchroniseer Smart Home-apparaten",
    "updateConfigurationInterval": "Update-interval apparaatconfiguratie",
    "updateConfigurationInterval_info": "Het apparaat kan automatisch bijgewerkt worden. De update interval definieert hoe vaak dit zou moeten gebeuren. Zet dit niet te laag, want anders blokkeert Amazone je. Het Minimum is 300 of klaar om de update uit te schakelen.",
    "updateHistoryInterval": "Historisch update-interval",
    "updateHistoryInterval_info": "De geschiedenis interval definieert hoe vaak de geschiedenisgegevens moeten worden geüpdateerd van de Amazone servers. Het minimum is 60 of klaar om de update uit te schakelen. Zet dit niet te laag, want anders blokkeert Amazone je. Als de Push-Connectie is vastgesteld dat de update niet gebruikt wordt, omdat informatie het zal activeren als het automatisch nodig is.",
    "updateSmartHomeDevicesInterval": "Update-interval voor Smart Home-apparaten",
    "updateSmartHomeDevicesInterval_info": "Beveel deze interval alleen als je echt de waarden van de slimme thuis apparaten nodig hebt! Alleen de slimme thuis apparaten die includeïnfiltervalQuery geactiveerd in de objecten en actief hun status aan Amazon systemen rapporteren om geen problemen te creëren en kosten aan de ontwikkelaar. Zet dit niet te laag, want anders blokkeert Amazon je. Het Minimum is 900 of set to 0 om de update te ontmantelen.",
    "updateStateInterval": "Gegevensbijwerkingsinterval (Player-Info ...)",
    "updateStateInterval_info": "De algemene apparatuur update bepaalt hoe vaak de gegevens moeten worden geüpload van de Amazone servers. Het minimum is 300 of klaar om de update uit te schakelen. Zet dit niet te laag, want anders blokkeert Amazone je. Als de Push-Connectie is vastgesteld dat de update interval is gestart tot 60 minuten wanneer het in staat is.",
    "usePushConnection": "Gebruik een push-verbinding",
    "userAgent": "Aangepaste User-Agent"
}
