{
    "Email": "User/E-mail",
    "Password": "Wachtwoord",
    "Please wait while loading Adapter-Status ...": "Een ogenblik geduld tijdens het laden van de adapter-status ...",
    "ProxyInfo": "Klik hier om <a href=\"%s\" target=\"_blank\">u één keer aan te melden bij uw Amazon-account</a> om de adapterverbinding met uw Alexa-apparaten te activeren.",
    "Settings": "instellingen",
    "StatusInfo": "Alexa-cookies zijn up-to-date en voor het laatst bijgewerkt op %s ",
    "acceptLanguage": "Aangepaste acceptatie-taalkop",
    "alexaLogin": "Alexa-inloggegevens",
    "alexaServiceHost": "Alexa-basis-URL",
    "auth": "Aanmeldgegevens voor Amazon-account waarop Echo-apparaten zijn geregistreerd",
    "auth_info": "De inloggegevens worden gecodeerd opgeslagen in uw lokale instantie ioBroker. Je kunt ze ook leeg laten, maar dan moet je de Amazon-cookie zelf ophalen of de proxy van de adapter gebruiken om in te loggen en de cookie te krijgen.",
    "bespoken": "Bespoken virtueel apparaat",
    "bespokenToken": "Bespoken Validation Token",
    "bespoken_info": "De virtuele BESACT-apparaten kunnen worden gebruikt om tekstopdrachten naar uw Amazon-account te verzenden en geeft beperkte controle over uw apparaten - indien mogelijk met behulp van gesproken woorden. <br/> <br/> U moet eerst een Bespoken-account en vervolgens een virtueel apparaat maken een Bespoken-token krijgen zoals beschreven op https://read.Bespoken.io/end-toend/setup/. Vervolgens voert u de token hieronder in en ziet u nieuwe objecten voor de adapter. <br/> <br/> Let op: Bespoken maakt een audiobestand van uw tekst en stuurt dit naar de Alexa-API's. Dus de kenniskwaliteit van Alexa is net zo goed als deze spraakgeneratie, dus het kan problematisch zijn met speciale woorden.",
    "cookie": "Cookie",
    "cookieAlt": "Handmatige invoer van de cookie",
    "cookieAlt_info": "De cookie kan ook rechtstreeks worden ingevoerd. E-mail en wachtwoord zijn dan niet vereist",
    "cookieAlt_info2": "Zie b.v. <a href=\"https://www.gehrig.info/alexa/Alexa.html\" target=\"_blank\">hier</a> hoe u een cookie handmatig kunt krijgen of probeer de proxy-modus van de adapter! Zie Foutbericht in logboek voor proxy-URL",
    "cookieLoginUrl": "Aangepaste Cookie-Amazon-URL",
    "history": "Geschiedenis instellingen",
    "historyIgnoreEmptySummary": "Negeer geschiedenis-items waar geen commando werd herkend",
    "history_info": "Instellingen voor geschiedenisgegevens die beschikbaar zijn in de status \"History\"",
    "interval": "Gegevens update-intervallen",
    "interval_info": "Verschillende gegevens kunnen automatisch worden bijgewerkt. Je definieert hier in seconden hoe vaak dit moet gebeuren. Door de # trigger te gebruiken, kunt u de gegevens altijd handmatig bijwerken. Als u 0 instelt als interval, is de automatische update uitgeschakeld.",
    "overwrite": "Speciale parameter voor cookie-bepaling en communicatie overschrijven",
    "overwrite_info": "Standaard zijn de parameters ingesteld om verbinding te maken met een Duits Amazon-account. Als u andere Amazon-landen gebruikt, moet u hier de juiste gegevens instellen. Raadpleeg de README van de adapter voor meer informatie. Ook in bepaalde gevallen waar de automatische cookie-bepaling faalt, kan het helpen om hier te spelen, vooral met Accept-Language en user-agent.",
    "password": "wachtwoord",
    "proxy": "Proxy instellingen",
    "proxyListenBind": "Proxy-binding aan bepaalde IP",
    "proxyOverrideIp": "External Container-IP (Docker)",
    "proxyOwnIp": "Eigen IP of hostnaam om te gebruiken in proxy-koppeling",
    "proxyPort": "Proxy-Port",
    "proxyPort_info": "(0 = willekeurige poort)",
    "proxy_info": "Als de automatische vaststelling van een cookie niet mogelijk is, opent de adapter een proxy om handmatig inloggen bij Amazon mogelijk te maken. Het logbestand geeft u de URL die u vervolgens moet gebruiken. Open dit in uw browser, log handmatig in bij Amazon, los alle mogelijke Captchas of Two-Factor-Authenticaties op en de cookie wordt automatisch in de achtergrond gevangen als het succesvol is.",
    "push_connection": "Push-aansluiting",
    "push_connection_info": "Met de direct push-verbinding worden de wijzigingen van de Echo-apparaten aan de adapter gemeld en worden ze gebruikt om alleen de benodigde gegevens vrijwel in realtime bij te werken. Indien ingeschakeld, worden de onderstaande gegevensupdate-intervallen niet gebruikt.",
    "resetCookie": "Reset Amazon-cookies",
    "s (0 = disabled)": "s (0 = uitgeschakeld)",
    "updateHistoryInterval": "Historisch update-interval",
    "updateStateInterval": "Gegevensbijwerkingsinterval (Player-Info ...)",
    "usePushConnection": "Gebruik een push-verbinding",
    "userAgent": "Aangepaste User-Agent"
}
