{
    "Email": "E-Mail",
    "Password": "Passwort",
    "Please wait while loading Adapter-Status ...": "Der Adapter-Status wird geladen. Bitte warten …",
    "ProxyInfo": "Bitte den folgenden Link zur <a href=\"%s\" target=\"_blank\">einmaligen Anmeldung im Amazon-Konto</a> nutzen, um die Adapterverbindung zu Ihren Alexa-Geräten zu aktivieren.",
    "Settings": "Einstellungen",
    "StatusInfo": "Alexa-Cookies sind aktuell und zuletzt aktualisiert am %s",
    "acceptLanguage": "Eigener Accept-Language-Header",
    "alexaLogin": "Alexa Login Daten",
    "alexaServiceHost": "Alexa Basis URL",
    "auth": "Login-Daten für das Amazon-Konto, in dem die Alexa Geräte registriert sind",
    "auth_info": "Die Login-Daten werden verschlüsselt in der lokalen ioBroker-Instanz gespeichert. Wenn die Daten nicht angegeben werden, muss das Cookie selbst ausgelesen werden oder über den Proxy des Adapters der Login vorgenommen werden, sodass das Cookie ermittelt werden kann. Dies muss aber manuell wiederholt werden sobald der Cookie ungültig geworden ist.",
    "bespoken": "Virtuelles Bespoken Gerät",
    "bespokenToken": "Bespoken Validation Token",
    "bespoken_info": "Die Bespoken Virtual Devices können verwendet werden, um Textbefehle an Ihr Amazon-Konto zu senden und gibt Ihnen eine eingeschränkte Kontrolle über Ihre Geräte - wenn möglich mit gesprochenen Wörtern. <br/> <br/> Sie müssen ein Bespoken-Konto und dann ein virtuelles Gerät erstellen Holen Sie sich ein Bespoken-Token wie unter https://read.Bespoken.io/end-to-end/setup/ beschrieben. Dann geben Sie unten das Token ein und Sie sehen neue Objekte für den Adapter. <br/> <br/> Hinweis: Bespoken erstellt aus Ihrem Text eine Audiodatei und sendet diese an die Alexa-APIs. Also ist die Verständnisqualität von Alexa so gut wie diese Sprachgenerierung, so dass es mit speziellen Wörtern problematisch sein kann.",
    "cookie": "Cookie",
    "cookieAlt": "Manuelle Eingabe des Cookies",
    "cookieAlt_info": "Der Cookie kann auch manuell ermittelt und eingetragen werden. Email & Passwort werden dann nicht benötigt",
    "cookieAlt_info2": "Siehe z.B. <a href=\"https://www.gehrig.info/alexa/Alexa.html\" target=\"_blank\">hier</a> wie ein Cookie manuell ermittelt werden kann, oder den Proxy-Modus des Adapters nutzen. Die Proxy-URL wird in der Fehlermeldung angezeigt.",
    "cookieLoginUrl": "Eigene Cookie-Amazon-URL",
    "history": "Verlaufseinstellungen",
    "historyIgnoreEmptySummary": "Verlaufseinträge ignorieren, wenn kein Befehl erkannt wurde",
    "history_info": "Einstellungen für Verlaufsdaten, die in den \"History\" Zuständen verfügbar sind",
    "interval": "Datenaktualisierungsintervall",
    "interval_info": "Bestimmte Daten können automatisch aktualisiert werden. Wie oft dies passiert, wird hier in Sekunden ferstgelegt. Über den Datenunkt history.#trigger kann jederzeit manuell eine Aktualisierung angestossen werden. Die Angabe von 0 deaktiviert die automatischen Aktualisierungen. ",
    "overwrite": "Überschreiben spezieller Parameter zur Cookie-Ermittlung und Kommunikation",
    "overwrite_info": "Standardmäßig verbindet sich der Adapter mit einem deutschen Amazon-Konto. Bei der Nutzung von Accounts aus anderen Amazon-Ländern müssen hier die korrekten Daten eingetragen werden. Einige Hinweise dazu sind in der Adapter-README zu finden. Auch in speziellen Fällen, wenn die automatische Cookie-Ermittlung fehlschlägt, kann es helfen die Felder User-Agent und Accept-Language anzupassen.",
    "password": "Passwort",
    "proxy": "Proxy-Einstellungen",
    "proxyListenBind": "Proxy-Beschränkung auf folgende IP (Listen Bind)",
    "proxyOverrideIp": "Externe Container-IP (Docker)",
    "proxyOwnIp": "Eigene IP oder Hostname für den Proxy-Link",
    "proxyPort": "Proxy-Port",
    "proxyPort_info": "(0 = zufälliger Port)",
    "proxy_info": "Wenn die automatische Cookie-Ermittlung nicht funktioniert öffnet der Adapter einen Proxy um einen manuellen Login zu erlauben. Das Logfile und die Admin-Seite zeigt in dem Fall den aufzurufenden Link an. Diese mit dem Browser aufrufen, bei Amazon einloggen, alle potentiell angezeigten Captchas und Zwei-Faktor-Abfragen beantworten und das Cookie wird bei Erfolg im Hintergrund automatisch ermittelt.",
    "push_connection": "Push-Verbindung",
    "push_connection_info": "Bei der direkten Push-Verbindung werden die Änderungen der Alexa-Geräte dem Adapter direkt übermittelt und dienen dazu, nur benötigte Daten nahezu in Echtzeit zu aktualisieren. Wenn aktiviert, werden die Datenaktualisierungsintervalle unten nicht genutzt.",
    "resetCookie": "Amazon-Cookies zurücksetzen",
    "s (0 = disabled)": "s (0 = deaktiviert)",
    "updateHistoryInterval": "History-Aktualisierungsintervall",
    "updateStateInterval": "Datenaktualisierungsinterval (Player-Info ...)",
    "usePushConnection": "Push-Verbindung verwenden",
    "userAgent": "Eigener User-Agent"
}
