{
    "Email": "Електронна пошта",
    "Password": "Пароль",
    "Please wait while loading Adapter-Status ...": "Зачекайте, поки завантажується статус адаптера…",
    "ProxyInfo": "Клацніть <a href=\"%s\" target=\"_blank\">тут, щоб один раз увійти у свій обліковий запис Amazon</a>, щоб активувати підключення до ваших пристроїв Alexa для цього випадку.",
    "Settings": "Налаштування",
    "StatusInfo": "Файли cookie Alexa оновлені та останнє оновлення %s",
    "acceptLanguage": "Спеціальний заголовок прийнятної мови",
    "alexaLogin": "Дані для входу в Alexa",
    "alexaServiceHost": "URL-адреса бази Alexa",
    "auth": "Деталі входу в обліковий запис Amazon, де зареєстровані ваші пристрої Alexa",
    "auth_info": "Облікові дані зберігатимуться в зашифрованому вигляді у вашому локальному екземплярі ioBroker. Ви також можете залишити їх порожніми, але тоді вам потрібно буде отримати файл cookie Amazon самостійно або використати проксі-сервер з адаптера, щоб увійти та отримати файл cookie.",
    "autoQueryActivityOnTrigger": "Автоматично надсилайте запит щодо взаємодії з пристроєм",
    "autoQueryActivityOnTrigger_info": "Увімкніть, лише якщо вам дійсно потрібна інформація про активність автоматично!",
    "bespoken": "Віртуальний пристрій на замовлення",
    "bespokenToken": "Індивідуальний маркер перевірки",
    "bespoken_info": "Віртуальні пристрої Bespoken можна використовувати для надсилання текстових команд до вашого облікового запису Amazon і надають обмежений контроль над вашими пристроями, якщо це можливо, за допомогою голосових слів.<br/><br/>Вам потрібно створити обліковий запис Bespoken, а потім віртуальний пристрій, щоб отримати Bespoken Token, як описано на https://read.Bespoken.io/end-to-end/setup/. Потім ви вводите маркер нижче, і ви побачите нові об’єкти для адаптера.<br/><br/>Зверніть увагу: Bespoken створює аудіофайл із вашого тексту та надсилає його до Alexa-API. Таким чином, якість розуміння Alexa така ж хороша, як і це покоління мовлення, тому це може бути проблематично зі спеціальними словами.",
    "cookie": "Печиво",
    "cookieAlt": "Ручне введення cookie",
    "cookieAlt_info": "Файл cookie також можна ввести безпосередньо. Електронна пошта та пароль тоді не потрібні",
    "cookieAlt_info2": "див. напр. <a href=\"https://www.gehrig.info/alexa/Alexa.html\" target=\"_blank\">тут</a> як отримати файл cookie вручну або спробуйте режим проксі адаптера! Перегляньте повідомлення про помилку в журналі для URL-адреси проксі-сервера.",
    "cookieLoginUrl": "Користувацька URL-адреса файлів cookie Amazon",
    "device_settings": "Налаштування пристрою",
    "device_settings_info": "Налаштування для пристроїв, отриманих з Amazon",
    "history": "Налаштування історії",
    "historyIgnoreEmptySummary": "Ігнорувати записи історії, якщо жодна команда не була розпізнана",
    "history_info": "Налаштування для даних історії, доступних у станах «Історія».",
    "includeAppDevices": "Зробіть запит і додайте також App-Devices",
    "interval": "Інтервал оновлення даних",
    "interval_info": "Деякі дані можуть оновлюватися автоматично. Ви визначаєте тут за секунди, як часто це має відбуватися. Використовуючи історію стану.#trigger, ви завжди можете оновити дані вручну. Якщо ви встановите 0 як інтервал, автоматичне оновлення буде вимкнено.",
    "overwrite": "Перевизначити спеціальний параметр для визначення та передачі файлів cookie",
    "overwrite_info": "За замовчуванням параметри встановлені для підключення до німецького облікового запису Amazon. Якщо ваш обліковий запис знаходиться в іншій країні Amazon, вам потрібно ввести тут правильні дані. Перевірте файл README адаптера, щоб отримати деякі відомості. Крім того, у деяких випадках, коли автоматичне визначення файлів cookie не вдається, може допомогти пограти тут, особливо з налаштуваннями Accept-Language і user-agent.",
    "password": "Пароль",
    "proxy": "Налаштування проксі",
    "proxyListenBind": "Прив'язка проксі до певного IP",
    "proxyOverrideIp": "Зовнішній контейнер-IP (Docker)",
    "proxyOwnIp": "Власна IP-адреса або ім’я хоста для використання в проксі-посиланні",
    "proxyPort": "Проксі-порт",
    "proxyPort_info": "(0 = випадковий порт)",
    "proxy_info": "Якщо автоматичне визначення файлу cookie неможливо, адаптер відкриває проксі, щоб дозволити ручний вхід в amazon. Екран журналу та адміністратора підкаже URL-адресу для використання. Відкрийте це у своєму браузері, увійдіть в Amazon вручну, виконайте всі потенційні Captcha або двофакторну автентифікацію, і файл cookie буде перехоплено автоматично у фоновому режимі, якщо це вдасться.",
    "push_connection": "Push-Connection",
    "push_connection_info": "За допомогою прямого push-з’єднання про зміни з пристроїв Alexa повідомляється адаптер і використовується для оновлення лише необхідних даних майже в реальному часі. Якщо ввімкнено, деякі наведені нижче інтервали оновлення даних не використовуються. Настійно рекомендується використовувати push-з’єднання, щоб обмежити дані, які запитуються з хмари Amazon!",
    "resetCookie": "Скинути файли cookie Amazon",
    "s (0 = disabled)": "s (0 = вимкнено)",
    "sync_settings": "Параметри синхронізації",
    "sync_settings_info": "Укажіть, які дані потрібно синхронізувати з Amazon Cloud до екземпляра ioBroker. Увімкніть лише ті дані, які вам дійсно потрібні!",
    "synchronizeLists": "Синхронізація списків (наприклад, Todo)",
    "synchronizeSmartHomeDevices": "Синхронізація пристроїв Smart Home",
    "updateConfigurationInterval": "Інтервал оновлення конфігурації пристрою",
    "updateConfigurationInterval_info": "Конфігурацію пристрою можна оновлювати автоматично. Інтервал оновлення визначає, як часто це має відбуватися. Не встановлюйте це значення занадто низько, інакше Amazon може вас заблокувати! Мінімум становить 300 с або встановіть 0, щоб вимкнути оновлення.",
    "updateHistoryInterval": "Інтервал оновлення історії",
    "updateHistoryInterval_info": "Інтервал оновлення історії визначає частоту оновлення даних історії із серверів Amazon. Мінімум становить 60 с або встановіть 0, щоб вимкнути оновлення. Не встановлюйте це значення занадто низько, інакше Amazon може вас заблокувати! Коли встановлюється Push-Connection, інтервал оновлення не використовується, оскільки push-інформація активує його за потреби автоматично.",
    "updateSmartHomeDevicesInterval": "Інтервал оновлення пристроїв Smart Home",
    "updateSmartHomeDevicesInterval_info": "Увімкніть цей інтервал, лише якщо вам дійсно потрібні значення пристроїв розумного дому! Оновлюються лише ті розумні домашні пристрої, які мають активований #includeInIntervalQuery в об’єктах і активно повідомляють про свій статус системам Amazon, щоб переконатися, що не створюють проблем і витрат на стороні розробника навичок! Не встановлюйте це значення занадто низько, інакше Amazon може вас заблокувати! Мінімум становить 900 с або встановіть значення 0, щоб вимкнути оновлення (можна запустити вручну за допомогою станів #query).",
    "updateStateInterval": "Інтервал оновлення даних (інформація про гравця…)",
    "updateStateInterval_info": "Загальний інтервал оновлення даних пристрою визначає частоту оновлення даних із серверів Amazon. Мінімум становить 300 с або встановіть 0, щоб вимкнути оновлення. Не встановлюйте це значення занадто низько, інакше Amazon може вас заблокувати! Коли Push-Connection встановлено, інтервал оновлення встановлюється на 60 хвилин, якщо ввімкнено.",
    "usePushConnection": "Використовуйте push-з'єднання",
    "userAgent": "Спеціальний агент користувача"
}
