{
    "Email": "Użytkownik/Email",
    "Password": "Hasło",
    "Please wait while loading Adapter-Status ...": "Poczekaj na załadowanie statusu adaptera ...",
    "ProxyInfo": "Kliknij tutaj, aby <a href=\"%s\" target=\"_blank\">zalogować się do konta Amazon raz,</a> aby aktywować połączenie adaptera z urządzeniami Alexa.",
    "Settings": "Ustawienia",
    "StatusInfo": "Alexa-Cookies są aktualne i ostatnio aktualizowane w %s ",
    "acceptLanguage": "Niestandardowy nagłówek Accept-Language",
    "alexaLogin": "Dane logowania Alexa",
    "alexaServiceHost": "Adres bazowy Alexa",
    "auth": "Dane logowania do konta Amazon, w którym zarejestrowane są urządzenia Echo",
    "auth_info": "Dane uwierzytelniające będą przechowywane w postaci zaszyfrowanej w lokalnej instancji ioBroker. Możesz również pozostawić je puste, ale musisz pobrać plik cookie Amazon samodzielnie lub użyć proxy z adaptera, aby się zalogować i uzyskać plik cookie.",
    "bespoken": "Wirtualne urządzenie Bespoken",
    "bespokenToken": "Bespoken Validation Token",
    "bespoken_info": "Urządzenia wirtualne Bespoken mogą być używane do wysyłania poleceń tekstowych do konta Amazon i dają ograniczoną kontrolę nad urządzeniami - w miarę możliwości za pomocą wypowiadanych słów. <br/> <br/> Musisz utworzyć konto Bespoken, a następnie urządzenie wirtualne do zdobądź token Bespoken zgodnie z opisem na https://read.Bespoken.io/end-to-end/setup/. Następnie wpisz poniższy token, a zobaczysz nowe obiekty dla adaptera. <br/> <br/> Uwaga: Bespoken tworzy plik audio poza tekstem i wysyła go do Alexa-API. Zatem jakość rozumienia Alexy jest tak dobra, jak ta generacja mowy, więc może być problematyczne w przypadku specjalnych słów.",
    "cookie": "Cookie",
    "cookieAlt": "Ręczne wprowadzanie pliku cookie",
    "cookieAlt_info": "Plik cookie można również wprowadzić bezpośrednio. Email i hasło nie są wtedy wymagane",
    "cookieAlt_info2": "Zobacz np. <a href=\"https://www.gehrig.info/alexa/Alexa.html\" target=\"_blank\">tutaj</a>, jak uzyskać ciasteczko ręcznie lub wypróbować tryb proxy adaptera! Zobacz komunikat o błędzie w dzienniku dla adresu URL proxy",
    "cookieLoginUrl": "Niestandardowy plik cookie-Amazon-URL",
    "history": "Ustawienia historii",
    "historyIgnoreEmptySummary": "Ignoruj wpisy historii, w których nie rozpoznano żadnego polecenia",
    "history_info": "Ustawienia danych historii, które są dostępne w stanach „History”",
    "interval": "Interwały aktualizacji danych",
    "interval_info": "Kilka danych może być automatycznie aktualizowanych. Tutaj określasz w sekundach, jak często powinno to mieć miejsce. Korzystając z historii stanów. # Trigger zawsze możesz zaktualizować dane ręcznie. Jeśli ustawisz 0 jako interwał, aktualizacja automatyczna zostanie wyłączona.",
    "overwrite": "Zastąp specjalny parametr do określania i komunikacji plików cookie",
    "overwrite_info": "Domyślnie parametry są ustawione na połączenie z niemieckim kontem Amazon. Jeśli korzystasz z innych krajów amazon, musisz ustawić poprawne dane tutaj. Sprawdź w pliku README na temat niektórych szczegółów. Również w niektórych przypadkach, gdy automatyczne określanie ciasteczek zawodzi, może pomóc w zabawie, szczególnie w Accept-Language i user-agent.",
    "password": "hasło",
    "proxy": "Ustawienia proxy",
    "proxyListenBind": "Wiązanie proxy do określonego adresu IP",
    "proxyOverrideIp": "Zewnętrzny kontener-IP (Docker)",
    "proxyOwnIp": "Własny adres IP lub nazwa hosta do użycia w łączu proxy",
    "proxyPort": "Port proxy",
    "proxyPort_info": "(0 = losowy port)",
    "proxy_info": "Jeśli automatyczne określenie pliku cookie nie jest możliwe, adapter otwiera proxy, aby umożliwić ręczne logowanie do Amazon. Logfile wskaże ci adres URL, którego będziesz używał. Otwórz to w przeglądarce, ręcznie zaloguj się do Amazon, rozwiąż wszystkie potencjalne Captchas lub uwierzytelnienia dwuetapowe, a ciasteczko zostanie automatycznie przechwycone w tle, jeśli się powiedzie.",
    "push_connection": "Push-Connection",
    "push_connection_info": "Dzięki bezpośredniemu połączeniu push, zmiany z urządzeń Echo są wysyłane do adaptera i służą do aktualizacji tylko potrzebnych danych w czasie zbliżonym do rzeczywistego. Jeśli jest włączona, nie są używane poniższe przedziały czasu aktualizacji danych.",
    "resetCookie": "Zresetuj ciasteczka Amazon",
    "s (0 = disabled)": "s (0 = wyłączone)",
    "updateHistoryInterval": "Interwał aktualizacji historii",
    "updateStateInterval": "Interwał aktualizacji danych (Player-Info ...)",
    "usePushConnection": "Użyj połączenia push",
    "userAgent": "Niestandardowy User-Agent"
}
