{
    "Email": "Пользователь/Email",
    "Password": "пароль",
    "Please wait while loading Adapter-Status ...": "Пожалуйста, подождите, пока загружается Adapter-Status ...",
    "ProxyInfo": "Пожалуйста, нажмите здесь, чтобы <a href=\"%s\" target=\"_blank\">войти в свою учетную запись Amazon один раз,</a> чтобы активировать подключение адаптера к вашим устройствам Alexa.",
    "Settings": "настройки",
    "StatusInfo": "Alexa-Cookies обновлены и обновлены до %s ",
    "acceptLanguage": "Пользовательский заголовок Accept-Language",
    "alexaLogin": "Входные данные Alexa",
    "alexaServiceHost": "Alexa base url",
    "auth": "Детали входа для учетной записи Amazon, на которой зарегистрированы устройства Echo",
    "auth_info": "Учетные данные будут храниться зашифрованными в вашем локальном экземпляре ioBroker. Вы также можете оставить их пустыми, но затем вам нужно получить cookie Amazon самостоятельно или использовать прокси-сервер от адаптера для входа в систему и получить файл cookie.",
    "bespoken": "Виртуальное устройство Bespoken",
    "bespokenToken": "Bespoken Validation Token",
    "bespoken_info": "Виртуальные устройства Bespoken можно использовать для отправки текстовых команд на вашу учетную запись Amazon и дает ограниченный контроль над вашими Устройствами - по возможности используя произносимые слова. <br/> <br/> Вам нужно создать учетную запись Bespoken, а затем виртуальное устройство для получить токен Bespoken, как описано на https://read.Bespoken.io/end-to-end/setup/. Затем вы вводите токен ниже, и вы увидите новые объекты для адаптера. <br/> <br/> Обратите внимание: Bespoken создает аудиофайл из вашего текста и отправляет его в Alexa-API. Таким образом, качество понимания Alexa так же хорошо, как и это поколение речи, поэтому это может быть проблематично со специальными словами.",
    "cookie": "Cookie",
    "cookieAlt": "Ручной ввод файла cookie",
    "cookieAlt_info": "Файл cookie также можно ввести напрямую. Электронная почта и пароль не требуются.",
    "cookieAlt_info2": "См. <a href=\"https://www.gehrig.info/alexa/Alexa.html\" target=\"_blank\">здесь</a>, как получить файл cookie вручную или попробовать прокси-режим адаптера! См. Сообщение об ошибке в журнале для URL-адреса прокси-сервера",
    "cookieLoginUrl": "Пользовательский URL-адрес Cookie-Amazon",
    "history": "Настройки истории",
    "historyIgnoreEmptySummary": "Игнорировать записи истории, в которых не была распознана команда",
    "history_info": "Настройки для данных истории, которые доступны в состояниях \"History\"",
    "interval": "Интервалы обновления данных",
    "interval_info": "Несколько данных могут автоматически обновляться. Вы определяете здесь в секундах, как часто это должно произойти. Используя историю состояний. # Триггер, вы всегда можете обновлять данные вручную. Если вы установите 0 как интервал, автоматическое обновление отключено.",
    "overwrite": "Переопределить специальный параметр для определения и связи файлов cookie",
    "overwrite_info": "По умолчанию для параметров установлено соединение с немецкой учетной записью amazon. Если вы используете другие страны амазонки, вам нужно установить правильные данные здесь. За дополнительной информацией обратитесь к адаптеру README. Также в некоторых случаях, когда автоматическая дефрагментация файлов cookie не работает, она может помочь здесь играть особенно с Accept-Language и user-agent.",
    "password": "пароль",
    "proxy": "Настройки прокси",
    "proxyListenBind": "Связывание прокси-сервера с определенным IP-адресом",
    "proxyOverrideIp": "Внешний контейнер-IP (Docker)",
    "proxyOwnIp": "Собственный IP-адрес или имя хоста для использования в прокси-ссылке",
    "proxyPort": "Порт прокси",
    "proxyPort_info": "(0 = случайный порт)",
    "proxy_info": "Если автоматическое определение файла cookie не позволяет адаптеру открыть прокси-сервер, чтобы разрешить вход в систему вручную для амазонки. Затем в файле журнала будет указан URL-адрес. Откройте это в своем браузере, вручную войдите в Amazon, разрешите все потенциальные Captchas или Two-Factor-Authentication, и cookie автоматически зацепится в фоновом режиме, если успешно.",
    "push_connection": "Push-соединение",
    "push_connection_info": "При прямом push-соединении изменения с Echo-устройств сообщаются адаптеру и используются для обновления только необходимых данных в режиме реального времени. Если включено, интервалы обновления данных ниже не используются.",
    "resetCookie": "Сброс Amazon Cookies",
    "s (0 = disabled)": "сек (0 = отключено)",
    "updateHistoryInterval": "Интервал обновления истории",
    "updateStateInterval": "Интервал обновления данных (информация плеера ...)",
    "usePushConnection": "Использовать push-соединение",
    "userAgent": "Пользовательский User-Agent"
}
