{
    "Email": "Пользователь/Email",
    "Password": "Пароль",
    "Please wait while loading Adapter-Status ...": "Пожалуйста, подождите, пока загружается Adapter-Status ...",
    "ProxyInfo": "Нажмите <a href=\"%s\" target=\"_blank\">здесь, чтобы войти в свою учетную запись Amazon один раз</a>, чтобы активировать подключение к вашим устройствам Alexa для этого экземпляра.",
    "Settings": "Настройки",
    "StatusInfo": "Alexa-Cookies обновлены и обновлены до %s ",
    "acceptLanguage": "Пользовательский заголовок Accept-Language",
    "alexaLogin": "Входные данные Alexa",
    "alexaServiceHost": "Alexa base url",
    "auth": "Детали входа для учетной записи Amazon, на которой зарегистрированы устройства Echo",
    "auth_info": "Учетные данные будут храниться зашифрованными в вашем локальном экземпляре ioBroker. Вы также можете оставить их пустыми, но затем вам нужно получить cookie Amazon самостоятельно или использовать прокси-сервер от адаптера для входа в систему и получить файл cookie.",
    "autoQueryActivityOnTrigger": "Автоматически запрашивать активность при взаимодействии с устройством",
    "autoQueryActivityOnTrigger_info": "Пожалуйста, включайте эту функцию только в том случае, если вам действительно нужна автоматическая информация об активности!",
    "bespoken": "Виртуальное устройство Bespoken",
    "bespokenToken": "Bespoken Validation Token",
    "bespoken_info": "Виртуальные устройства Bespoken можно использовать для отправки текстовых команд на вашу учетную запись Amazon и дает ограниченный контроль над вашими Устройствами - по возможности используя произносимые слова. <br/> <br/> Вам нужно создать учетную запись Bespoken, а затем виртуальное устройство для получить токен Bespoken, как описано на https://read.Bespoken.io/end-to-end/setup/. Затем вы вводите токен ниже, и вы увидите новые объекты для адаптера. <br/> <br/> Обратите внимание: Bespoken создает аудиофайл из вашего текста и отправляет его в Alexa-API. Таким образом, качество понимания Alexa так же хорошо, как и это поколение речи, поэтому это может быть проблематично со специальными словами.",
    "cookie": "Cookie",
    "cookieAlt": "Ручной ввод файла cookie",
    "cookieAlt_info": "Файл cookie также можно ввести напрямую. Электронная почта и пароль не требуются.",
    "cookieAlt_info2": "",
    "cookieLoginUrl": "Пользовательский URL-адрес Cookie-Amazon",
    "device_settings": "Настройки устройства",
    "device_settings_info": "Настройки для устройств, которые извлекаются из Amazon",
    "history": "Настройки истории",
    "historyIgnoreEmptySummary": "Игнорировать записи истории, в которых не была распознана команда",
    "history_info": "Настройки для данных истории, которые доступны в состояниях \"History\"",
    "includeAppDevices": "Запросите и добавьте также App-Devices",
    "interval": "Интервалы обновления данных",
    "interval_info": "Несколько данных могут автоматически обновляться. Вы определяете здесь в секундах, как часто это должно произойти. Используя историю состояний. # Триггер, вы всегда можете обновлять данные вручную. Если вы установите 0 как интервал, автоматическое обновление отключено.",
    "overwrite": "Переопределить специальный параметр для определения и связи файлов cookie",
    "overwrite_info": "По умолчанию для параметров установлено соединение с немецкой учетной записью amazon. Если вы используете другие страны амазонки, вам нужно установить правильные данные здесь. За дополнительной информацией обратитесь к адаптеру README. Также в некоторых случаях, когда автоматическая дефрагментация файлов cookie не работает, она может помочь здесь играть особенно с Accept-Language и user-agent.",
    "password": "Пароль",
    "proxy": "Настройки прокси",
    "proxyListenBind": "Связывание прокси-сервера с определенным IP-адресом",
    "proxyOverrideIp": "Внешний контейнер-IP (Docker)",
    "proxyOwnIp": "Собственный IP-адрес или имя хоста для использования в прокси-ссылке",
    "proxyPort": "Порт прокси",
    "proxyPort_info": "(0 = случайный порт)",
    "proxy_info": "Если автоматическое определение файла cookie не позволяет адаптеру открыть прокси-сервер, чтобы разрешить вход в систему вручную для амазонки. Затем в файле журнала будет указан URL-адрес. Откройте это в своем браузере, вручную войдите в Amazon, разрешите все потенциальные Captchas или Two-Factor-Authentication, и cookie автоматически зацепится в фоновом режиме, если успешно.",
    "push_connection": "Push-соединение",
    "push_connection_info": "При прямом подключении к адаптеру оповещены изменения устройств Alexa и используются для обновления только необходимых данных в ближайшем режиме реального времени. Если включены некоторые интервалы обновления данных ниже не используются. Срочно рекомендуется использовать push-соединение для ограничения данных, запрашиваемых из облака amazon!",
    "resetCookie": "Сброс Amazon Cookies",
    "s (0 = disabled)": "сек (0 = отключено)",
    "sync_settings": "Настройки синхронизации",
    "sync_settings_info": "Укажите, какие данные должны быть синхронизированы из Amazon Cloud в экземпляр ioBroker. Пожалуйста, включите данные, которые вам действительно нужны!",
    "synchronizeLists": "Синхронизируйте списки (например, Todo)",
    "synchronizeSmartHomeDevices": "Синхронизируйте устройства умного дома",
    "updateConfigurationInterval": "Интервал обновления конфигурации устройства",
    "updateConfigurationInterval_info": "Конфигурация устройства может обновляться автоматически. Интервал обновления определяет, как часто это должно произойти. Не устанавливайте это слишком низко, потому что другой Amazon может заблокировать вас! Минимум 300-х или настроен на 0, чтобы отключить обновление.",
    "updateHistoryInterval": "Интервал обновления истории",
    "updateHistoryInterval_info": "Интервал обновления истории определяет, как часто данные истории должны быть обновлены с серверов Amazon. Минимум 60-х или установлен 0, чтобы отключить обновление. Не устанавливайте это слишком низко, потому что другой Amazon может заблокировать вас! Когда Push-Connection установлен интервал обновления не используется, потому что нажмите информацию будет триггер при необходимости автоматически.",
    "updateSmartHomeDevicesInterval": "Интервал обновления устройств «Умный дом»",
    "updateSmartHomeDevicesInterval_info": "Пожалуйста, включите этот интервал только если вам действительно нужны значения умных домашних устройств! Только умные домашние устройства, которые имеют #includeInIntervalQuery активированы в объектах и активно сообщают о своем статусе в системы Amazon, обновляются, чтобы не создавать проблемы и затраты на стороне разработчика мастерства! Не устанавливайте это слишком низко, потому что другой Amazon может заблокировать вас! Минимум 900s или установлено на 0, чтобы отключить обновление (может быть спрошен вручную через #query состояния).",
    "updateStateInterval": "Интервал обновления данных (информация плеера ...)",
    "updateStateInterval_info": "Интервал обновления данных общего устройства определяет, как часто данные должны быть обновлены с серверов Amazon. Минимум 300-х или установлен 0, чтобы отключить обновление. Не устанавливайте это слишком низко, потому что другой Amazon может заблокировать вас! Когда Push-Connection установлен интервал обновления устанавливается до 60 минут при включенном.",
    "usePushConnection": "Использовать push-соединение",
    "userAgent": "Пользовательский User-Agent"
}
