{
    "Email": "E-mail",
    "Password": "Senha",
    "Please wait while loading Adapter-Status ...": "Por favor, aguarde enquanto carrega o estado do adaptador …",
    "ProxyInfo": "Clique <a href=\"%s\" target=\"_blank\">aqui para fazer login em sua conta Amazon</a> para ativar a conexão com seus dispositivos Alexa para esta instância.",
    "Settings": "Configurações",
    "StatusInfo": "Os cookies da Alexa são atuais e foram atualizados pela última vez em %s",
    "acceptLanguage": "Próprio Accept-Language-Header",
    "alexaLogin": "Dados de login para Alexa",
    "alexaServiceHost": "URL básico da Alexa",
    "auth": "Dados de login para a conta da Amazon na qual os dispositivos da Alexa estão registrados",
    "auth_info": "Os dados de login serão armazenados criptografados na instância local do ioBroker. Se os dados não forem especificados, o próprio cookie deve ser lido ou o login deve ser realizado através do proxy do adaptador para que o cookie possa ser determinado. No entanto, isso deve ser repetido manualmente assim que o cookie se tornar inválido.",
    "autoQueryActivityOnTrigger": "Consultar automaticamente a atividade na interação do dispositivo",
    "autoQueryActivityOnTrigger_info": "Ative apenas se você realmente precisar de informações de atividades automaticamente!",
    "bespoken": "Dispositivo virtual Bespoken",
    "bespokenToken": "Token de validação para Bespoken",
    "bespoken_info": "Os Dispositivos Virtuais da Bespoken podem ser usados ​​para enviar comandos de texto para sua Conta da Amazon e fornecer controle limitado sobre seus Dispositivos - quando possível, usando palavras faladas. <br/> <br/> Você precisa criar uma Conta Bespoken e, em seguida, um Dispositivo Virtual para obtenha um Token Bespoken conforme descrito em https://read.Bespoken.io/end-to-end/setup/. Em seguida, você insere o token abaixo e verá novos objetos para o adaptador. <br/> <br/> Observação: Bespoken cria um arquivo de áudio com o texto e o envia para as APIs do Alexa. Portanto, a qualidade de compreensão do Alexa é tão boa quanto essa geração de fala, por isso pode ser problemático com palavras especiais.",
    "cookie": "Biscoito",
    "cookieAlt": "Entrada manual do cookie",
    "cookieAlt_info": "O cookie também pode ser inserido diretamente. E-mail e senha não são necessários",
    "cookieAlt_info2": "Veja por exemplo <a href=\"https://www.gehrig.info/alexa/Alexa.html\" target=\"_blank\">aqui</a> como obter um cookie manualmente ou experimentar o modo proxy do adaptador! Consulte a mensagem de erro no log de URL do proxy",
    "cookieLoginUrl": "Cookie personalizado-Amazon-URL",
    "device_settings": "Configurações do dispositivo",
    "device_settings_info": "Configurações para os dispositivos que são buscados na Amazon",
    "history": "Configurações de histórico",
    "historyIgnoreEmptySummary": "Ignorar entradas de histórico onde nenhum comando foi reconhecido",
    "history_info": "Configurações para dados de histórico que estão disponíveis nos estados \"History\"",
    "includeAppDevices": "Consulte e adicione também App-Devices",
    "interval": "Intervalos de atualização de dados",
    "interval_info": "Vários dados podem ser atualizados automaticamente. Você define aqui em segundos quantas vezes isso deve acontecer. Usando o histórico de estados. # Trigger, você sempre pode atualizar os dados manualmente. Se você definir 0 como intervalo, a atualização automática será desativada.",
    "overwrite": "Substituir parâmetro especial para determinação e comunicação de cookies",
    "overwrite_info": "Por padrão, os parâmetros são configurados para se conectar a uma conta da Amazon na Alemanha. Se você estiver usando outros países amazônicos, precisará definir os dados corretos aqui. Verifique no Adaptador README para alguns detalhes. Também em certos casos, quando a determinação automática de cookies está falhando, pode ajudar a brincar aqui, especialmente com Accept-Language e user-agent.",
    "password": "Senha",
    "proxy": "Configurações de proxy",
    "proxyListenBind": "Ligação Proxy a determinados IPs",
    "proxyOverrideIp": "Container-IP Externo (Docker)",
    "proxyOwnIp": "IP ou nome de host próprio para usar no link do proxy",
    "proxyPort": "Porta proxy",
    "proxyPort_info": "(0 = porta aleatória)",
    "proxy_info": "Se a determinação automática de um cookie não for capaz, o adaptador abre um proxy para permitir um login manual na amazon. O arquivo de registro irá dizer-lhe o URL para usar então. Abra isso no seu navegador, faça login manualmente na Amazon, resolva todos os Captchas ou Autenticações de dois fatores em potencial e o cookie será capturado em segundo plano automaticamente se for bem-sucedido.",
    "push_connection": "Conexão Push",
    "push_connection_info": "Com a conexão de push direta, as alterações dos dispositivos Alexa são notificadas ao adaptador e são usadas para atualizar apenas dados necessários em tempo real. Se ativado alguns intervalos de atualização de dados abaixo não são usados. Recomenda-se urgentemente usar a conexão de push para limitar os dados solicitados da nuvem de amazon!",
    "resetCookie": "Redefinir cookies da Amazon",
    "s (0 = disabled)": "s (0 = desativado)",
    "sync_settings": "Configurações de sincronização",
    "sync_settings_info": "Especifique quais dados devem ser sincronizados da Amazon Cloud para a instância do ioBroker. Por favor, apenas ative os dados que você realmente precisa!",
    "synchronizeLists": "Sincronizar listas (por exemplo, Todo)",
    "synchronizeSmartHomeDevices": "Sincronizar dispositivos de casa inteligente",
    "updateConfigurationInterval": "Intervalo de atualização da configuração do dispositivo",
    "updateConfigurationInterval_info": "A configuração do dispositivo pode ser atualizada automaticamente. O intervalo de atualização define com que frequência isso deve acontecer. Não coloque isso muito baixo porque a Amazon pode bloquear você! O Mínimo é de 3300 ou definido para 0 para desativar a atualização.",
    "updateHistoryInterval": "Intervalo de atualização do histórico",
    "updateHistoryInterval_info": "O intervalo de atualização de História define com que frequência os dados de História devem ser atualizados a partir dos servidores da Amazon. O mínimo é 60s ou definido para 0 para desativar a atualização. Não coloque isso muito baixo porque a Amazon pode bloquear você! Quando o Push-Connection é estabelecido o intervalo de atualização não é usado porque a informação do push irá acioná-lo quando necessário automaticamente.",
    "updateSmartHomeDevicesInterval": "Intervalo de atualização dos dispositivos Smart Home",
    "updateSmartHomeDevicesInterval_info": "Por favor, ative este intervalo apenas se você realmente precisar dos valores dos dispositivos domésticos inteligentes! Apenas os dispositivos domésticos inteligentes que têm #includeInIntervalQuery ativado nos objetos e relatar ativamente seu status para sistemas Amazon são atualizados para se certificar de não criar problemas e custos no lado desenvolvedor de habilidades! Não coloque isso muito baixo porque a Amazon pode bloquear você! O Mínimo é de 900 ou definido para 0 para desativar a atualização (pode ser acionado manualmente via #query states).",
    "updateStateInterval": "Intervalo de atualização de dados (informações do player ...)",
    "updateStateInterval_info": "O intervalo geral de atualização de dados do dispositivo define com que frequência os dados devem ser atualizados a partir dos servidores da Amazon. O mínimo é 300s ou definido para 0 para desativar a atualização. Não coloque isso muito baixo porque a Amazon pode bloquear você! Quando o Push-Connection é estabelecido o intervalo de atualização é definido para 60 minutos quando ativado.",
    "usePushConnection": "Use conexão push",
    "userAgent": "Custom User-Agent"
}
