{
    "Email": "Usuário/E-mail",
    "Password": "Senha",
    "Please wait while loading Adapter-Status ...": "Por favor, aguarde enquanto carrega o Adapter-Status ...",
    "ProxyInfo": "Clique aqui para <a href=\"%s\" target=\"_blank\">fazer login na sua conta Amazon uma vez</a> para ativar a conexão do adaptador aos seus dispositivos Alexa.",
    "Settings": "Configurações",
    "StatusInfo": "Os cookies Alexa estão atualizados e atualizados pela última vez em %s ",
    "acceptLanguage": "Cabeçalho de Aceitar Idioma Personalizado",
    "alexaLogin": "Dados de login do Alexa",
    "alexaServiceHost": "URL base do Alexa",
    "auth": "Detalhes de login para a conta da Amazon em que os dispositivos de eco estão registrados",
    "auth_info": "As credenciais serão armazenadas criptografadas na sua instância local do ioBroker. Você também pode deixá-los vazios, mas, em seguida, é necessário buscar o cookie Amazon por conta própria ou usar o proxy do adaptador para fazer login e obter o cookie.",
    "bespoken": "Dispositivo Virtual Bespoken",
    "bespokenToken": "Bespoken Validation Token",
    "bespoken_info": "Os Dispositivos Virtuais da Bespoken podem ser usados ​​para enviar comandos de texto para sua Conta da Amazon e fornecer controle limitado sobre seus Dispositivos - quando possível, usando palavras faladas. <br/> <br/> Você precisa criar uma Conta Bespoken e, em seguida, um Dispositivo Virtual para obtenha um Token Bespoken conforme descrito em https://read.Bespoken.io/end-to-end/setup/. Em seguida, você insere o token abaixo e verá novos objetos para o adaptador. <br/> <br/> Observação: Bespoken cria um arquivo de áudio com o texto e o envia para as APIs do Alexa. Portanto, a qualidade de compreensão do Alexa é tão boa quanto essa geração de fala, por isso pode ser problemático com palavras especiais.",
    "cookie": "Biscoito",
    "cookieAlt": "Entrada manual do cookie",
    "cookieAlt_info": "O cookie também pode ser inserido diretamente. E-mail e senha não são necessários",
    "cookieAlt_info2": "Veja por exemplo <a href=\"https://www.gehrig.info/alexa/Alexa.html\" target=\"_blank\">aqui</a> como obter um cookie manualmente ou experimentar o modo proxy do adaptador! Consulte a mensagem de erro no log de URL do proxy",
    "cookieLoginUrl": "Cookie personalizado-Amazon-URL",
    "history": "Configurações de histórico",
    "historyIgnoreEmptySummary": "Ignorar entradas de histórico onde nenhum comando foi reconhecido",
    "history_info": "Configurações para dados de histórico que estão disponíveis nos estados \"History\"",
    "interval": "Intervalos de atualização de dados",
    "interval_info": "Vários dados podem ser atualizados automaticamente. Você define aqui em segundos quantas vezes isso deve acontecer. Usando o histórico de estados. # Trigger, você sempre pode atualizar os dados manualmente. Se você definir 0 como intervalo, a atualização automática será desativada.",
    "overwrite": "Substituir parâmetro especial para determinação e comunicação de cookies",
    "overwrite_info": "Por padrão, os parâmetros são configurados para se conectar a uma conta da Amazon na Alemanha. Se você estiver usando outros países amazônicos, precisará definir os dados corretos aqui. Verifique no Adaptador README para alguns detalhes. Também em certos casos, quando a determinação automática de cookies está falhando, pode ajudar a brincar aqui, especialmente com Accept-Language e user-agent.",
    "password": "senha",
    "proxy": "Configurações de proxy",
    "proxyListenBind": "Ligação Proxy a determinados IPs",
    "proxyOverrideIp": "Container-IP Externo (Docker)",
    "proxyOwnIp": "IP ou nome de host próprio para usar no link do proxy",
    "proxyPort": "Porta proxy",
    "proxyPort_info": "(0 = porta aleatória)",
    "proxy_info": "Se a determinação automática de um cookie não for capaz, o adaptador abre um proxy para permitir um login manual na amazon. O arquivo de registro irá dizer-lhe o URL para usar então. Abra isso no seu navegador, faça login manualmente na Amazon, resolva todos os Captchas ou Autenticações de dois fatores em potencial e o cookie será capturado em segundo plano automaticamente se for bem-sucedido.",
    "push_connection": "Conexão Push",
    "push_connection_info": "Com a conexão push direta, as alterações dos dispositivos Echo são notificadas ao adaptador e são usadas para atualizar apenas os dados necessários em tempo quase real. Se habilitado, os intervalos de atualização de dados abaixo não serão usados.",
    "resetCookie": "Redefinir cookies da Amazon",
    "s (0 = disabled)": "s (0 = desativado)",
    "updateHistoryInterval": "Intervalo de atualização do histórico",
    "updateStateInterval": "Intervalo de atualização de dados (informações do player ...)",
    "usePushConnection": "Use conexão push",
    "userAgent": "Custom User-Agent"
}
