{
    "Email": "Utente/E-mail",
    "Password": "Parola d'ordine",
    "Please wait while loading Adapter-Status ...": "Si prega di attendere durante il caricamento di Adapter-Status ...",
    "ProxyInfo": "Fare clic qui per <a href=\"%s\" target=\"_blank\">accedere al proprio account Amazon una volta</a> per attivare la connessione dell'adattatore ai dispositivi Alexa.",
    "Settings": "impostazioni",
    "StatusInfo": "Alexa-Cookies sono aggiornati e aggiornati per l'ultima volta su %s ",
    "acceptLanguage": "Intestazione di lingua accettabile personalizzata",
    "alexaLogin": "Dati di login di Alexa",
    "alexaServiceHost": "Alexa base url",
    "auth": "Dettagli di accesso per l'account Amazon in cui sono registrati i dispositivi Echo",
    "auth_info": "Le credenziali verranno archiviate crittografate nell'istanza ioBroker locale. Puoi anche lasciarli vuoti, ma poi devi recuperare il cookie Amazon da solo o utilizzare il proxy dall'adattatore per accedere e ottenere il cookie.",
    "bespoken": "Dispositivo virtuale Bespoken",
    "bespokenToken": "Bespoken Validation Token",
    "bespoken_info": "I dispositivi virtuali Bespoken possono essere utilizzati per inviare comandi di testo al tuo account Amazon e forniscono un controllo limitato sui tuoi dispositivi - quando possibile usando parole parlate. <br/> <br/> Devi creare un account Bespoken e poi un dispositivo virtuale per ottenere un token Bespoken come descritto su https://read.Bespoken.io/end-to-end/setup/. Quindi inserisci il token qui sotto e vedrai nuovi oggetti per l'adattatore. <br/> <br/> Nota: Bespoken crea un file audio dal tuo testo e lo invia alle API Alexa. Quindi la qualità della comprensione di Alexa è buona quanto questa generazione di parlato, quindi potrebbe essere problematica con parole speciali.",
    "cookie": "Cookie",
    "cookieAlt": "Inserimento manuale del cookie",
    "cookieAlt_info": "Il cookie può anche essere inserito direttamente. Email e password non sono quindi necessarie",
    "cookieAlt_info2": "Vedi per es. <a href=\"https://www.gehrig.info/alexa/Alexa.html\" target=\"_blank\">qui</a> come ottenere manualmente un cookie o provare la modalità proxy dell'adattatore! Vedere Messaggio di errore nel registro per l'URL del proxy",
    "cookieLoginUrl": "Cookie personalizzato-Amazon-URL",
    "history": "Impostazioni cronologia",
    "historyIgnoreEmptySummary": "Ignora voci di cronologia in cui non è stato riconosciuto alcun comando",
    "history_info": "Impostazioni per i dati della cronologia disponibili negli stati \"History\"",
    "interval": "Intervalli di aggiornamento dei dati",
    "interval_info": "Diversi dati possono essere aggiornati automaticamente. Definisci qui in secondi quanto spesso ciò dovrebbe accadere. Utilizzando la cronologia dello stato. # Trigger puoi sempre aggiornare i dati manualmente. Se si imposta 0 come intervallo, l'aggiornamento automatico è disabilitato.",
    "overwrite": "Sostituisci i parametri speciali per la determinazione e la comunicazione dei cookie",
    "overwrite_info": "Di default i parametri sono impostati per connettersi con un account tedesco di Amazon. Se stai utilizzando altri paesi di Amazon, devi impostare qui i dati corretti. Controllare in Adapter README per alcuni dettagli. Inoltre, in alcuni casi in cui la determinazione automatica dei cookie non funziona, può aiutare a giocare qui, specialmente con Accept-Language e user-agent.",
    "password": "parola d'ordine",
    "proxy": "Impostazioni proxy",
    "proxyListenBind": "Collegamento a determinati indirizzi IP",
    "proxyOverrideIp": "External Container-IP (Docker)",
    "proxyOwnIp": "Proprio IP o nome host da utilizzare nel collegamento proxy",
    "proxyPort": "Porta proxy",
    "proxyPort_info": "(0 = porta casuale)",
    "proxy_info": "Se la determinazione automatica di un cookie non è possibile, l'adattatore apre un proxy per consentire l'accesso manuale ad Amazon. Il file di registro ti indicherà l'URL da utilizzare in quel momento. Apri questo nel tuo browser, accedi manualmente ad Amazon, risolvi tutti i potenziali Captcha o Autenticazione a due fattori e il cookie viene automaticamente catturato in background in caso di successo.",
    "push_connection": "Push-Connection",
    "push_connection_info": "Con la connessione diretta, le modifiche apportate dai dispositivi Echo vengono notificate all'adattatore e vengono utilizzate per aggiornare solo i dati necessari quasi in tempo reale. Se abilitato, gli intervalli di aggiornamento dati di seguito non vengono utilizzati.",
    "resetCookie": "Reimposta i cookie Amazon",
    "s (0 = disabled)": "s (0 = disabilitato)",
    "updateHistoryInterval": "Intervallo di aggiornamento della cronologia",
    "updateStateInterval": "Intervallo di aggiornamento dei dati (Player-Info ...)",
    "usePushConnection": "Utilizzare la connessione push",
    "userAgent": "User-Agent personalizzato"
}
