{
    "Email": "E-Mail",
    "Password": "Password",
    "Please wait while loading Adapter-Status ...": "Please wait while loading Adapter-Status …",
    "ProxyInfo": "Please click <a href=\"%s\" target=\"_blank\">here to log in to your Amazon Account once</a> to activate the connection to your Alexa devices for this instance.",
    "Settings": "Settings",
    "StatusInfo": "Alexa-Cookies are up to date and last updated on %s",
    "acceptLanguage": "Custom Accept-Language Header",
    "alexaLogin": "Alexa login data",
    "alexaServiceHost": "Alexa base url",
    "auth": "Login Details for Amazon Account where your Alexa devices are registered",
    "auth_info": "The credentials will be stored encrypted in your local ioBroker instance. You can also leave them empty, but then you need to fetch the Amazon cookie by your own or use the proxy from the adapter to login and get the cookie.",
    "autoQueryActivityOnTrigger": "Automatically query activity on device interaction",
    "autoQueryActivityOnTrigger_info": "Please only enable if you really need activity information automatically!",
    "bespoken": "Bespoken Virtual Device",
    "bespokenToken": "Bespoken Validation Token",
    "bespoken_info": "The Bespoken Virtual Devices can be used to send text commands to you Amazon Account and gives limited control over your Devices - when possible using spoken words.<br/><br/>You need to create a Bespoken Account and then a Virtual Device to get a Bespoken Token as described on https://read.Bespoken.io/end-to-end/setup/ . Then you enter the token below and you will see new objects for the adapter.<br/><br/>Please note: Bespoken creates a audio file out of your text and sends this to the Alexa-APIs. So the understanding quality of Alexa is as good as this speech generation, so it may be problematic with special words.",
    "cookie": "Cookie",
    "cookieAlt": "Manual input of the cookie",
    "cookieAlt_info": "The cookie can also be entered directly. E-Mail & password are then not required",
    "cookieAlt_info2": "",
    "cookieLoginUrl": "Custom Cookie-Amazon-URL",
    "device_settings": "Device Settings",
    "device_settings_info": "Settings for the devices that are fetched from Amazon",
    "history": "History Settings",
    "historyIgnoreEmptySummary": "Ignore History-Entries when no command was recognized",
    "history_info": "Settings for History data that are available in the \"History\" states",
    "includeAppDevices": "Query and add also App-Devices",
    "interval": "Data update interval",
    "interval_info": "Several data can be updated automatically. You define here in seconds how often this should happen. Using the state history.#trigger you can always update the data manually. If you set 0 as interval the automatic update is disabled. ",
    "overwrite": "Override special parameter for cookie determination and communication",
    "overwrite_info": "By default the parameters are set to connect with a german Amazon account. If your account is located in an other Amazon country you need to enter the correct details here. Check in Adapter README for some details. Also in certain cases when the automatic cookie determination is failing it can help to play around here especially with the Accept-Language and user-agent settings.",
    "password": "Password",
    "proxy": "Proxy Settings",
    "proxyListenBind": "Proxy Binding to certain IP",
    "proxyOverrideIp": "External Container-IP (Docker)",
    "proxyOwnIp": "Own IP or hostname to use in proxy link",
    "proxyPort": "Proxy-Port",
    "proxyPort_info": "(0 = random port)",
    "proxy_info": "If the automatic determination of a cookie was not possible, the adapter opens a proxy to allow a manual login to amazon. The Logfile and Admin screen will tell you the URL to use then. Open this in your browser, manually login into Amazon, solve all potential Captchas or Two-Factor-Authentications and the cookie is catched automatically in the background if successful.",
    "push_connection": "Push-Connection",
    "push_connection_info": "With the direct push connection the changes from the Alexa devices are notified to the adapter and are used to update only needed data in near real time. If enabled some data update intervals below are not used. It is Urgently recommended to use the push connection to limit the data requested from the amazon cloud!",
    "resetCookie": "Reset Amazon Cookies",
    "s (0 = disabled)": "s (0 = disabled)",
    "sync_settings": "Synchronization Settings",
    "sync_settings_info": "Specify which data should be synced from the Amazon Cloud to the ioBroker instance. Please only enable the data you really need!",
    "synchronizeLists": "Synchronize Lists (e.g. Todo)",
    "synchronizeSmartHomeDevices": "Synchronize Smart Home Devices",
    "updateConfigurationInterval": "Device Configuration update interval",
    "updateConfigurationInterval_info": "The device configuration can be updated automatically. The update interval defines how often this should happen. Do not set this too low because else Amazon might block you! The Minimum is 300s or set to 0 to disable the update.",
    "updateHistoryInterval": "History update interval",
    "updateHistoryInterval_info": "The History update interval defines how often the History data should be updated from the Amazon servers. The minimum is 60s or set to 0 to disable the update. Do not set this too low because else Amazon might block you! When the Push-Connection is established the update interval is not used because push information will trigger it when needed automatically.",
    "updateSmartHomeDevicesInterval": "Smart Home devices update interval",
    "updateSmartHomeDevicesInterval_info": "Please enable this interval only if you really need the values of the smart home devices! Only the smart home devices that have #includeInIntervalQuery activated in the objects and actively report their status to Amazon systems are updated to make sure to not create issues and costs on the skill developer side! Do not set this too low because else Amazon might block you! The Minimum is 900s or set to 0 to disable the update (can be triggered manually via #query states).",
    "updateStateInterval": "Data update interval (player info …)",
    "updateStateInterval_info": "The general device data update interval defines how often the data should be updated from the Amazon servers. The minimum is 300s or set to 0 to disable the update. Do not set this too low because else Amazon might block you! When the Push-Connection is established the update interval is set to 60 minutes when enabled.",
    "usePushConnection": "Use push connection",
    "userAgent": "Custom User-Agent"
}
