{
    "Email": "Utilisateur/Email",
    "Password": "Mot de passe",
    "Please wait while loading Adapter-Status ...": "Veuillez patienter pendant le chargement de Adapter-Status ...",
    "ProxyInfo": "Veuillez cliquer <a href=\"%s\" target=\"_blank\">ici pour vous connecter une fois à votre compte Amazon</a> afin d'activer la connexion à vos appareils Alexa pour cette instance.",
    "Settings": "Paramètres",
    "StatusInfo": "Les cookies Alexa sont à jour et mis à jour pour la dernière fois le %s ",
    "acceptLanguage": "En-tête personnalisé Accept-Language",
    "alexaLogin": "Données de connexion Alexa",
    "alexaServiceHost": "Alexa base de l'Alexa",
    "auth": "Détails de connexion pour le compte Amazon où les appareils Echo sont enregistrés",
    "auth_info": "Les informations d'identification seront stockées cryptées dans votre instance ioBroker locale. Vous pouvez également les laisser vides, mais vous devez ensuite récupérer le cookie Amazon par vous-même ou utiliser le proxy de l'adaptateur pour vous connecter et obtenir le cookie.",
    "autoQueryActivityOnTrigger": "Interroger automatiquement l'activité sur l'interaction de l'appareil",
    "autoQueryActivityOnTrigger_info": "Veuillez l'activer uniquement si vous avez vraiment besoin automatiquement d'informations sur votre activité !",
    "bespoken": "Appareil virtuel Bespoken",
    "bespokenToken": "Bespoken Validation Token",
    "bespoken_info": "Les périphériques virtuels Bespoken peuvent être utilisés pour envoyer des commandes de texte à votre compte Amazon et donner un contrôle limité sur vos périphériques - si possible en utilisant des mots prononcés. <br/> <br/> Vous devez créer un compte Bespoken puis un périphérique virtuel pour obtenir un jeton Bespoken comme décrit sur https://read.Bespoken.io/end-to-end/setup/. Ensuite, vous entrez le jeton ci-dessous et vous verrez de nouveaux objets pour l'adaptateur. <br/> <br/> Remarque: Bespoken crée un fichier audio à partir de votre texte et l'envoie aux API Alexa. Donc, la qualité de la compréhension d’Alex est aussi bonne que cette génération de discours, donc il peut être problématique avec des mots spéciaux.",
    "cookie": "Cookie",
    "cookieAlt": "Entrée manuelle du cookie",
    "cookieAlt_info": "Le cookie peut également être entré directement. L'email et le mot de passe ne sont pas requis",
    "cookieAlt_info2": "Voir par exemple <a href=\"https://www.gehrig.info/alexa/Alexa.html\" target=\"_blank\">ici</a> comment obtenir un cookie manuellement ou essayez le mode proxy de l'adaptateur! Voir le message d'erreur dans le journal pour l'URL du proxy",
    "cookieLoginUrl": "Cookie personnalisé-Amazon-URL",
    "device_settings": "Réglages de l'appareil",
    "device_settings_info": "Paramètres des appareils récupérés sur Amazon",
    "history": "Paramètres d'historique",
    "historyIgnoreEmptySummary": "Ignorer les entrées d'historique où aucune commande n'a été reconnue",
    "history_info": "Paramètres des données d'historique disponibles dans les états \"History\"",
    "includeAppDevices": "Interroger et ajouter également des appareils d'application",
    "interval": "Intervalles de mise à jour",
    "interval_info": "Plusieurs données peuvent être automatiquement mises à jour. Vous définissez ici en secondes combien de fois cela devrait arriver. En utilisant l'historique d'état. # Trigger, vous pouvez toujours mettre à jour les données manuellement. Si vous définissez 0 comme intervalle, la mise à jour automatique est désactivée.",
    "overwrite": "Remplacer le paramètre spécial pour la détermination des cookies et la communication",
    "overwrite_info": "Par défaut, les paramètres sont définis pour se connecter avec un compte amazon allemand. Si vous utilisez d'autres pays amazon, vous devez définir les données correctes ici. Vérifiez l'adaptateur README pour plus de détails. Dans certains cas, lorsque la détermination automatique des cookies échoue, cela peut aider à jouer ici, en particulier avec Accept-Language et user-agent.",
    "password": "mot de passe",
    "proxy": "Paramètres du proxy",
    "proxyListenBind": "Liaison proxy à certaines adresses IP",
    "proxyOverrideIp": "IP de conteneur externe (Docker)",
    "proxyOwnIp": "Propre IP ou nom d'hôte à utiliser dans un lien de proxy",
    "proxyPort": "Port proxy",
    "proxyPort_info": "(0 = port aléatoire)",
    "proxy_info": "Si la détermination automatique d'un cookie n'est pas possible, l'adaptateur ouvre un proxy pour autoriser une connexion manuelle à amazon. Le fichier journal vous indiquera l'URL à utiliser ensuite. Ouvrez-le dans votre navigateur, connectez-vous manuellement à Amazon, résolvez tous les captcha potentiels ou les authentifications à deux facteurs et le cookie est automatiquement récupéré en arrière-plan en cas de succès.",
    "push_connection": "Push-Connection",
    "push_connection_info": "Avec la connexion push directe les changements des appareils Alexa sont notifiés à l'adaptateur et sont utilisés pour mettre à jour seulement les données nécessaires en temps réel. Si activé certains intervalles de mise à jour de données ci-dessous ne sont pas utilisés. Il est urgent d'utiliser la connexion push pour limiter les données demandées sur le nuage amazon!",
    "resetCookie": "Réinitialiser les cookies Amazon",
    "s (0 = disabled)": "s (0 = désactivé)",
    "sync_settings": "Paramètres de synchronisation",
    "sync_settings_info": "Préciser quelles données doivent être synchronisées depuis Amazon Cloud jusqu'à l'instance ioBroker. Veuillez uniquement activer les données dont vous avez vraiment besoin !",
    "synchronizeLists": "Synchroniser les listes (par exemple Todo)",
    "synchronizeSmartHomeDevices": "Synchroniser les appareils domestiques intelligents",
    "updateConfigurationInterval": "Intervalle de mise à jour de la configuration de l'appareil",
    "updateConfigurationInterval_info": "La configuration de l'appareil peut être mise à jour automatiquement. L'intervalle de mise à jour définit combien de fois cela devrait se produire. Ne le mettez pas trop bas parce que d'autres Amazon pourraient vous bloquer! Le minimum est de 300 ou de 0 pour désactiver la mise à jour.",
    "updateHistoryInterval": "Intervalle de mise à",
    "updateHistoryInterval_info": "L'intervalle de mise à jour d'Histoire définit la fréquence de mise à jour des données d'Histoire des serveurs Amazon. Le minimum est de 60 ou de 0 pour désactiver la mise à jour. Ne le mettez pas trop bas parce que d'autres Amazon pourraient vous bloquer! Lorsque le Push-Connection est établi, l'intervalle de mise à jour n'est pas utilisé parce que l'information de poussée le déclenchera au besoin automatiquement.",
    "updateSmartHomeDevicesInterval": "Intervalle de mise à jour des appareils Smart Home",
    "updateSmartHomeDevicesInterval_info": "Veuillez activer cet intervalle seulement si vous avez vraiment besoin des valeurs des appareils à domicile intelligents! Seuls les appareils smart home qui ont #includeInIntervalQuery activés dans les objets et rapportent activement leur statut aux systèmes Amazon sont mis à jour pour s'assurer de ne pas créer de problèmes et de coûts sur le côté développeur de compétences! Ne le mettez pas trop bas parce que d'autres Amazon pourraient vous bloquer! Le minimum est de 900 ou défini à 0 pour désactiver la mise à jour (peut être déclenché manuellement via les états #query).",
    "updateStateInterval": "Intervalle de mise à jour des données (Player-Info ...)",
    "updateStateInterval_info": "L'intervalle général de mise à jour des données de périphérique définit la fréquence de mise à jour des données des serveurs Amazon. Le minimum est de 300 ou de 0 pour désactiver la mise à jour. Ne le mettez pas trop bas parce que d'autres Amazon pourraient vous bloquer! Lorsque le Push-Connection est établi, l'intervalle de mise à jour est fixé à 60 minutes lorsque activé.",
    "usePushConnection": "Utiliser la connexion push",
    "userAgent": "User-Agent personnalisé"
}
